Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_tcp_client/src/packs/WBZ653_DFP/component/usbcore.h
/*
 * Component description for USBCORE
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2024-07-18T20:17:01Z */
#ifndef _WBZ65_USBCORE_COMPONENT_H_
#define _WBZ65_USBCORE_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR USBCORE                                      */
/* ************************************************************************** */

/* -------- USBCORE_UOTGIR : (USBCORE Offset: 0x40) (R/W 32) USB OTG Interrupt Status Register -------- */
#define USBCORE_UOTGIR_AVBUS_VLD_Pos          _UINT32_(0)                                          /* (USBCORE_UOTGIR) A-VBUS change indicator bit Position */
#define USBCORE_UOTGIR_AVBUS_VLD_Msk          (_UINT32_(0x1) << USBCORE_UOTGIR_AVBUS_VLD_Pos)      /* (USBCORE_UOTGIR) A-VBUS change indicator bit Mask */
#define USBCORE_UOTGIR_AVBUS_VLD(value)       (USBCORE_UOTGIR_AVBUS_VLD_Msk & (_UINT32_(value) << USBCORE_UOTGIR_AVBUS_VLD_Pos)) /* Assigment of value for AVBUS_VLD in the USBCORE_UOTGIR register */
#define   USBCORE_UOTGIR_AVBUS_VLD_CHANGE_Val _UINT32_(0x1)                                        /* (USBCORE_UOTGIR) Change on usb_a_vbus_vld input detected  */
#define   USBCORE_UOTGIR_AVBUS_VLD_NO_CHANGE_Val _UINT32_(0x0)                                        /* (USBCORE_UOTGIR) No change on usb_a_vbus_vld input detected  */
#define USBCORE_UOTGIR_AVBUS_VLD_CHANGE       (USBCORE_UOTGIR_AVBUS_VLD_CHANGE_Val << USBCORE_UOTGIR_AVBUS_VLD_Pos) /* (USBCORE_UOTGIR) Change on usb_a_vbus_vld input detected Position  */
#define USBCORE_UOTGIR_AVBUS_VLD_NO_CHANGE    (USBCORE_UOTGIR_AVBUS_VLD_NO_CHANGE_Val << USBCORE_UOTGIR_AVBUS_VLD_Pos) /* (USBCORE_UOTGIR) No change on usb_a_vbus_vld input detected Position  */
#define USBCORE_UOTGIR_BSESS_END_Pos          _UINT32_(2)                                          /* (USBCORE_UOTGIR) B-Device VBUS change indicator bit Position */
#define USBCORE_UOTGIR_BSESS_END_Msk          (_UINT32_(0x1) << USBCORE_UOTGIR_BSESS_END_Pos)      /* (USBCORE_UOTGIR) B-Device VBUS change indicator bit Mask */
#define USBCORE_UOTGIR_BSESS_END(value)       (USBCORE_UOTGIR_BSESS_END_Msk & (_UINT32_(value) << USBCORE_UOTGIR_BSESS_END_Pos)) /* Assigment of value for BSESS_END in the USBCORE_UOTGIR register */
#define   USBCORE_UOTGIR_BSESS_END_CHANGE_Val _UINT32_(0x1)                                        /* (USBCORE_UOTGIR) Change on usb_b_sess_end input detected  */
#define   USBCORE_UOTGIR_BSESS_END_NO_CHANGED_Val _UINT32_(0x0)                                        /* (USBCORE_UOTGIR) No change on usb_b_sess_end input detected  */
#define USBCORE_UOTGIR_BSESS_END_CHANGE       (USBCORE_UOTGIR_BSESS_END_CHANGE_Val << USBCORE_UOTGIR_BSESS_END_Pos) /* (USBCORE_UOTGIR) Change on usb_b_sess_end input detected Position  */
#define USBCORE_UOTGIR_BSESS_END_NO_CHANGED   (USBCORE_UOTGIR_BSESS_END_NO_CHANGED_Val << USBCORE_UOTGIR_BSESS_END_Pos) /* (USBCORE_UOTGIR) No change on usb_b_sess_end input detected Position  */
#define USBCORE_UOTGIR_SESVDIF_Pos            _UINT32_(3)                                          /* (USBCORE_UOTGIR) Session Valid Change Indicator bit Position */
#define USBCORE_UOTGIR_SESVDIF_Msk            (_UINT32_(0x1) << USBCORE_UOTGIR_SESVDIF_Pos)        /* (USBCORE_UOTGIR) Session Valid Change Indicator bit Mask */
#define USBCORE_UOTGIR_SESVDIF(value)         (USBCORE_UOTGIR_SESVDIF_Msk & (_UINT32_(value) << USBCORE_UOTGIR_SESVDIF_Pos)) /* Assigment of value for SESVDIF in the USBCORE_UOTGIR register */
#define   USBCORE_UOTGIR_SESVDIF_CHANGE_Val   _UINT32_(0x1)                                        /* (USBCORE_UOTGIR) Change on usb_sess_vld input detected  */
#define   USBCORE_UOTGIR_SESVDIF_NO_CHANGED_Val _UINT32_(0x0)                                        /* (USBCORE_UOTGIR) No change on usb_sess_vld input detected  */
#define USBCORE_UOTGIR_SESVDIF_CHANGE         (USBCORE_UOTGIR_SESVDIF_CHANGE_Val << USBCORE_UOTGIR_SESVDIF_Pos) /* (USBCORE_UOTGIR) Change on usb_sess_vld input detected Position  */
#define USBCORE_UOTGIR_SESVDIF_NO_CHANGED     (USBCORE_UOTGIR_SESVDIF_NO_CHANGED_Val << USBCORE_UOTGIR_SESVDIF_Pos) /* (USBCORE_UOTGIR) No change on usb_sess_vld input detected Position  */
#define USBCORE_UOTGIR_ACTVIF_Pos             _UINT32_(4)                                          /* (USBCORE_UOTGIR) Bus Activity Indicator bit Position */
#define USBCORE_UOTGIR_ACTVIF_Msk             (_UINT32_(0x1) << USBCORE_UOTGIR_ACTVIF_Pos)         /* (USBCORE_UOTGIR) Bus Activity Indicator bit Mask */
#define USBCORE_UOTGIR_ACTVIF(value)          (USBCORE_UOTGIR_ACTVIF_Msk & (_UINT32_(value) << USBCORE_UOTGIR_ACTVIF_Pos)) /* Assigment of value for ACTVIF in the USBCORE_UOTGIR register */
#define   USBCORE_UOTGIR_ACTVIF_DETECT_Val    _UINT32_(0x1)                                        /* (USBCORE_UOTGIR) Activity on the D+, D-, ID, or VBus lines has been detected  */
#define   USBCORE_UOTGIR_ACTVIF_NO_DETECT_Val _UINT32_(0x0)                                        /* (USBCORE_UOTGIR) Active has not been detected  */
#define USBCORE_UOTGIR_ACTVIF_DETECT          (USBCORE_UOTGIR_ACTVIF_DETECT_Val << USBCORE_UOTGIR_ACTVIF_Pos) /* (USBCORE_UOTGIR) Activity on the D+, D-, ID, or VBus lines has been detected Position  */
#define USBCORE_UOTGIR_ACTVIF_NO_DETECT       (USBCORE_UOTGIR_ACTVIF_NO_DETECT_Val << USBCORE_UOTGIR_ACTVIF_Pos) /* (USBCORE_UOTGIR) Active has not been detected Position  */
#define USBCORE_UOTGIR_LSTATEIF_Pos           _UINT32_(5)                                          /* (USBCORE_UOTGIR) Line State Stable Indicator bit Position */
#define USBCORE_UOTGIR_LSTATEIF_Msk           (_UINT32_(0x1) << USBCORE_UOTGIR_LSTATEIF_Pos)       /* (USBCORE_UOTGIR) Line State Stable Indicator bit Mask */
#define USBCORE_UOTGIR_LSTATEIF(value)        (USBCORE_UOTGIR_LSTATEIF_Msk & (_UINT32_(value) << USBCORE_UOTGIR_LSTATEIF_Pos)) /* Assigment of value for LSTATEIF in the USBCORE_UOTGIR register */
#define   USBCORE_UOTGIR_LSTATEIF_STABLE_Val  _UINT32_(0x1)                                        /* (USBCORE_UOTGIR) USB line state has been stable for 1ms  */
#define   USBCORE_UOTGIR_LSTATEIF_NOT_STABLE_Val _UINT32_(0x0)                                        /* (USBCORE_UOTGIR) USB line state has not been stable for 1ms  */
#define USBCORE_UOTGIR_LSTATEIF_STABLE        (USBCORE_UOTGIR_LSTATEIF_STABLE_Val << USBCORE_UOTGIR_LSTATEIF_Pos) /* (USBCORE_UOTGIR) USB line state has been stable for 1ms Position  */
#define USBCORE_UOTGIR_LSTATEIF_NOT_STABLE    (USBCORE_UOTGIR_LSTATEIF_NOT_STABLE_Val << USBCORE_UOTGIR_LSTATEIF_Pos) /* (USBCORE_UOTGIR) USB line state has not been stable for 1ms Position  */
#define USBCORE_UOTGIR_T1MSECIF_Pos           _UINT32_(6)                                          /* (USBCORE_UOTGIR) 1 Millisecond Timer bit Position */
#define USBCORE_UOTGIR_T1MSECIF_Msk           (_UINT32_(0x1) << USBCORE_UOTGIR_T1MSECIF_Pos)       /* (USBCORE_UOTGIR) 1 Millisecond Timer bit Mask */
#define USBCORE_UOTGIR_T1MSECIF(value)        (USBCORE_UOTGIR_T1MSECIF_Msk & (_UINT32_(value) << USBCORE_UOTGIR_T1MSECIF_Pos)) /* Assigment of value for T1MSECIF in the USBCORE_UOTGIR register */
#define   USBCORE_UOTGIR_T1MSECIF_EXPIRE_Val  _UINT32_(0x1)                                        /* (USBCORE_UOTGIR) 1ms timer has expired  */
#define   USBCORE_UOTGIR_T1MSECIF_NOT_EXPIRE_Val _UINT32_(0x0)                                        /* (USBCORE_UOTGIR) 1ms timer has not expired  */
#define USBCORE_UOTGIR_T1MSECIF_EXPIRE        (USBCORE_UOTGIR_T1MSECIF_EXPIRE_Val << USBCORE_UOTGIR_T1MSECIF_Pos) /* (USBCORE_UOTGIR) 1ms timer has expired Position  */
#define USBCORE_UOTGIR_T1MSECIF_NOT_EXPIRE    (USBCORE_UOTGIR_T1MSECIF_NOT_EXPIRE_Val << USBCORE_UOTGIR_T1MSECIF_Pos) /* (USBCORE_UOTGIR) 1ms timer has not expired Position  */
#define USBCORE_UOTGIR_IDIF_Pos               _UINT32_(7)                                          /* (USBCORE_UOTGIR) ID State Change Indicator bit Position */
#define USBCORE_UOTGIR_IDIF_Msk               (_UINT32_(0x1) << USBCORE_UOTGIR_IDIF_Pos)           /* (USBCORE_UOTGIR) ID State Change Indicator bit Mask */
#define USBCORE_UOTGIR_IDIF(value)            (USBCORE_UOTGIR_IDIF_Msk & (_UINT32_(value) << USBCORE_UOTGIR_IDIF_Pos)) /* Assigment of value for IDIF in the USBCORE_UOTGIR register */
#define   USBCORE_UOTGIR_IDIF_DETECT_Val      _UINT32_(0x1)                                        /* (USBCORE_UOTGIR) Change in ID state is detected  */
#define   USBCORE_UOTGIR_IDIF_NO_DETECT_Val   _UINT32_(0x0)                                        /* (USBCORE_UOTGIR) No change in ID state is detected  */
#define USBCORE_UOTGIR_IDIF_DETECT            (USBCORE_UOTGIR_IDIF_DETECT_Val << USBCORE_UOTGIR_IDIF_Pos) /* (USBCORE_UOTGIR) Change in ID state is detected Position  */
#define USBCORE_UOTGIR_IDIF_NO_DETECT         (USBCORE_UOTGIR_IDIF_NO_DETECT_Val << USBCORE_UOTGIR_IDIF_Pos) /* (USBCORE_UOTGIR) No change in ID state is detected Position  */
#define USBCORE_UOTGIR_Msk                    _UINT32_(0x000000FD)                                 /* (USBCORE_UOTGIR) Register Mask  */


/* -------- USBCORE_UOTGIRCLR : (USBCORE Offset: 0x44) (R/W 32)  -------- */
#define USBCORE_UOTGIRCLR_RESETVALUE          _UINT32_(0x00)                                       /*  (USBCORE_UOTGIRCLR)   Reset Value */

#define USBCORE_UOTGIRCLR_Msk                 _UINT32_(0x00000000)                                 /* (USBCORE_UOTGIRCLR) Register Mask  */


