Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_tcp_client/src/packs/WBZ653_DFP/component/usbcore.h
/* -------- USBCORE_UOTGCON : (USBCORE Offset: 0x70) (R/W 32) USB OTG Control Register -------- */
#define USBCORE_UOTGCON_VBUSDIS_Pos           _UINT32_(0)                                          /* (USBCORE_UOTGCON) Vbus Discharge Enable bit Position */
#define USBCORE_UOTGCON_VBUSDIS_Msk           (_UINT32_(0x1) << USBCORE_UOTGCON_VBUSDIS_Pos)       /* (USBCORE_UOTGCON) Vbus Discharge Enable bit Mask */
#define USBCORE_UOTGCON_VBUSDIS(value)        (USBCORE_UOTGCON_VBUSDIS_Msk & (_UINT32_(value) << USBCORE_UOTGCON_VBUSDIS_Pos)) /* Assigment of value for VBUSDIS in the USBCORE_UOTGCON register */
#define   USBCORE_UOTGCON_VBUSDIS_DISCHG_Val  _UINT32_(0x1)                                        /* (USBCORE_UOTGCON) Vbus line is discharged through a pull-down resistor  */
#define   USBCORE_UOTGCON_VBUSDIS_NOT_DISCHG_Val _UINT32_(0x0)                                        /* (USBCORE_UOTGCON) Vbus line is not discharged through a resistor  */
#define USBCORE_UOTGCON_VBUSDIS_DISCHG        (USBCORE_UOTGCON_VBUSDIS_DISCHG_Val << USBCORE_UOTGCON_VBUSDIS_Pos) /* (USBCORE_UOTGCON) Vbus line is discharged through a pull-down resistor Position  */
#define USBCORE_UOTGCON_VBUSDIS_NOT_DISCHG    (USBCORE_UOTGCON_VBUSDIS_NOT_DISCHG_Val << USBCORE_UOTGCON_VBUSDIS_Pos) /* (USBCORE_UOTGCON) Vbus line is not discharged through a resistor Position  */
#define USBCORE_UOTGCON_VBUSCHG_Pos           _UINT32_(1)                                          /* (USBCORE_UOTGCON) Vbus Charge Enable bit Position */
#define USBCORE_UOTGCON_VBUSCHG_Msk           (_UINT32_(0x1) << USBCORE_UOTGCON_VBUSCHG_Pos)       /* (USBCORE_UOTGCON) Vbus Charge Enable bit Mask */
#define USBCORE_UOTGCON_VBUSCHG(value)        (USBCORE_UOTGCON_VBUSCHG_Msk & (_UINT32_(value) << USBCORE_UOTGCON_VBUSCHG_Pos)) /* Assigment of value for VBUSCHG in the USBCORE_UOTGCON register */
#define   USBCORE_UOTGCON_VBUSCHG_CHG_Val     _UINT32_(0x1)                                        /* (USBCORE_UOTGCON) Vbus line is charged through a pull-up resistor  */
#define   USBCORE_UOTGCON_VBUSCHG_NOT_CHG_Val _UINT32_(0x0)                                        /* (USBCORE_UOTGCON) Vbus line is not charged through a resistor  */
#define USBCORE_UOTGCON_VBUSCHG_CHG           (USBCORE_UOTGCON_VBUSCHG_CHG_Val << USBCORE_UOTGCON_VBUSCHG_Pos) /* (USBCORE_UOTGCON) Vbus line is charged through a pull-up resistor Position  */
#define USBCORE_UOTGCON_VBUSCHG_NOT_CHG       (USBCORE_UOTGCON_VBUSCHG_NOT_CHG_Val << USBCORE_UOTGCON_VBUSCHG_Pos) /* (USBCORE_UOTGCON) Vbus line is not charged through a resistor Position  */
#define USBCORE_UOTGCON_OTGEN_Pos             _UINT32_(2)                                          /* (USBCORE_UOTGCON) OTG Functionality Enable bit Position */
#define USBCORE_UOTGCON_OTGEN_Msk             (_UINT32_(0x1) << USBCORE_UOTGCON_OTGEN_Pos)         /* (USBCORE_UOTGCON) OTG Functionality Enable bit Mask */
#define USBCORE_UOTGCON_OTGEN(value)          (USBCORE_UOTGCON_OTGEN_Msk & (_UINT32_(value) << USBCORE_UOTGCON_OTGEN_Pos)) /* Assigment of value for OTGEN in the USBCORE_UOTGCON register */
#define   USBCORE_UOTGCON_OTGEN_ON_Val        _UINT32_(0x1)                                        /* (USBCORE_UOTGCON) DPPULUP  */
#define   USBCORE_UOTGCON_OTGEN_OFF_Val       _UINT32_(0x0)                                        /* (USBCORE_UOTGCON) DPPULUP  */
#define USBCORE_UOTGCON_OTGEN_ON              (USBCORE_UOTGCON_OTGEN_ON_Val << USBCORE_UOTGCON_OTGEN_Pos) /* (USBCORE_UOTGCON) DPPULUP Position  */
#define USBCORE_UOTGCON_OTGEN_OFF             (USBCORE_UOTGCON_OTGEN_OFF_Val << USBCORE_UOTGCON_OTGEN_Pos) /* (USBCORE_UOTGCON) DPPULUP Position  */
#define USBCORE_UOTGCON_VBUSON_Pos            _UINT32_(3)                                          /* (USBCORE_UOTGCON) Vbus Power-on bit Position */
#define USBCORE_UOTGCON_VBUSON_Msk            (_UINT32_(0x1) << USBCORE_UOTGCON_VBUSON_Pos)        /* (USBCORE_UOTGCON) Vbus Power-on bit Mask */
#define USBCORE_UOTGCON_VBUSON(value)         (USBCORE_UOTGCON_VBUSON_Msk & (_UINT32_(value) << USBCORE_UOTGCON_VBUSON_Pos)) /* Assigment of value for VBUSON in the USBCORE_UOTGCON register */
#define   USBCORE_UOTGCON_VBUSON_ON_Val       _UINT32_(0x1)                                        /* (USBCORE_UOTGCON) Vbus line is powered  */
#define   USBCORE_UOTGCON_VBUSON_OFF_Val      _UINT32_(0x0)                                        /* (USBCORE_UOTGCON) Vbus line is not powered  */
#define USBCORE_UOTGCON_VBUSON_ON             (USBCORE_UOTGCON_VBUSON_ON_Val << USBCORE_UOTGCON_VBUSON_Pos) /* (USBCORE_UOTGCON) Vbus line is powered Position  */
#define USBCORE_UOTGCON_VBUSON_OFF            (USBCORE_UOTGCON_VBUSON_OFF_Val << USBCORE_UOTGCON_VBUSON_Pos) /* (USBCORE_UOTGCON) Vbus line is not powered Position  */
#define USBCORE_UOTGCON_DMPULDWN_Pos          _UINT32_(4)                                          /* (USBCORE_UOTGCON) D- Pull-Down Enable bit Position */
#define USBCORE_UOTGCON_DMPULDWN_Msk          (_UINT32_(0x1) << USBCORE_UOTGCON_DMPULDWN_Pos)      /* (USBCORE_UOTGCON) D- Pull-Down Enable bit Mask */
#define USBCORE_UOTGCON_DMPULDWN(value)       (USBCORE_UOTGCON_DMPULDWN_Msk & (_UINT32_(value) << USBCORE_UOTGCON_DMPULDWN_Pos)) /* Assigment of value for DMPULDWN in the USBCORE_UOTGCON register */
#define   USBCORE_UOTGCON_DMPULDWN_ON_Val     _UINT32_(0x1)                                        /* (USBCORE_UOTGCON) D- data line pull-down resistor is enabled  */
#define   USBCORE_UOTGCON_DMPULDWN_OFF_Val    _UINT32_(0x0)                                        /* (USBCORE_UOTGCON) D- data line pull-down resistor is disabled  */
#define USBCORE_UOTGCON_DMPULDWN_ON           (USBCORE_UOTGCON_DMPULDWN_ON_Val << USBCORE_UOTGCON_DMPULDWN_Pos) /* (USBCORE_UOTGCON) D- data line pull-down resistor is enabled Position  */
#define USBCORE_UOTGCON_DMPULDWN_OFF          (USBCORE_UOTGCON_DMPULDWN_OFF_Val << USBCORE_UOTGCON_DMPULDWN_Pos) /* (USBCORE_UOTGCON) D- data line pull-down resistor is disabled Position  */
#define USBCORE_UOTGCON_DPPULDWN_Pos          _UINT32_(5)                                          /* (USBCORE_UOTGCON) D+ Pull-Down Enable bit Position */
#define USBCORE_UOTGCON_DPPULDWN_Msk          (_UINT32_(0x1) << USBCORE_UOTGCON_DPPULDWN_Pos)      /* (USBCORE_UOTGCON) D+ Pull-Down Enable bit Mask */
#define USBCORE_UOTGCON_DPPULDWN(value)       (USBCORE_UOTGCON_DPPULDWN_Msk & (_UINT32_(value) << USBCORE_UOTGCON_DPPULDWN_Pos)) /* Assigment of value for DPPULDWN in the USBCORE_UOTGCON register */
#define   USBCORE_UOTGCON_DPPULDWN_ON_Val     _UINT32_(0x1)                                        /* (USBCORE_UOTGCON) D+ data line pull-down resistor is enabled  */
#define   USBCORE_UOTGCON_DPPULDWN_OFF_Val    _UINT32_(0x0)                                        /* (USBCORE_UOTGCON) D+ data line pull-down resistor is disabled  */
#define USBCORE_UOTGCON_DPPULDWN_ON           (USBCORE_UOTGCON_DPPULDWN_ON_Val << USBCORE_UOTGCON_DPPULDWN_Pos) /* (USBCORE_UOTGCON) D+ data line pull-down resistor is enabled Position  */
#define USBCORE_UOTGCON_DPPULDWN_OFF          (USBCORE_UOTGCON_DPPULDWN_OFF_Val << USBCORE_UOTGCON_DPPULDWN_Pos) /* (USBCORE_UOTGCON) D+ data line pull-down resistor is disabled Position  */
#define USBCORE_UOTGCON_DMPULUP_Pos           _UINT32_(6)                                          /* (USBCORE_UOTGCON) D- Pull-Up Enable bit Position */
#define USBCORE_UOTGCON_DMPULUP_Msk           (_UINT32_(0x1) << USBCORE_UOTGCON_DMPULUP_Pos)       /* (USBCORE_UOTGCON) D- Pull-Up Enable bit Mask */
#define USBCORE_UOTGCON_DMPULUP(value)        (USBCORE_UOTGCON_DMPULUP_Msk & (_UINT32_(value) << USBCORE_UOTGCON_DMPULUP_Pos)) /* Assigment of value for DMPULUP in the USBCORE_UOTGCON register */
#define   USBCORE_UOTGCON_DMPULUP_ON_Val      _UINT32_(0x1)                                        /* (USBCORE_UOTGCON) D- data line pull-up resistor is enabled  */
#define   USBCORE_UOTGCON_DMPULUP_OFF_Val     _UINT32_(0x0)                                        /* (USBCORE_UOTGCON) D- data line pull-up resistor is disabled  */
#define USBCORE_UOTGCON_DMPULUP_ON            (USBCORE_UOTGCON_DMPULUP_ON_Val << USBCORE_UOTGCON_DMPULUP_Pos) /* (USBCORE_UOTGCON) D- data line pull-up resistor is enabled Position  */
#define USBCORE_UOTGCON_DMPULUP_OFF           (USBCORE_UOTGCON_DMPULUP_OFF_Val << USBCORE_UOTGCON_DMPULUP_Pos) /* (USBCORE_UOTGCON) D- data line pull-up resistor is disabled Position  */
#define USBCORE_UOTGCON_DPPULUP_Pos           _UINT32_(7)                                          /* (USBCORE_UOTGCON) D+ Pull-Up Enable bit Position */
#define USBCORE_UOTGCON_DPPULUP_Msk           (_UINT32_(0x1) << USBCORE_UOTGCON_DPPULUP_Pos)       /* (USBCORE_UOTGCON) D+ Pull-Up Enable bit Mask */
#define USBCORE_UOTGCON_DPPULUP(value)        (USBCORE_UOTGCON_DPPULUP_Msk & (_UINT32_(value) << USBCORE_UOTGCON_DPPULUP_Pos)) /* Assigment of value for DPPULUP in the USBCORE_UOTGCON register */
#define   USBCORE_UOTGCON_DPPULUP_ON_Val      _UINT32_(0x1)                                        /* (USBCORE_UOTGCON) D+ data line pull-up resistor is enabled  */
#define   USBCORE_UOTGCON_DPPULUP_OFF_Val     _UINT32_(0x0)                                        /* (USBCORE_UOTGCON) D+ data line pull-up resistor is disabled  */
#define USBCORE_UOTGCON_DPPULUP_ON            (USBCORE_UOTGCON_DPPULUP_ON_Val << USBCORE_UOTGCON_DPPULUP_Pos) /* (USBCORE_UOTGCON) D+ data line pull-up resistor is enabled Position  */
#define USBCORE_UOTGCON_DPPULUP_OFF           (USBCORE_UOTGCON_DPPULUP_OFF_Val << USBCORE_UOTGCON_DPPULUP_Pos) /* (USBCORE_UOTGCON) D+ data line pull-up resistor is disabled Position  */
#define USBCORE_UOTGCON_Msk                   _UINT32_(0x000000FF)                                 /* (USBCORE_UOTGCON) Register Mask  */


/* -------- USBCORE_UOTGCONCLR : (USBCORE Offset: 0x74) (R/W 32)  -------- */
#define USBCORE_UOTGCONCLR_RESETVALUE         _UINT32_(0x00)                                       /*  (USBCORE_UOTGCONCLR)   Reset Value */

#define USBCORE_UOTGCONCLR_Msk                _UINT32_(0x00000000)                                 /* (USBCORE_UOTGCONCLR) Register Mask  */


/* -------- USBCORE_UOTGCONSET : (USBCORE Offset: 0x78) (R/W 32)  -------- */
#define USBCORE_UOTGCONSET_RESETVALUE         _UINT32_(0x00)                                       /*  (USBCORE_UOTGCONSET)   Reset Value */

#define USBCORE_UOTGCONSET_Msk                _UINT32_(0x00000000)                                 /* (USBCORE_UOTGCONSET) Register Mask  */


