Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_tcp_client/src/packs/WBZ653_DFP/component/usbcore.h
/* -------- USBCORE_UOTGCONINV : (USBCORE Offset: 0x7C) (R/W 32)  -------- */
#define USBCORE_UOTGCONINV_RESETVALUE         _UINT32_(0x00)                                       /*  (USBCORE_UOTGCONINV)   Reset Value */

#define USBCORE_UOTGCONINV_Msk                _UINT32_(0x00000000)                                 /* (USBCORE_UOTGCONINV) Register Mask  */


/* -------- USBCORE_UPWRC : (USBCORE Offset: 0x80) (R/W 32) USB Power Control Register -------- */
#define USBCORE_UPWRC_USBPWR_Pos              _UINT32_(0)                                          /* (USBCORE_UPWRC) USB Operation Enable bit Position */
#define USBCORE_UPWRC_USBPWR_Msk              (_UINT32_(0x1) << USBCORE_UPWRC_USBPWR_Pos)          /* (USBCORE_UPWRC) USB Operation Enable bit Mask */
#define USBCORE_UPWRC_USBPWR(value)           (USBCORE_UPWRC_USBPWR_Msk & (_UINT32_(value) << USBCORE_UPWRC_USBPWR_Pos)) /* Assigment of value for USBPWR in the USBCORE_UPWRC register */
#define   USBCORE_UPWRC_USBPWR_ON_Val         _UINT32_(0x1)                                        /* (USBCORE_UPWRC) USB module is turned on  */
#define   USBCORE_UPWRC_USBPWR_OFF_Val        _UINT32_(0x0)                                        /* (USBCORE_UPWRC) USB module is disabled (Outputs held inactive  */
#define USBCORE_UPWRC_USBPWR_ON               (USBCORE_UPWRC_USBPWR_ON_Val << USBCORE_UPWRC_USBPWR_Pos) /* (USBCORE_UPWRC) USB module is turned on Position  */
#define USBCORE_UPWRC_USBPWR_OFF              (USBCORE_UPWRC_USBPWR_OFF_Val << USBCORE_UPWRC_USBPWR_Pos) /* (USBCORE_UPWRC) USB module is disabled (Outputs held inactive Position  */
#define USBCORE_UPWRC_USUSPEND_Pos            _UINT32_(1)                                          /* (USBCORE_UPWRC) USB Suspend Mode bit Position */
#define USBCORE_UPWRC_USUSPEND_Msk            (_UINT32_(0x1) << USBCORE_UPWRC_USUSPEND_Pos)        /* (USBCORE_UPWRC) USB Suspend Mode bit Mask */
#define USBCORE_UPWRC_USUSPEND(value)         (USBCORE_UPWRC_USUSPEND_Msk & (_UINT32_(value) << USBCORE_UPWRC_USUSPEND_Pos)) /* Assigment of value for USUSPEND in the USBCORE_UPWRC register */
#define   USBCORE_UPWRC_USUSPEND_SUSPEND_Val  _UINT32_(0x1)                                        /* (USBCORE_UPWRC) USB module is placed in Suspend mode (The 48 MHz USB clock will be gated off. The transceiver is placed in a low-power state.)  */
#define   USBCORE_UPWRC_USUSPEND_NORMAL_Val   _UINT32_(0x0)                                        /* (USBCORE_UPWRC) USB module operates normally  */
#define USBCORE_UPWRC_USUSPEND_SUSPEND        (USBCORE_UPWRC_USUSPEND_SUSPEND_Val << USBCORE_UPWRC_USUSPEND_Pos) /* (USBCORE_UPWRC) USB module is placed in Suspend mode (The 48 MHz USB clock will be gated off. The transceiver is placed in a low-power state.) Position  */
#define USBCORE_UPWRC_USUSPEND_NORMAL         (USBCORE_UPWRC_USUSPEND_NORMAL_Val << USBCORE_UPWRC_USUSPEND_Pos) /* (USBCORE_UPWRC) USB module operates normally Position  */
#define USBCORE_UPWRC_USBBUSY_Pos             _UINT32_(3)                                          /* (USBCORE_UPWRC) USB Module Busy bit Position */
#define USBCORE_UPWRC_USBBUSY_Msk             (_UINT32_(0x1) << USBCORE_UPWRC_USBBUSY_Pos)         /* (USBCORE_UPWRC) USB Module Busy bit Mask */
#define USBCORE_UPWRC_USBBUSY(value)          (USBCORE_UPWRC_USBBUSY_Msk & (_UINT32_(value) << USBCORE_UPWRC_USBBUSY_Pos)) /* Assigment of value for USBBUSY in the USBCORE_UPWRC register */
#define   USBCORE_UPWRC_USBBUSY_ACTIVE_OR_DISALBE_Val _UINT32_(0x1)                                        /* (USBCORE_UPWRC) USB module is active or disabled  */
#define   USBCORE_UPWRC_USBBUSY_NOT_ACTIVE_AND_READY_Val _UINT32_(0x0)                                        /* (USBCORE_UPWRC) USB module is not active and is ready to be enabled  */
#define USBCORE_UPWRC_USBBUSY_ACTIVE_OR_DISALBE (USBCORE_UPWRC_USBBUSY_ACTIVE_OR_DISALBE_Val << USBCORE_UPWRC_USBBUSY_Pos) /* (USBCORE_UPWRC) USB module is active or disabled Position  */
#define USBCORE_UPWRC_USBBUSY_NOT_ACTIVE_AND_READY (USBCORE_UPWRC_USBBUSY_NOT_ACTIVE_AND_READY_Val << USBCORE_UPWRC_USBBUSY_Pos) /* (USBCORE_UPWRC) USB module is not active and is ready to be enabled Position  */
#define USBCORE_UPWRC_USLPGRD_Pos             _UINT32_(4)                                          /* (USBCORE_UPWRC) USB Sleep Entry Guard bit Position */
#define USBCORE_UPWRC_USLPGRD_Msk             (_UINT32_(0x1) << USBCORE_UPWRC_USLPGRD_Pos)         /* (USBCORE_UPWRC) USB Sleep Entry Guard bit Mask */
#define USBCORE_UPWRC_USLPGRD(value)          (USBCORE_UPWRC_USLPGRD_Msk & (_UINT32_(value) << USBCORE_UPWRC_USLPGRD_Pos)) /* Assigment of value for USLPGRD in the USBCORE_UPWRC register */
#define   USBCORE_UPWRC_USLPGRD_BLOCK_SLEEP_Val _UINT32_(0x1)                                        /* (USBCORE_UPWRC) Sleep entry is blocked if USB bus activity is detected or if a notification is pending  */
#define   USBCORE_UPWRC_USLPGRD_NO_BLOCK_Val  _UINT32_(0x0)                                        /* (USBCORE_UPWRC) USB module does not block Sleep entry  */
#define USBCORE_UPWRC_USLPGRD_BLOCK_SLEEP     (USBCORE_UPWRC_USLPGRD_BLOCK_SLEEP_Val << USBCORE_UPWRC_USLPGRD_Pos) /* (USBCORE_UPWRC) Sleep entry is blocked if USB bus activity is detected or if a notification is pending Position  */
#define USBCORE_UPWRC_USLPGRD_NO_BLOCK        (USBCORE_UPWRC_USLPGRD_NO_BLOCK_Val << USBCORE_UPWRC_USLPGRD_Pos) /* (USBCORE_UPWRC) USB module does not block Sleep entry Position  */
#define USBCORE_UPWRC_UACTPND_Pos             _UINT32_(7)                                          /* (USBCORE_UPWRC) USB Activity Pending bit Position */
#define USBCORE_UPWRC_UACTPND_Msk             (_UINT32_(0x1) << USBCORE_UPWRC_UACTPND_Pos)         /* (USBCORE_UPWRC) USB Activity Pending bit Mask */
#define USBCORE_UPWRC_UACTPND(value)          (USBCORE_UPWRC_UACTPND_Msk & (_UINT32_(value) << USBCORE_UPWRC_UACTPND_Pos)) /* Assigment of value for UACTPND in the USBCORE_UPWRC register */
#define   USBCORE_UPWRC_UACTPND_CHANGE_Val    _UINT32_(0x1)                                        /* (USBCORE_UPWRC) USB hardware has detected a change in link status  */
#define   USBCORE_UPWRC_UACTPND_NORMAL_Val    _UINT32_(0x0)                                        /* (USBCORE_UPWRC) USB Hardware in normal operation mode  */
#define USBCORE_UPWRC_UACTPND_CHANGE          (USBCORE_UPWRC_UACTPND_CHANGE_Val << USBCORE_UPWRC_UACTPND_Pos) /* (USBCORE_UPWRC) USB hardware has detected a change in link status Position  */
#define USBCORE_UPWRC_UACTPND_NORMAL          (USBCORE_UPWRC_UACTPND_NORMAL_Val << USBCORE_UPWRC_UACTPND_Pos) /* (USBCORE_UPWRC) USB Hardware in normal operation mode Position  */
#define USBCORE_UPWRC_Msk                     _UINT32_(0x0000009B)                                 /* (USBCORE_UPWRC) Register Mask  */


/* -------- USBCORE_UPWRCCLR : (USBCORE Offset: 0x84) (R/W 32)  -------- */
#define USBCORE_UPWRCCLR_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_UPWRCCLR)   Reset Value */

