Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_tcp_client/src/packs/WBZ653_DFP/component/usbcore.h
#define USBCORE_UPWRCCLR_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_UPWRCCLR) Register Mask  */


/* -------- USBCORE_UPWRCSET : (USBCORE Offset: 0x88) (R/W 32)  -------- */
#define USBCORE_UPWRCSET_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_UPWRCSET)   Reset Value */

#define USBCORE_UPWRCSET_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_UPWRCSET) Register Mask  */


/* -------- USBCORE_UPWRCINV : (USBCORE Offset: 0x8C) (R/W 32)  -------- */
#define USBCORE_UPWRCINV_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_UPWRCINV)   Reset Value */

#define USBCORE_UPWRCINV_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_UPWRCINV) Register Mask  */


/* -------- USBCORE_UIR : (USBCORE Offset: 0x200) (R/W 32) USB Interrupt Register -------- */
#define USBCORE_UIR_URSTIF_DETACHIF_Pos       _UINT32_(0)                                          /* (USBCORE_UIR) (Device mode) USB Reset Interrupt bit Device mode / (Host mode)USB Detach Interrupt bit Host mode Position */
#define USBCORE_UIR_URSTIF_DETACHIF_Msk       (_UINT32_(0x1) << USBCORE_UIR_URSTIF_DETACHIF_Pos)   /* (USBCORE_UIR) (Device mode) USB Reset Interrupt bit Device mode / (Host mode)USB Detach Interrupt bit Host mode Mask */
#define USBCORE_UIR_URSTIF_DETACHIF(value)    (USBCORE_UIR_URSTIF_DETACHIF_Msk & (_UINT32_(value) << USBCORE_UIR_URSTIF_DETACHIF_Pos)) /* Assigment of value for URSTIF_DETACHIF in the USBCORE_UIR register */
#define   USBCORE_UIR_URSTIF_DETACHIF_DETECT_Val _UINT32_(0x1)                                        /* (USBCORE_UIR) (Device mode)Valid USB Reset has occurred / (Host mode)Peripheral detachment was detected by the USB module  */
#define   USBCORE_UIR_URSTIF_DETACHIF_NOT_DETECT_Val _UINT32_(0x0)                                        /* (USBCORE_UIR) (Device mode)No USB Reset has occurred / (Host mode)Peripheral detachment was not detected  */
#define USBCORE_UIR_URSTIF_DETACHIF_DETECT    (USBCORE_UIR_URSTIF_DETACHIF_DETECT_Val << USBCORE_UIR_URSTIF_DETACHIF_Pos) /* (USBCORE_UIR) (Device mode)Valid USB Reset has occurred / (Host mode)Peripheral detachment was detected by the USB module Position  */
#define USBCORE_UIR_URSTIF_DETACHIF_NOT_DETECT (USBCORE_UIR_URSTIF_DETACHIF_NOT_DETECT_Val << USBCORE_UIR_URSTIF_DETACHIF_Pos) /* (USBCORE_UIR) (Device mode)No USB Reset has occurred / (Host mode)Peripheral detachment was not detected Position  */
#define USBCORE_UIR_UERRIF_Pos                _UINT32_(1)                                          /* (USBCORE_UIR) USB Error Condition Interrupt bit Position */
#define USBCORE_UIR_UERRIF_Msk                (_UINT32_(0x1) << USBCORE_UIR_UERRIF_Pos)            /* (USBCORE_UIR) USB Error Condition Interrupt bit Mask */
#define USBCORE_UIR_UERRIF(value)             (USBCORE_UIR_UERRIF_Msk & (_UINT32_(value) << USBCORE_UIR_UERRIF_Pos)) /* Assigment of value for UERRIF in the USBCORE_UIR register */
#define   USBCORE_UIR_UERRIF_ERROR_Val        _UINT32_(0x1)                                        /* (USBCORE_UIR) Unmasked error condition has occurred  */
#define   USBCORE_UIR_UERRIF_NO_ERROR_Val     _UINT32_(0x0)                                        /* (USBCORE_UIR) Unmasked error condition has not occurred  */
#define USBCORE_UIR_UERRIF_ERROR              (USBCORE_UIR_UERRIF_ERROR_Val << USBCORE_UIR_UERRIF_Pos) /* (USBCORE_UIR) Unmasked error condition has occurred Position  */
#define USBCORE_UIR_UERRIF_NO_ERROR           (USBCORE_UIR_UERRIF_NO_ERROR_Val << USBCORE_UIR_UERRIF_Pos) /* (USBCORE_UIR) Unmasked error condition has not occurred Position  */
#define USBCORE_UIR_SOFIF_Pos                 _UINT32_(2)                                          /* (USBCORE_UIR) SOF Token Interrupt bit Position */
#define USBCORE_UIR_SOFIF_Msk                 (_UINT32_(0x1) << USBCORE_UIR_SOFIF_Pos)             /* (USBCORE_UIR) SOF Token Interrupt bit Mask */
#define USBCORE_UIR_SOFIF(value)              (USBCORE_UIR_SOFIF_Msk & (_UINT32_(value) << USBCORE_UIR_SOFIF_Pos)) /* Assigment of value for SOFIF in the USBCORE_UIR register */
#define   USBCORE_UIR_SOFIF_SOF_RCVE_Val      _UINT32_(0x1)                                        /* (USBCORE_UIR) SOF token received by the peripheral or the SOF threshold reached by the host  */
#define   USBCORE_UIR_SOFIF_NO_SOF_Val        _UINT32_(0x0)                                        /* (USBCORE_UIR) SOF token was not received nor threshold reached  */
#define USBCORE_UIR_SOFIF_SOF_RCVE            (USBCORE_UIR_SOFIF_SOF_RCVE_Val << USBCORE_UIR_SOFIF_Pos) /* (USBCORE_UIR) SOF token received by the peripheral or the SOF threshold reached by the host Position  */
#define USBCORE_UIR_SOFIF_NO_SOF              (USBCORE_UIR_SOFIF_NO_SOF_Val << USBCORE_UIR_SOFIF_Pos) /* (USBCORE_UIR) SOF token was not received nor threshold reached Position  */
#define USBCORE_UIR_TRNIF_Pos                 _UINT32_(3)                                          /* (USBCORE_UIR) Token Processing Complete Interrupt bit Position */
#define USBCORE_UIR_TRNIF_Msk                 (_UINT32_(0x1) << USBCORE_UIR_TRNIF_Pos)             /* (USBCORE_UIR) Token Processing Complete Interrupt bit Mask */
#define USBCORE_UIR_TRNIF(value)              (USBCORE_UIR_TRNIF_Msk & (_UINT32_(value) << USBCORE_UIR_TRNIF_Pos)) /* Assigment of value for TRNIF in the USBCORE_UIR register */
#define   USBCORE_UIR_TRNIF_READY_Val         _UINT32_(0x1)                                        /* (USBCORE_UIR) Processing of current token is complete; a read of the UxSTAT register will provide endpoint information  */
#define   USBCORE_UIR_TRNIF_NOT_READY_Val     _UINT32_(0x0)                                        /* (USBCORE_UIR) Processing of current token not complete  */
#define USBCORE_UIR_TRNIF_READY               (USBCORE_UIR_TRNIF_READY_Val << USBCORE_UIR_TRNIF_Pos) /* (USBCORE_UIR) Processing of current token is complete; a read of the UxSTAT register will provide endpoint information Position  */
#define USBCORE_UIR_TRNIF_NOT_READY           (USBCORE_UIR_TRNIF_NOT_READY_Val << USBCORE_UIR_TRNIF_Pos) /* (USBCORE_UIR) Processing of current token not complete Position  */
#define USBCORE_UIR_IDLEIF_Pos                _UINT32_(4)                                          /* (USBCORE_UIR) Idle Detect Interrupt bit Position */
#define USBCORE_UIR_IDLEIF_Msk                (_UINT32_(0x1) << USBCORE_UIR_IDLEIF_Pos)            /* (USBCORE_UIR) Idle Detect Interrupt bit Mask */
#define USBCORE_UIR_IDLEIF(value)             (USBCORE_UIR_IDLEIF_Msk & (_UINT32_(value) << USBCORE_UIR_IDLEIF_Pos)) /* Assigment of value for IDLEIF in the USBCORE_UIR register */
#define   USBCORE_UIR_IDLEIF_IDLE_Val         _UINT32_(0x1)                                        /* (USBCORE_UIR) Idle condition detected (constant Idle state of 3 ms or more)  */
#define   USBCORE_UIR_IDLEIF_NOT_IDLE_Val     _UINT32_(0x0)                                        /* (USBCORE_UIR) No Idle condition detected  */
#define USBCORE_UIR_IDLEIF_IDLE               (USBCORE_UIR_IDLEIF_IDLE_Val << USBCORE_UIR_IDLEIF_Pos) /* (USBCORE_UIR) Idle condition detected (constant Idle state of 3 ms or more) Position  */
#define USBCORE_UIR_IDLEIF_NOT_IDLE           (USBCORE_UIR_IDLEIF_NOT_IDLE_Val << USBCORE_UIR_IDLEIF_Pos) /* (USBCORE_UIR) No Idle condition detected Position  */
#define USBCORE_UIR_RESUMEIF_Pos              _UINT32_(5)                                          /* (USBCORE_UIR) Resume Interrupt bit Position */
#define USBCORE_UIR_RESUMEIF_Msk              (_UINT32_(0x1) << USBCORE_UIR_RESUMEIF_Pos)          /* (USBCORE_UIR) Resume Interrupt bit Mask */
#define USBCORE_UIR_RESUMEIF(value)           (USBCORE_UIR_RESUMEIF_Msk & (_UINT32_(value) << USBCORE_UIR_RESUMEIF_Pos)) /* Assigment of value for RESUMEIF in the USBCORE_UIR register */
#define   USBCORE_UIR_RESUMEIF_K_STATE_Val    _UINT32_(0x1)                                        /* (USBCORE_UIR) K-State is observed on the D+ or D- pin for 2.5 s  */
#define   USBCORE_UIR_RESUMEIF_NORMAL_Val     _UINT32_(0x0)                                        /* (USBCORE_UIR) K-State is not observed  */
#define USBCORE_UIR_RESUMEIF_K_STATE          (USBCORE_UIR_RESUMEIF_K_STATE_Val << USBCORE_UIR_RESUMEIF_Pos) /* (USBCORE_UIR) K-State is observed on the D+ or D- pin for 2.5 s Position  */
#define USBCORE_UIR_RESUMEIF_NORMAL           (USBCORE_UIR_RESUMEIF_NORMAL_Val << USBCORE_UIR_RESUMEIF_Pos) /* (USBCORE_UIR) K-State is not observed Position  */
#define USBCORE_UIR_ATTACHIF_Pos              _UINT32_(6)                                          /* (USBCORE_UIR) Peripheral Attach Interrupt bit Position */
#define USBCORE_UIR_ATTACHIF_Msk              (_UINT32_(0x1) << USBCORE_UIR_ATTACHIF_Pos)          /* (USBCORE_UIR) Peripheral Attach Interrupt bit Mask */
#define USBCORE_UIR_ATTACHIF(value)           (USBCORE_UIR_ATTACHIF_Msk & (_UINT32_(value) << USBCORE_UIR_ATTACHIF_Pos)) /* Assigment of value for ATTACHIF in the USBCORE_UIR register */
#define   USBCORE_UIR_ATTACHIF_DETECT_Val     _UINT32_(0x1)                                        /* (USBCORE_UIR) Peripheral attachment was detected by the USB module  */
#define   USBCORE_UIR_ATTACHIF_NOT_DETECT_Val _UINT32_(0x0)                                        /* (USBCORE_UIR) Peripheral attachment was not detected  */
#define USBCORE_UIR_ATTACHIF_DETECT           (USBCORE_UIR_ATTACHIF_DETECT_Val << USBCORE_UIR_ATTACHIF_Pos) /* (USBCORE_UIR) Peripheral attachment was detected by the USB module Position  */
#define USBCORE_UIR_ATTACHIF_NOT_DETECT       (USBCORE_UIR_ATTACHIF_NOT_DETECT_Val << USBCORE_UIR_ATTACHIF_Pos) /* (USBCORE_UIR) Peripheral attachment was not detected Position  */
#define USBCORE_UIR_STALLIF_Pos               _UINT32_(7)                                          /* (USBCORE_UIR) STALL Handshake Interrupt bit Position */
#define USBCORE_UIR_STALLIF_Msk               (_UINT32_(0x1) << USBCORE_UIR_STALLIF_Pos)           /* (USBCORE_UIR) STALL Handshake Interrupt bit Mask */
#define USBCORE_UIR_STALLIF(value)            (USBCORE_UIR_STALLIF_Msk & (_UINT32_(value) << USBCORE_UIR_STALLIF_Pos)) /* Assigment of value for STALLIF in the USBCORE_UIR register */
#define   USBCORE_UIR_STALLIF_HANDSHAKE_Val   _UINT32_(0x1)                                        /* (USBCORE_UIR) A STALL handshake was sent by Peripheral or received by Host during the handshake phase of the transaction  */
#define   USBCORE_UIR_STALLIF_NO_HANDSHAKE_Val _UINT32_(0x0)                                        /* (USBCORE_UIR) STALL handshake has not been sent  */
#define USBCORE_UIR_STALLIF_HANDSHAKE         (USBCORE_UIR_STALLIF_HANDSHAKE_Val << USBCORE_UIR_STALLIF_Pos) /* (USBCORE_UIR) A STALL handshake was sent by Peripheral or received by Host during the handshake phase of the transaction Position  */
#define USBCORE_UIR_STALLIF_NO_HANDSHAKE      (USBCORE_UIR_STALLIF_NO_HANDSHAKE_Val << USBCORE_UIR_STALLIF_Pos) /* (USBCORE_UIR) STALL handshake has not been sent Position  */
#define USBCORE_UIR_Msk                       _UINT32_(0x000000FF)                                 /* (USBCORE_UIR) Register Mask  */


/* -------- USBCORE_UIRCLR : (USBCORE Offset: 0x204) (R/W 32)  -------- */
#define USBCORE_UIRCLR_RESETVALUE             _UINT32_(0x00)                                       /*  (USBCORE_UIRCLR)   Reset Value */

#define USBCORE_UIRCLR_Msk                    _UINT32_(0x00000000)                                 /* (USBCORE_UIRCLR) Register Mask  */


/* -------- USBCORE_UIE : (USBCORE Offset: 0x210) (R/W 32) USB Interrupt Enable Register -------- */
#define USBCORE_UIE_URSTIE_DETACHIE_Pos       _UINT32_(0)                                          /* (USBCORE_UIE) (Device mode) USB Reset Interrupt Enable bit Device mode / (Host mode)USB Detach Interrupt Enable bit Host Mode Position */
#define USBCORE_UIE_URSTIE_DETACHIE_Msk       (_UINT32_(0x1) << USBCORE_UIE_URSTIE_DETACHIE_Pos)   /* (USBCORE_UIE) (Device mode) USB Reset Interrupt Enable bit Device mode / (Host mode)USB Detach Interrupt Enable bit Host Mode Mask */
#define USBCORE_UIE_URSTIE_DETACHIE(value)    (USBCORE_UIE_URSTIE_DETACHIE_Msk & (_UINT32_(value) << USBCORE_UIE_URSTIE_DETACHIE_Pos)) /* Assigment of value for URSTIE_DETACHIE in the USBCORE_UIE register */
#define   USBCORE_UIE_URSTIE_DETACHIE_ON_Val  _UINT32_(0x1)                                        /* (USBCORE_UIE) (Device mode) URSTIF interrupt is enabled / (Host mode) DATTCHIF interrupt is enabled  */
#define   USBCORE_UIE_URSTIE_DETACHIE_OFF_Val _UINT32_(0x0)                                        /* (USBCORE_UIE) (Device mode) URSTIF interrupt is disabled / (Host mode) DATTCHIF interrupt is disabled  */
#define USBCORE_UIE_URSTIE_DETACHIE_ON        (USBCORE_UIE_URSTIE_DETACHIE_ON_Val << USBCORE_UIE_URSTIE_DETACHIE_Pos) /* (USBCORE_UIE) (Device mode) URSTIF interrupt is enabled / (Host mode) DATTCHIF interrupt is enabled Position  */
#define USBCORE_UIE_URSTIE_DETACHIE_OFF       (USBCORE_UIE_URSTIE_DETACHIE_OFF_Val << USBCORE_UIE_URSTIE_DETACHIE_Pos) /* (USBCORE_UIE) (Device mode) URSTIF interrupt is disabled / (Host mode) DATTCHIF interrupt is disabled Position  */
#define USBCORE_UIE_UERRIE_Pos                _UINT32_(1)                                          /* (USBCORE_UIE) USB Error Interrupt Enable bit Position */
#define USBCORE_UIE_UERRIE_Msk                (_UINT32_(0x1) << USBCORE_UIE_UERRIE_Pos)            /* (USBCORE_UIE) USB Error Interrupt Enable bit Mask */
#define USBCORE_UIE_UERRIE(value)             (USBCORE_UIE_UERRIE_Msk & (_UINT32_(value) << USBCORE_UIE_UERRIE_Pos)) /* Assigment of value for UERRIE in the USBCORE_UIE register */
#define   USBCORE_UIE_UERRIE_ON_Val           _UINT32_(0x1)                                        /* (USBCORE_UIE) USB Error interrupt is enabled  */
#define   USBCORE_UIE_UERRIE_OFF_Val          _UINT32_(0x0)                                        /* (USBCORE_UIE) USB Error interrupt is disabled  */
#define USBCORE_UIE_UERRIE_ON                 (USBCORE_UIE_UERRIE_ON_Val << USBCORE_UIE_UERRIE_Pos) /* (USBCORE_UIE) USB Error interrupt is enabled Position  */
#define USBCORE_UIE_UERRIE_OFF                (USBCORE_UIE_UERRIE_OFF_Val << USBCORE_UIE_UERRIE_Pos) /* (USBCORE_UIE) USB Error interrupt is disabled Position  */
#define USBCORE_UIE_SOFIE_Pos                 _UINT32_(2)                                          /* (USBCORE_UIE) SOF Token Interrupt Enable bit Position */
#define USBCORE_UIE_SOFIE_Msk                 (_UINT32_(0x1) << USBCORE_UIE_SOFIE_Pos)             /* (USBCORE_UIE) SOF Token Interrupt Enable bit Mask */
#define USBCORE_UIE_SOFIE(value)              (USBCORE_UIE_SOFIE_Msk & (_UINT32_(value) << USBCORE_UIE_SOFIE_Pos)) /* Assigment of value for SOFIE in the USBCORE_UIE register */
#define   USBCORE_UIE_SOFIE_ON_Val            _UINT32_(0x1)                                        /* (USBCORE_UIE) SOFIF interrupt is enabled  */
#define   USBCORE_UIE_SOFIE_OFF_Val           _UINT32_(0x0)                                        /* (USBCORE_UIE) SOFIF interrupt is disabled  */
#define USBCORE_UIE_SOFIE_ON                  (USBCORE_UIE_SOFIE_ON_Val << USBCORE_UIE_SOFIE_Pos)  /* (USBCORE_UIE) SOFIF interrupt is enabled Position  */
#define USBCORE_UIE_SOFIE_OFF                 (USBCORE_UIE_SOFIE_OFF_Val << USBCORE_UIE_SOFIE_Pos) /* (USBCORE_UIE) SOFIF interrupt is disabled Position  */
#define USBCORE_UIE_TRNIE_Pos                 _UINT32_(3)                                          /* (USBCORE_UIE) Token Processing Complete Interrupt Enable bit Position */
#define USBCORE_UIE_TRNIE_Msk                 (_UINT32_(0x1) << USBCORE_UIE_TRNIE_Pos)             /* (USBCORE_UIE) Token Processing Complete Interrupt Enable bit Mask */
#define USBCORE_UIE_TRNIE(value)              (USBCORE_UIE_TRNIE_Msk & (_UINT32_(value) << USBCORE_UIE_TRNIE_Pos)) /* Assigment of value for TRNIE in the USBCORE_UIE register */
#define   USBCORE_UIE_TRNIE_ON_Val            _UINT32_(0x1)                                        /* (USBCORE_UIE) TRNIF interrupt is enabled  */
#define   USBCORE_UIE_TRNIE_OFF_Val           _UINT32_(0x0)                                        /* (USBCORE_UIE) TRNIF interrupt is disabled  */
#define USBCORE_UIE_TRNIE_ON                  (USBCORE_UIE_TRNIE_ON_Val << USBCORE_UIE_TRNIE_Pos)  /* (USBCORE_UIE) TRNIF interrupt is enabled Position  */
#define USBCORE_UIE_TRNIE_OFF                 (USBCORE_UIE_TRNIE_OFF_Val << USBCORE_UIE_TRNIE_Pos) /* (USBCORE_UIE) TRNIF interrupt is disabled Position  */
#define USBCORE_UIE_IDLEIE_Pos                _UINT32_(4)                                          /* (USBCORE_UIE) Idle Detect Interrupt Enable bit Position */
#define USBCORE_UIE_IDLEIE_Msk                (_UINT32_(0x1) << USBCORE_UIE_IDLEIE_Pos)            /* (USBCORE_UIE) Idle Detect Interrupt Enable bit Mask */
#define USBCORE_UIE_IDLEIE(value)             (USBCORE_UIE_IDLEIE_Msk & (_UINT32_(value) << USBCORE_UIE_IDLEIE_Pos)) /* Assigment of value for IDLEIE in the USBCORE_UIE register */
#define   USBCORE_UIE_IDLEIE_ON_Val           _UINT32_(0x1)                                        /* (USBCORE_UIE) Idle interrupt is enabled  */
#define   USBCORE_UIE_IDLEIE_OFF_Val          _UINT32_(0x0)                                        /* (USBCORE_UIE) Idle interrupt is disabled  */
#define USBCORE_UIE_IDLEIE_ON                 (USBCORE_UIE_IDLEIE_ON_Val << USBCORE_UIE_IDLEIE_Pos) /* (USBCORE_UIE) Idle interrupt is enabled Position  */
#define USBCORE_UIE_IDLEIE_OFF                (USBCORE_UIE_IDLEIE_OFF_Val << USBCORE_UIE_IDLEIE_Pos) /* (USBCORE_UIE) Idle interrupt is disabled Position  */
#define USBCORE_UIE_RESUMEIE_Pos              _UINT32_(5)                                          /* (USBCORE_UIE) RESUME Interrupt Enable bit Position */
#define USBCORE_UIE_RESUMEIE_Msk              (_UINT32_(0x1) << USBCORE_UIE_RESUMEIE_Pos)          /* (USBCORE_UIE) RESUME Interrupt Enable bit Mask */
#define USBCORE_UIE_RESUMEIE(value)           (USBCORE_UIE_RESUMEIE_Msk & (_UINT32_(value) << USBCORE_UIE_RESUMEIE_Pos)) /* Assigment of value for RESUMEIE in the USBCORE_UIE register */
#define   USBCORE_UIE_RESUMEIE_ON_Val         _UINT32_(0x1)                                        /* (USBCORE_UIE) RESUME interrupt is enabled  */
#define   USBCORE_UIE_RESUMEIE_OFF_Val        _UINT32_(0x0)                                        /* (USBCORE_UIE) RESUME interrupt is disabled  */
#define USBCORE_UIE_RESUMEIE_ON               (USBCORE_UIE_RESUMEIE_ON_Val << USBCORE_UIE_RESUMEIE_Pos) /* (USBCORE_UIE) RESUME interrupt is enabled Position  */
#define USBCORE_UIE_RESUMEIE_OFF              (USBCORE_UIE_RESUMEIE_OFF_Val << USBCORE_UIE_RESUMEIE_Pos) /* (USBCORE_UIE) RESUME interrupt is disabled Position  */
#define USBCORE_UIE_ATTACHIE_Pos              _UINT32_(6)                                          /* (USBCORE_UIE) ATTACH Interrupt Enable bit Position */
#define USBCORE_UIE_ATTACHIE_Msk              (_UINT32_(0x1) << USBCORE_UIE_ATTACHIE_Pos)          /* (USBCORE_UIE) ATTACH Interrupt Enable bit Mask */
#define USBCORE_UIE_ATTACHIE(value)           (USBCORE_UIE_ATTACHIE_Msk & (_UINT32_(value) << USBCORE_UIE_ATTACHIE_Pos)) /* Assigment of value for ATTACHIE in the USBCORE_UIE register */
#define   USBCORE_UIE_ATTACHIE_ON_Val         _UINT32_(0x1)                                        /* (USBCORE_UIE) ATTACH interrupt is enabled  */
#define   USBCORE_UIE_ATTACHIE_OFF_Val        _UINT32_(0x0)                                        /* (USBCORE_UIE) ATTACH interrupt is disabled  */
#define USBCORE_UIE_ATTACHIE_ON               (USBCORE_UIE_ATTACHIE_ON_Val << USBCORE_UIE_ATTACHIE_Pos) /* (USBCORE_UIE) ATTACH interrupt is enabled Position  */
#define USBCORE_UIE_ATTACHIE_OFF              (USBCORE_UIE_ATTACHIE_OFF_Val << USBCORE_UIE_ATTACHIE_Pos) /* (USBCORE_UIE) ATTACH interrupt is disabled Position  */
#define USBCORE_UIE_STALLIE_Pos               _UINT32_(7)                                          /* (USBCORE_UIE) STALL Handshake Interrupt Enable bit Position */
#define USBCORE_UIE_STALLIE_Msk               (_UINT32_(0x1) << USBCORE_UIE_STALLIE_Pos)           /* (USBCORE_UIE) STALL Handshake Interrupt Enable bit Mask */
#define USBCORE_UIE_STALLIE(value)            (USBCORE_UIE_STALLIE_Msk & (_UINT32_(value) << USBCORE_UIE_STALLIE_Pos)) /* Assigment of value for STALLIE in the USBCORE_UIE register */
#define   USBCORE_UIE_STALLIE_ON_Val          _UINT32_(0x1)                                        /* (USBCORE_UIE) STALL interrupt is enabled  */
#define   USBCORE_UIE_STALLIE_OFF_Val         _UINT32_(0x0)                                        /* (USBCORE_UIE) STALL interrupt is disabled  */
#define USBCORE_UIE_STALLIE_ON                (USBCORE_UIE_STALLIE_ON_Val << USBCORE_UIE_STALLIE_Pos) /* (USBCORE_UIE) STALL interrupt is enabled Position  */
#define USBCORE_UIE_STALLIE_OFF               (USBCORE_UIE_STALLIE_OFF_Val << USBCORE_UIE_STALLIE_Pos) /* (USBCORE_UIE) STALL interrupt is disabled Position  */
#define USBCORE_UIE_Msk                       _UINT32_(0x000000FF)                                 /* (USBCORE_UIE) Register Mask  */


/* -------- USBCORE_UIECLR : (USBCORE Offset: 0x214) (R/W 32)  -------- */
#define USBCORE_UIECLR_RESETVALUE             _UINT32_(0x00)                                       /*  (USBCORE_UIECLR)   Reset Value */

#define USBCORE_UIECLR_Msk                    _UINT32_(0x00000000)                                 /* (USBCORE_UIECLR) Register Mask  */


/* -------- USBCORE_UIESET : (USBCORE Offset: 0x218) (R/W 32)  -------- */
#define USBCORE_UIESET_RESETVALUE             _UINT32_(0x00)                                       /*  (USBCORE_UIESET)   Reset Value */

#define USBCORE_UIESET_Msk                    _UINT32_(0x00000000)                                 /* (USBCORE_UIESET) Register Mask  */


