Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_tcp_client/src/packs/WBZ653_DFP/component/usbcore.h
/* -------- USBCORE_UIEINV : (USBCORE Offset: 0x21C) (R/W 32)  -------- */
#define USBCORE_UIEINV_RESETVALUE             _UINT32_(0x00)                                       /*  (USBCORE_UIEINV)   Reset Value */

#define USBCORE_UIEINV_Msk                    _UINT32_(0x00000000)                                 /* (USBCORE_UIEINV) Register Mask  */


/* -------- USBCORE_UEIR : (USBCORE Offset: 0x220) (R/W 32) USB Error Interrupt Status Register -------- */
#define USBCORE_UEIR_PIDEF_Pos                _UINT32_(0)                                          /* (USBCORE_UEIR) PID Check Failure Flag bit Position */
#define USBCORE_UEIR_PIDEF_Msk                (_UINT32_(0x1) << USBCORE_UEIR_PIDEF_Pos)            /* (USBCORE_UEIR) PID Check Failure Flag bit Mask */
#define USBCORE_UEIR_PIDEF(value)             (USBCORE_UEIR_PIDEF_Msk & (_UINT32_(value) << USBCORE_UEIR_PIDEF_Pos)) /* Assigment of value for PIDEF in the USBCORE_UEIR register */
#define   USBCORE_UEIR_PIDEF_FAIL_Val         _UINT32_(0x1)                                        /* (USBCORE_UEIR) PID check failed  */
#define   USBCORE_UEIR_PIDEF_PASS_Val         _UINT32_(0x0)                                        /* (USBCORE_UEIR) PID check passed  */
#define USBCORE_UEIR_PIDEF_FAIL               (USBCORE_UEIR_PIDEF_FAIL_Val << USBCORE_UEIR_PIDEF_Pos) /* (USBCORE_UEIR) PID check failed Position  */
#define USBCORE_UEIR_PIDEF_PASS               (USBCORE_UEIR_PIDEF_PASS_Val << USBCORE_UEIR_PIDEF_Pos) /* (USBCORE_UEIR) PID check passed Position  */
#define USBCORE_UEIR_CRC5EF_EOFEF_Pos         _UINT32_(1)                                          /* (USBCORE_UEIR) (Device mode)CRC5 Host Error Flag bit / (Host mode)EOF Error Flag bit Position */
#define USBCORE_UEIR_CRC5EF_EOFEF_Msk         (_UINT32_(0x1) << USBCORE_UEIR_CRC5EF_EOFEF_Pos)     /* (USBCORE_UEIR) (Device mode)CRC5 Host Error Flag bit / (Host mode)EOF Error Flag bit Mask */
#define USBCORE_UEIR_CRC5EF_EOFEF(value)      (USBCORE_UEIR_CRC5EF_EOFEF_Msk & (_UINT32_(value) << USBCORE_UEIR_CRC5EF_EOFEF_Pos)) /* Assigment of value for CRC5EF_EOFEF in the USBCORE_UEIR register */
#define   USBCORE_UEIR_CRC5EF_EOFEF_ERROR_Val _UINT32_(0x1)                                        /* (USBCORE_UEIR) (Device mode)Token packet rejected due to CRC5 error / (Host mode)EOF error condition detected  */
#define   USBCORE_UEIR_CRC5EF_EOFEF_NO_ERROR_Val _UINT32_(0x0)                                        /* (USBCORE_UEIR) (Device mode)Token packet accepted / (Host mode)No EOF error condition  */
#define USBCORE_UEIR_CRC5EF_EOFEF_ERROR       (USBCORE_UEIR_CRC5EF_EOFEF_ERROR_Val << USBCORE_UEIR_CRC5EF_EOFEF_Pos) /* (USBCORE_UEIR) (Device mode)Token packet rejected due to CRC5 error / (Host mode)EOF error condition detected Position  */
#define USBCORE_UEIR_CRC5EF_EOFEF_NO_ERROR    (USBCORE_UEIR_CRC5EF_EOFEF_NO_ERROR_Val << USBCORE_UEIR_CRC5EF_EOFEF_Pos) /* (USBCORE_UEIR) (Device mode)Token packet accepted / (Host mode)No EOF error condition Position  */
#define USBCORE_UEIR_CRC16EF_Pos              _UINT32_(2)                                          /* (USBCORE_UEIR) CRC16 Failure Flag bit Position */
#define USBCORE_UEIR_CRC16EF_Msk              (_UINT32_(0x1) << USBCORE_UEIR_CRC16EF_Pos)          /* (USBCORE_UEIR) CRC16 Failure Flag bit Mask */
#define USBCORE_UEIR_CRC16EF(value)           (USBCORE_UEIR_CRC16EF_Msk & (_UINT32_(value) << USBCORE_UEIR_CRC16EF_Pos)) /* Assigment of value for CRC16EF in the USBCORE_UEIR register */
#define   USBCORE_UEIR_CRC16EF_ERROR_Val      _UINT32_(0x1)                                        /* (USBCORE_UEIR) Data packet rejected due to CRC16 error  */
#define   USBCORE_UEIR_CRC16EF_NO_ERROR_Val   _UINT32_(0x0)                                        /* (USBCORE_UEIR) Data packet accepted  */
#define USBCORE_UEIR_CRC16EF_ERROR            (USBCORE_UEIR_CRC16EF_ERROR_Val << USBCORE_UEIR_CRC16EF_Pos) /* (USBCORE_UEIR) Data packet rejected due to CRC16 error Position  */
#define USBCORE_UEIR_CRC16EF_NO_ERROR         (USBCORE_UEIR_CRC16EF_NO_ERROR_Val << USBCORE_UEIR_CRC16EF_Pos) /* (USBCORE_UEIR) Data packet accepted Position  */
#define USBCORE_UEIR_DFN8EF_Pos               _UINT32_(3)                                          /* (USBCORE_UEIR) Data Field Size Error Flag bit Position */
#define USBCORE_UEIR_DFN8EF_Msk               (_UINT32_(0x1) << USBCORE_UEIR_DFN8EF_Pos)           /* (USBCORE_UEIR) Data Field Size Error Flag bit Mask */
#define USBCORE_UEIR_DFN8EF(value)            (USBCORE_UEIR_DFN8EF_Msk & (_UINT32_(value) << USBCORE_UEIR_DFN8EF_Pos)) /* Assigment of value for DFN8EF in the USBCORE_UEIR register */
#define   USBCORE_UEIR_DFN8EF_NOT_INTEGRAL_Val _UINT32_(0x1)                                        /* (USBCORE_UEIR) Data field received is not an integral number of bytes  */
#define   USBCORE_UEIR_DFN8EF_INTEGRAL_Val    _UINT32_(0x0)                                        /* (USBCORE_UEIR) Data field received is an integral number of bytes  */
#define USBCORE_UEIR_DFN8EF_NOT_INTEGRAL      (USBCORE_UEIR_DFN8EF_NOT_INTEGRAL_Val << USBCORE_UEIR_DFN8EF_Pos) /* (USBCORE_UEIR) Data field received is not an integral number of bytes Position  */
#define USBCORE_UEIR_DFN8EF_INTEGRAL          (USBCORE_UEIR_DFN8EF_INTEGRAL_Val << USBCORE_UEIR_DFN8EF_Pos) /* (USBCORE_UEIR) Data field received is an integral number of bytes Position  */
#define USBCORE_UEIR_BTOEF_Pos                _UINT32_(4)                                          /* (USBCORE_UEIR) Bus Turnaround Time-Out Error Flag bit Position */
#define USBCORE_UEIR_BTOEF_Msk                (_UINT32_(0x1) << USBCORE_UEIR_BTOEF_Pos)            /* (USBCORE_UEIR) Bus Turnaround Time-Out Error Flag bit Mask */
#define USBCORE_UEIR_BTOEF(value)             (USBCORE_UEIR_BTOEF_Msk & (_UINT32_(value) << USBCORE_UEIR_BTOEF_Pos)) /* Assigment of value for BTOEF in the USBCORE_UEIR register */
#define   USBCORE_UEIR_BTOEF_TIMEOUT_Val      _UINT32_(0x1)                                        /* (USBCORE_UEIR) Bus turnaround time-out has occurred  */
#define   USBCORE_UEIR_BTOEF_NO_TIMEOUT_Val   _UINT32_(0x0)                                        /* (USBCORE_UEIR) No bus turnaround time-out  */
#define USBCORE_UEIR_BTOEF_TIMEOUT            (USBCORE_UEIR_BTOEF_TIMEOUT_Val << USBCORE_UEIR_BTOEF_Pos) /* (USBCORE_UEIR) Bus turnaround time-out has occurred Position  */
#define USBCORE_UEIR_BTOEF_NO_TIMEOUT         (USBCORE_UEIR_BTOEF_NO_TIMEOUT_Val << USBCORE_UEIR_BTOEF_Pos) /* (USBCORE_UEIR) No bus turnaround time-out Position  */
#define USBCORE_UEIR_DMAEF_Pos                _UINT32_(5)                                          /* (USBCORE_UEIR) DMA Error Flag bit Position */
#define USBCORE_UEIR_DMAEF_Msk                (_UINT32_(0x1) << USBCORE_UEIR_DMAEF_Pos)            /* (USBCORE_UEIR) DMA Error Flag bit Mask */
#define USBCORE_UEIR_DMAEF(value)             (USBCORE_UEIR_DMAEF_Msk & (_UINT32_(value) << USBCORE_UEIR_DMAEF_Pos)) /* Assigment of value for DMAEF in the USBCORE_UEIR register */
#define   USBCORE_UEIR_DMAEF_ERROR_Val        _UINT32_(0x1)                                        /* (USBCORE_UEIR) USB DMA error condition detected  */
#define   USBCORE_UEIR_DMAEF_NO_ERROR_Val     _UINT32_(0x0)                                        /* (USBCORE_UEIR) No DMA error  */
#define USBCORE_UEIR_DMAEF_ERROR              (USBCORE_UEIR_DMAEF_ERROR_Val << USBCORE_UEIR_DMAEF_Pos) /* (USBCORE_UEIR) USB DMA error condition detected Position  */
#define USBCORE_UEIR_DMAEF_NO_ERROR           (USBCORE_UEIR_DMAEF_NO_ERROR_Val << USBCORE_UEIR_DMAEF_Pos) /* (USBCORE_UEIR) No DMA error Position  */
#define USBCORE_UEIR_BMXEF_Pos                _UINT32_(6)                                          /* (USBCORE_UEIR) Bus Matrix Error Flag bit Position */
#define USBCORE_UEIR_BMXEF_Msk                (_UINT32_(0x1) << USBCORE_UEIR_BMXEF_Pos)            /* (USBCORE_UEIR) Bus Matrix Error Flag bit Mask */
#define USBCORE_UEIR_BMXEF(value)             (USBCORE_UEIR_BMXEF_Msk & (_UINT32_(value) << USBCORE_UEIR_BMXEF_Pos)) /* Assigment of value for BMXEF in the USBCORE_UEIR register */
#define   USBCORE_UEIR_BMXEF_ERROR_Val        _UINT32_(0x1)                                        /* (USBCORE_UEIR) BVCI access initiated on BMX returned response error  */
#define   USBCORE_UEIR_BMXEF_NO_ERROR_Val     _UINT32_(0x0)                                        /* (USBCORE_UEIR) No address error  */
#define USBCORE_UEIR_BMXEF_ERROR              (USBCORE_UEIR_BMXEF_ERROR_Val << USBCORE_UEIR_BMXEF_Pos) /* (USBCORE_UEIR) BVCI access initiated on BMX returned response error Position  */
#define USBCORE_UEIR_BMXEF_NO_ERROR           (USBCORE_UEIR_BMXEF_NO_ERROR_Val << USBCORE_UEIR_BMXEF_Pos) /* (USBCORE_UEIR) No address error Position  */
#define USBCORE_UEIR_BTSEF_Pos                _UINT32_(7)                                          /* (USBCORE_UEIR) Bit Stuff Error Flag bit Position */
#define USBCORE_UEIR_BTSEF_Msk                (_UINT32_(0x1) << USBCORE_UEIR_BTSEF_Pos)            /* (USBCORE_UEIR) Bit Stuff Error Flag bit Mask */
#define USBCORE_UEIR_BTSEF(value)             (USBCORE_UEIR_BTSEF_Msk & (_UINT32_(value) << USBCORE_UEIR_BTSEF_Pos)) /* Assigment of value for BTSEF in the USBCORE_UEIR register */
#define   USBCORE_UEIR_BTSEF_ERROR_Val        _UINT32_(0x1)                                        /* (USBCORE_UEIR) Packet rejected due to bit stuff error  */
#define   USBCORE_UEIR_BTSEF_NO_ERROR_Val     _UINT32_(0x0)                                        /* (USBCORE_UEIR) Packet accepted  */
#define USBCORE_UEIR_BTSEF_ERROR              (USBCORE_UEIR_BTSEF_ERROR_Val << USBCORE_UEIR_BTSEF_Pos) /* (USBCORE_UEIR) Packet rejected due to bit stuff error Position  */
#define USBCORE_UEIR_BTSEF_NO_ERROR           (USBCORE_UEIR_BTSEF_NO_ERROR_Val << USBCORE_UEIR_BTSEF_Pos) /* (USBCORE_UEIR) Packet accepted Position  */
#define USBCORE_UEIR_Msk                      _UINT32_(0x000000FF)                                 /* (USBCORE_UEIR) Register Mask  */


/* -------- USBCORE_UEIRCLR : (USBCORE Offset: 0x224) (R/W 32)  -------- */
#define USBCORE_UEIRCLR_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEIRCLR)   Reset Value */

#define USBCORE_UEIRCLR_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEIRCLR) Register Mask  */


/* -------- USBCORE_UEIE : (USBCORE Offset: 0x230) (R/W 32) USB Error Interrupt Enable Register -------- */
#define USBCORE_UEIE_PIDEE_Pos                _UINT32_(0)                                          /* (USBCORE_UEIE) PID Check Failure Interrupt Enable bit Position */
#define USBCORE_UEIE_PIDEE_Msk                (_UINT32_(0x1) << USBCORE_UEIE_PIDEE_Pos)            /* (USBCORE_UEIE) PID Check Failure Interrupt Enable bit Mask */
#define USBCORE_UEIE_PIDEE(value)             (USBCORE_UEIE_PIDEE_Msk & (_UINT32_(value) << USBCORE_UEIE_PIDEE_Pos)) /* Assigment of value for PIDEE in the USBCORE_UEIE register */
#define   USBCORE_UEIE_PIDEE_ON_Val           _UINT32_(0x1)                                        /* (USBCORE_UEIE) PIDEF interrupt is enabled  */
#define   USBCORE_UEIE_PIDEE_OFF_Val          _UINT32_(0x0)                                        /* (USBCORE_UEIE) PIDEF interrupt is disabled  */
#define USBCORE_UEIE_PIDEE_ON                 (USBCORE_UEIE_PIDEE_ON_Val << USBCORE_UEIE_PIDEE_Pos) /* (USBCORE_UEIE) PIDEF interrupt is enabled Position  */
#define USBCORE_UEIE_PIDEE_OFF                (USBCORE_UEIE_PIDEE_OFF_Val << USBCORE_UEIE_PIDEE_Pos) /* (USBCORE_UEIE) PIDEF interrupt is disabled Position  */
#define USBCORE_UEIE_CRC5EE_EOFEE_Pos         _UINT32_(1)                                          /* (USBCORE_UEIE) (Device mode) CRC5 Host Error Interrupt Enable bit / (Host mode) EOF Error Interrupt Enable bit Position */
#define USBCORE_UEIE_CRC5EE_EOFEE_Msk         (_UINT32_(0x1) << USBCORE_UEIE_CRC5EE_EOFEE_Pos)     /* (USBCORE_UEIE) (Device mode) CRC5 Host Error Interrupt Enable bit / (Host mode) EOF Error Interrupt Enable bit Mask */
#define USBCORE_UEIE_CRC5EE_EOFEE(value)      (USBCORE_UEIE_CRC5EE_EOFEE_Msk & (_UINT32_(value) << USBCORE_UEIE_CRC5EE_EOFEE_Pos)) /* Assigment of value for CRC5EE_EOFEE in the USBCORE_UEIE register */
#define   USBCORE_UEIE_CRC5EE_EOFEE_ON_Val    _UINT32_(0x1)                                        /* (USBCORE_UEIE) (Device mode)CRC5EF interrupt is enabled / (Host mode)EOF interrupt is enabled  */
#define   USBCORE_UEIE_CRC5EE_EOFEE_OFF_Val   _UINT32_(0x0)                                        /* (USBCORE_UEIE) (Device mode)CRC5EF interrupt is disabled / (Host mode)EOF interrupt is disabled  */
#define USBCORE_UEIE_CRC5EE_EOFEE_ON          (USBCORE_UEIE_CRC5EE_EOFEE_ON_Val << USBCORE_UEIE_CRC5EE_EOFEE_Pos) /* (USBCORE_UEIE) (Device mode)CRC5EF interrupt is enabled / (Host mode)EOF interrupt is enabled Position  */
#define USBCORE_UEIE_CRC5EE_EOFEE_OFF         (USBCORE_UEIE_CRC5EE_EOFEE_OFF_Val << USBCORE_UEIE_CRC5EE_EOFEE_Pos) /* (USBCORE_UEIE) (Device mode)CRC5EF interrupt is disabled / (Host mode)EOF interrupt is disabled Position  */
#define USBCORE_UEIE_CRC16EE_Pos              _UINT32_(2)                                          /* (USBCORE_UEIE) CRC16 Failure Interrupt Enable bit Position */
#define USBCORE_UEIE_CRC16EE_Msk              (_UINT32_(0x1) << USBCORE_UEIE_CRC16EE_Pos)          /* (USBCORE_UEIE) CRC16 Failure Interrupt Enable bit Mask */
#define USBCORE_UEIE_CRC16EE(value)           (USBCORE_UEIE_CRC16EE_Msk & (_UINT32_(value) << USBCORE_UEIE_CRC16EE_Pos)) /* Assigment of value for CRC16EE in the USBCORE_UEIE register */
#define   USBCORE_UEIE_CRC16EE_ON_Val         _UINT32_(0x1)                                        /* (USBCORE_UEIE) CRC16EF interrupt is enabled  */
#define   USBCORE_UEIE_CRC16EE_OFF_Val        _UINT32_(0x0)                                        /* (USBCORE_UEIE) CRC16EF interrupt is disabled  */
#define USBCORE_UEIE_CRC16EE_ON               (USBCORE_UEIE_CRC16EE_ON_Val << USBCORE_UEIE_CRC16EE_Pos) /* (USBCORE_UEIE) CRC16EF interrupt is enabled Position  */
#define USBCORE_UEIE_CRC16EE_OFF              (USBCORE_UEIE_CRC16EE_OFF_Val << USBCORE_UEIE_CRC16EE_Pos) /* (USBCORE_UEIE) CRC16EF interrupt is disabled Position  */
#define USBCORE_UEIE_DFN8EE_Pos               _UINT32_(3)                                          /* (USBCORE_UEIE) Data Field Size Error Interrupt Enable bit Position */
#define USBCORE_UEIE_DFN8EE_Msk               (_UINT32_(0x1) << USBCORE_UEIE_DFN8EE_Pos)           /* (USBCORE_UEIE) Data Field Size Error Interrupt Enable bit Mask */
#define USBCORE_UEIE_DFN8EE(value)            (USBCORE_UEIE_DFN8EE_Msk & (_UINT32_(value) << USBCORE_UEIE_DFN8EE_Pos)) /* Assigment of value for DFN8EE in the USBCORE_UEIE register */
#define   USBCORE_UEIE_DFN8EE_ON_Val          _UINT32_(0x1)                                        /* (USBCORE_UEIE) DFN8EF interrupt is enabled  */
#define   USBCORE_UEIE_DFN8EE_OFF_Val         _UINT32_(0x0)                                        /* (USBCORE_UEIE) DFN8EF interrupt is disabled  */
#define USBCORE_UEIE_DFN8EE_ON                (USBCORE_UEIE_DFN8EE_ON_Val << USBCORE_UEIE_DFN8EE_Pos) /* (USBCORE_UEIE) DFN8EF interrupt is enabled Position  */
#define USBCORE_UEIE_DFN8EE_OFF               (USBCORE_UEIE_DFN8EE_OFF_Val << USBCORE_UEIE_DFN8EE_Pos) /* (USBCORE_UEIE) DFN8EF interrupt is disabled Position  */
#define USBCORE_UEIE_BTOEE_Pos                _UINT32_(4)                                          /* (USBCORE_UEIE) Bus Turnaround Time-out Error Interrupt Enable bit Position */
#define USBCORE_UEIE_BTOEE_Msk                (_UINT32_(0x1) << USBCORE_UEIE_BTOEE_Pos)            /* (USBCORE_UEIE) Bus Turnaround Time-out Error Interrupt Enable bit Mask */
#define USBCORE_UEIE_BTOEE(value)             (USBCORE_UEIE_BTOEE_Msk & (_UINT32_(value) << USBCORE_UEIE_BTOEE_Pos)) /* Assigment of value for BTOEE in the USBCORE_UEIE register */
#define   USBCORE_UEIE_BTOEE_ON_Val           _UINT32_(0x1)                                        /* (USBCORE_UEIE) BTOEF interrupt is enabled  */
#define   USBCORE_UEIE_BTOEE_OFF_Val          _UINT32_(0x0)                                        /* (USBCORE_UEIE) BTOEF interrupt is disabled  */
#define USBCORE_UEIE_BTOEE_ON                 (USBCORE_UEIE_BTOEE_ON_Val << USBCORE_UEIE_BTOEE_Pos) /* (USBCORE_UEIE) BTOEF interrupt is enabled Position  */
#define USBCORE_UEIE_BTOEE_OFF                (USBCORE_UEIE_BTOEE_OFF_Val << USBCORE_UEIE_BTOEE_Pos) /* (USBCORE_UEIE) BTOEF interrupt is disabled Position  */
#define USBCORE_UEIE_DMAEE_Pos                _UINT32_(5)                                          /* (USBCORE_UEIE) DMA Error Interrupt Enable bit Position */
#define USBCORE_UEIE_DMAEE_Msk                (_UINT32_(0x1) << USBCORE_UEIE_DMAEE_Pos)            /* (USBCORE_UEIE) DMA Error Interrupt Enable bit Mask */
#define USBCORE_UEIE_DMAEE(value)             (USBCORE_UEIE_DMAEE_Msk & (_UINT32_(value) << USBCORE_UEIE_DMAEE_Pos)) /* Assigment of value for DMAEE in the USBCORE_UEIE register */
#define   USBCORE_UEIE_DMAEE_ON_Val           _UINT32_(0x1)                                        /* (USBCORE_UEIE) DMAEF interrupt is enabled  */
#define   USBCORE_UEIE_DMAEE_OFF_Val          _UINT32_(0x0)                                        /* (USBCORE_UEIE) DMAEF interrupt is disabled  */
#define USBCORE_UEIE_DMAEE_ON                 (USBCORE_UEIE_DMAEE_ON_Val << USBCORE_UEIE_DMAEE_Pos) /* (USBCORE_UEIE) DMAEF interrupt is enabled Position  */
#define USBCORE_UEIE_DMAEE_OFF                (USBCORE_UEIE_DMAEE_OFF_Val << USBCORE_UEIE_DMAEE_Pos) /* (USBCORE_UEIE) DMAEF interrupt is disabled Position  */
#define USBCORE_UEIE_BMXEE_Pos                _UINT32_(6)                                          /* (USBCORE_UEIE) Bus Matrix Error Interrupt Enable bit Position */
#define USBCORE_UEIE_BMXEE_Msk                (_UINT32_(0x1) << USBCORE_UEIE_BMXEE_Pos)            /* (USBCORE_UEIE) Bus Matrix Error Interrupt Enable bit Mask */
#define USBCORE_UEIE_BMXEE(value)             (USBCORE_UEIE_BMXEE_Msk & (_UINT32_(value) << USBCORE_UEIE_BMXEE_Pos)) /* Assigment of value for BMXEE in the USBCORE_UEIE register */
#define   USBCORE_UEIE_BMXEE_ON_Val           _UINT32_(0x1)                                        /* (USBCORE_UEIE) BMXEF interrupt is enabled  */
#define   USBCORE_UEIE_BMXEE_OFF_Val          _UINT32_(0x0)                                        /* (USBCORE_UEIE) BMXEF interrupt is disabled  */
#define USBCORE_UEIE_BMXEE_ON                 (USBCORE_UEIE_BMXEE_ON_Val << USBCORE_UEIE_BMXEE_Pos) /* (USBCORE_UEIE) BMXEF interrupt is enabled Position  */
#define USBCORE_UEIE_BMXEE_OFF                (USBCORE_UEIE_BMXEE_OFF_Val << USBCORE_UEIE_BMXEE_Pos) /* (USBCORE_UEIE) BMXEF interrupt is disabled Position  */
#define USBCORE_UEIE_BTSEE_Pos                _UINT32_(7)                                          /* (USBCORE_UEIE) Bit Stuff Error Interrupt Enable bit Position */
#define USBCORE_UEIE_BTSEE_Msk                (_UINT32_(0x1) << USBCORE_UEIE_BTSEE_Pos)            /* (USBCORE_UEIE) Bit Stuff Error Interrupt Enable bit Mask */
#define USBCORE_UEIE_BTSEE(value)             (USBCORE_UEIE_BTSEE_Msk & (_UINT32_(value) << USBCORE_UEIE_BTSEE_Pos)) /* Assigment of value for BTSEE in the USBCORE_UEIE register */
#define   USBCORE_UEIE_BTSEE_ON_Val           _UINT32_(0x1)                                        /* (USBCORE_UEIE) BTSEF interrupt is enabled  */
#define   USBCORE_UEIE_BTSEE_OFF_Val          _UINT32_(0x0)                                        /* (USBCORE_UEIE) BTSEF interrupt is disabled  */
#define USBCORE_UEIE_BTSEE_ON                 (USBCORE_UEIE_BTSEE_ON_Val << USBCORE_UEIE_BTSEE_Pos) /* (USBCORE_UEIE) BTSEF interrupt is enabled Position  */
#define USBCORE_UEIE_BTSEE_OFF                (USBCORE_UEIE_BTSEE_OFF_Val << USBCORE_UEIE_BTSEE_Pos) /* (USBCORE_UEIE) BTSEF interrupt is disabled Position  */
#define USBCORE_UEIE_Msk                      _UINT32_(0x000000FF)                                 /* (USBCORE_UEIE) Register Mask  */


/* -------- USBCORE_UEIECLR : (USBCORE Offset: 0x234) (R/W 32)  -------- */
#define USBCORE_UEIECLR_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEIECLR)   Reset Value */

#define USBCORE_UEIECLR_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEIECLR) Register Mask  */


/* -------- USBCORE_UEIESET : (USBCORE Offset: 0x238) (R/W 32)  -------- */
#define USBCORE_UEIESET_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEIESET)   Reset Value */

#define USBCORE_UEIESET_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEIESET) Register Mask  */


