Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_tcp_client/src/packs/WBZ653_DFP/component/usbcore.h
/* -------- USBCORE_UEIEINV : (USBCORE Offset: 0x23C) (R/W 32)  -------- */
#define USBCORE_UEIEINV_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEIEINV)   Reset Value */

#define USBCORE_UEIEINV_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEIEINV) Register Mask  */


/* -------- USBCORE_USTAT : (USBCORE Offset: 0x240) ( R/ 32) USB Status Register -------- */
#define USBCORE_USTAT_PPBI_Pos                _UINT32_(2)                                          /* (USBCORE_USTAT) Ping-Pong BD Pointer Indicator bit Position */
#define USBCORE_USTAT_PPBI_Msk                (_UINT32_(0x1) << USBCORE_USTAT_PPBI_Pos)            /* (USBCORE_USTAT) Ping-Pong BD Pointer Indicator bit Mask */
#define USBCORE_USTAT_PPBI(value)             (USBCORE_USTAT_PPBI_Msk & (_UINT32_(value) << USBCORE_USTAT_PPBI_Pos)) /* Assigment of value for PPBI in the USBCORE_USTAT register */
#define   USBCORE_USTAT_PPBI_ODD_Val          _UINT32_(0x1)                                        /* (USBCORE_USTAT) The last transaction was to the ODD BD bank  */
#define   USBCORE_USTAT_PPBI_EVEN_Val         _UINT32_(0x0)                                        /* (USBCORE_USTAT) The last transaction was to the EVEN BD bank  */
#define USBCORE_USTAT_PPBI_ODD                (USBCORE_USTAT_PPBI_ODD_Val << USBCORE_USTAT_PPBI_Pos) /* (USBCORE_USTAT) The last transaction was to the ODD BD bank Position  */
#define USBCORE_USTAT_PPBI_EVEN               (USBCORE_USTAT_PPBI_EVEN_Val << USBCORE_USTAT_PPBI_Pos) /* (USBCORE_USTAT) The last transaction was to the EVEN BD bank Position  */
#define USBCORE_USTAT_DIR_Pos                 _UINT32_(3)                                          /* (USBCORE_USTAT) Last BD Direction Indicator bit Position */
#define USBCORE_USTAT_DIR_Msk                 (_UINT32_(0x1) << USBCORE_USTAT_DIR_Pos)             /* (USBCORE_USTAT) Last BD Direction Indicator bit Mask */
#define USBCORE_USTAT_DIR(value)              (USBCORE_USTAT_DIR_Msk & (_UINT32_(value) << USBCORE_USTAT_DIR_Pos)) /* Assigment of value for DIR in the USBCORE_USTAT register */
#define   USBCORE_USTAT_DIR_TX_Val            _UINT32_(0x1)                                        /* (USBCORE_USTAT) Last transaction was a transmit transfer (TX)  */
#define   USBCORE_USTAT_DIR_RX_Val            _UINT32_(0x0)                                        /* (USBCORE_USTAT) Last transaction was a receive transfer (RX)  */
#define USBCORE_USTAT_DIR_TX                  (USBCORE_USTAT_DIR_TX_Val << USBCORE_USTAT_DIR_Pos)  /* (USBCORE_USTAT) Last transaction was a transmit transfer (TX) Position  */
#define USBCORE_USTAT_DIR_RX                  (USBCORE_USTAT_DIR_RX_Val << USBCORE_USTAT_DIR_Pos)  /* (USBCORE_USTAT) Last transaction was a receive transfer (RX) Position  */
#define USBCORE_USTAT_ENDPT_Pos               _UINT32_(4)                                          /* (USBCORE_USTAT) Encoded Number of Last Endpoint Activity bits Position */
#define USBCORE_USTAT_ENDPT_Msk               (_UINT32_(0xF) << USBCORE_USTAT_ENDPT_Pos)           /* (USBCORE_USTAT) Encoded Number of Last Endpoint Activity bits Mask */
#define USBCORE_USTAT_ENDPT(value)            (USBCORE_USTAT_ENDPT_Msk & (_UINT32_(value) << USBCORE_USTAT_ENDPT_Pos)) /* Assigment of value for ENDPT in the USBCORE_USTAT register */
#define   USBCORE_USTAT_ENDPT_EP_15_Val       _UINT32_(0xF)                                        /* (USBCORE_USTAT) Endpoint 15  */
#define   USBCORE_USTAT_ENDPT_EP_14_Val       _UINT32_(0xE)                                        /* (USBCORE_USTAT) Endpoint 14  */
#define   USBCORE_USTAT_ENDPT_EP_1_Val        _UINT32_(0x1)                                        /* (USBCORE_USTAT) Endpoint 1  */
#define   USBCORE_USTAT_ENDPT_EP_0_Val        _UINT32_(0x0)                                        /* (USBCORE_USTAT) Endpoint 0  */
#define USBCORE_USTAT_ENDPT_EP_15             (USBCORE_USTAT_ENDPT_EP_15_Val << USBCORE_USTAT_ENDPT_Pos) /* (USBCORE_USTAT) Endpoint 15 Position  */
#define USBCORE_USTAT_ENDPT_EP_14             (USBCORE_USTAT_ENDPT_EP_14_Val << USBCORE_USTAT_ENDPT_Pos) /* (USBCORE_USTAT) Endpoint 14 Position  */
#define USBCORE_USTAT_ENDPT_EP_1              (USBCORE_USTAT_ENDPT_EP_1_Val << USBCORE_USTAT_ENDPT_Pos) /* (USBCORE_USTAT) Endpoint 1 Position  */
#define USBCORE_USTAT_ENDPT_EP_0              (USBCORE_USTAT_ENDPT_EP_0_Val << USBCORE_USTAT_ENDPT_Pos) /* (USBCORE_USTAT) Endpoint 0 Position  */
#define USBCORE_USTAT_Msk                     _UINT32_(0x000000FC)                                 /* (USBCORE_USTAT) Register Mask  */


/* -------- USBCORE_USTATCLR : (USBCORE Offset: 0x244) (R/W 32)  -------- */
#define USBCORE_USTATCLR_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_USTATCLR)   Reset Value */

#define USBCORE_USTATCLR_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_USTATCLR) Register Mask  */


/* -------- USBCORE_USTATSET : (USBCORE Offset: 0x248) (R/W 32)  -------- */
#define USBCORE_USTATSET_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_USTATSET)   Reset Value */

#define USBCORE_USTATSET_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_USTATSET) Register Mask  */


/* -------- USBCORE_USTATINV : (USBCORE Offset: 0x24C) (R/W 32)  -------- */
#define USBCORE_USTATINV_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_USTATINV)   Reset Value */

#define USBCORE_USTATINV_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_USTATINV) Register Mask  */


/* -------- USBCORE_UCON : (USBCORE Offset: 0x250) (R/W 32) USB Control Register -------- */
#define USBCORE_UCON_USBEN_SOFEN_Pos          _UINT32_(0)                                          /* (USBCORE_UCON) (Device mode)USB Module Enable bit / (Host mode) Position */
#define USBCORE_UCON_USBEN_SOFEN_Msk          (_UINT32_(0x1) << USBCORE_UCON_USBEN_SOFEN_Pos)      /* (USBCORE_UCON) (Device mode)USB Module Enable bit / (Host mode) Mask */
#define USBCORE_UCON_USBEN_SOFEN(value)       (USBCORE_UCON_USBEN_SOFEN_Msk & (_UINT32_(value) << USBCORE_UCON_USBEN_SOFEN_Pos)) /* Assigment of value for USBEN_SOFEN in the USBCORE_UCON register */
#define   USBCORE_UCON_USBEN_SOFEN_ON_Val     _UINT32_(0x1)                                        /* (USBCORE_UCON) (Device mode)USB module and supporting circuitry is enabled / (Host mode)SOF token sent every 1 ms  */
#define   USBCORE_UCON_USBEN_SOFEN_OFF_Val    _UINT32_(0x0)                                        /* (USBCORE_UCON) (Device mode)USB module and supporting circuitry is disabled / (Host mode)SOF token disabled  */
#define USBCORE_UCON_USBEN_SOFEN_ON           (USBCORE_UCON_USBEN_SOFEN_ON_Val << USBCORE_UCON_USBEN_SOFEN_Pos) /* (USBCORE_UCON) (Device mode)USB module and supporting circuitry is enabled / (Host mode)SOF token sent every 1 ms Position  */
#define USBCORE_UCON_USBEN_SOFEN_OFF          (USBCORE_UCON_USBEN_SOFEN_OFF_Val << USBCORE_UCON_USBEN_SOFEN_Pos) /* (USBCORE_UCON) (Device mode)USB module and supporting circuitry is disabled / (Host mode)SOF token disabled Position  */
#define USBCORE_UCON_PPBRST_Pos               _UINT32_(1)                                          /* (USBCORE_UCON) Ping-Pong Buffers Reset bit Position */
#define USBCORE_UCON_PPBRST_Msk               (_UINT32_(0x1) << USBCORE_UCON_PPBRST_Pos)           /* (USBCORE_UCON) Ping-Pong Buffers Reset bit Mask */
#define USBCORE_UCON_PPBRST(value)            (USBCORE_UCON_PPBRST_Msk & (_UINT32_(value) << USBCORE_UCON_PPBRST_Pos)) /* Assigment of value for PPBRST in the USBCORE_UCON register */
#define   USBCORE_UCON_PPBRST_RESET_Val       _UINT32_(0x1)                                        /* (USBCORE_UCON) Reset all Even/Odd buffer pointers to the EVEN BD banks  */
#define   USBCORE_UCON_PPBRST_NO_RESET_Val    _UINT32_(0x0)                                        /* (USBCORE_UCON) Even/Odd buffer pointers not being Reset  */
#define USBCORE_UCON_PPBRST_RESET             (USBCORE_UCON_PPBRST_RESET_Val << USBCORE_UCON_PPBRST_Pos) /* (USBCORE_UCON) Reset all Even/Odd buffer pointers to the EVEN BD banks Position  */
#define USBCORE_UCON_PPBRST_NO_RESET          (USBCORE_UCON_PPBRST_NO_RESET_Val << USBCORE_UCON_PPBRST_Pos) /* (USBCORE_UCON) Even/Odd buffer pointers not being Reset Position  */
#define USBCORE_UCON_RESUME_Pos               _UINT32_(2)                                          /* (USBCORE_UCON) RESUME Signaling Enable bit Position */
#define USBCORE_UCON_RESUME_Msk               (_UINT32_(0x1) << USBCORE_UCON_RESUME_Pos)           /* (USBCORE_UCON) RESUME Signaling Enable bit Mask */
#define USBCORE_UCON_RESUME(value)            (USBCORE_UCON_RESUME_Msk & (_UINT32_(value) << USBCORE_UCON_RESUME_Pos)) /* Assigment of value for RESUME in the USBCORE_UCON register */
#define   USBCORE_UCON_RESUME_ON_Val          _UINT32_(0x1)                                        /* (USBCORE_UCON) RESUME signaling is activated  */
#define   USBCORE_UCON_RESUME_OFF_Val         _UINT32_(0x0)                                        /* (USBCORE_UCON) RESUME signaling is disabled  */
#define USBCORE_UCON_RESUME_ON                (USBCORE_UCON_RESUME_ON_Val << USBCORE_UCON_RESUME_Pos) /* (USBCORE_UCON) RESUME signaling is activated Position  */
#define USBCORE_UCON_RESUME_OFF               (USBCORE_UCON_RESUME_OFF_Val << USBCORE_UCON_RESUME_Pos) /* (USBCORE_UCON) RESUME signaling is disabled Position  */
#define USBCORE_UCON_HOSTEN_Pos               _UINT32_(3)                                          /* (USBCORE_UCON) Host Mode Enable bit Position */
#define USBCORE_UCON_HOSTEN_Msk               (_UINT32_(0x1) << USBCORE_UCON_HOSTEN_Pos)           /* (USBCORE_UCON) Host Mode Enable bit Mask */
#define USBCORE_UCON_HOSTEN(value)            (USBCORE_UCON_HOSTEN_Msk & (_UINT32_(value) << USBCORE_UCON_HOSTEN_Pos)) /* Assigment of value for HOSTEN in the USBCORE_UCON register */
#define   USBCORE_UCON_HOSTEN_ON_Val          _UINT32_(0x1)                                        /* (USBCORE_UCON) USB host capability is enabled  */
#define   USBCORE_UCON_HOSTEN_OFF_Val         _UINT32_(0x0)                                        /* (USBCORE_UCON) USB host capability is disabled  */
#define USBCORE_UCON_HOSTEN_ON                (USBCORE_UCON_HOSTEN_ON_Val << USBCORE_UCON_HOSTEN_Pos) /* (USBCORE_UCON) USB host capability is enabled Position  */
#define USBCORE_UCON_HOSTEN_OFF               (USBCORE_UCON_HOSTEN_OFF_Val << USBCORE_UCON_HOSTEN_Pos) /* (USBCORE_UCON) USB host capability is disabled Position  */
#define USBCORE_UCON_USBRST_Pos               _UINT32_(4)                                          /* (USBCORE_UCON) Module Reset bit Position */
#define USBCORE_UCON_USBRST_Msk               (_UINT32_(0x1) << USBCORE_UCON_USBRST_Pos)           /* (USBCORE_UCON) Module Reset bit Mask */
#define USBCORE_UCON_USBRST(value)            (USBCORE_UCON_USBRST_Msk & (_UINT32_(value) << USBCORE_UCON_USBRST_Pos)) /* Assigment of value for USBRST in the USBCORE_UCON register */
#define   USBCORE_UCON_USBRST_RESET_GENERATED_Val _UINT32_(0x1)                                        /* (USBCORE_UCON) USB reset is generated  */
#define   USBCORE_UCON_USBRST_RESET_TERMINATED_Val _UINT32_(0x0)                                        /* (USBCORE_UCON) USB reset is terminated  */
#define USBCORE_UCON_USBRST_RESET_GENERATED   (USBCORE_UCON_USBRST_RESET_GENERATED_Val << USBCORE_UCON_USBRST_Pos) /* (USBCORE_UCON) USB reset is generated Position  */
#define USBCORE_UCON_USBRST_RESET_TERMINATED  (USBCORE_UCON_USBRST_RESET_TERMINATED_Val << USBCORE_UCON_USBRST_Pos) /* (USBCORE_UCON) USB reset is terminated Position  */
#define USBCORE_UCON_PKTDIS_TOKBUSY_Pos       _UINT32_(5)                                          /* (USBCORE_UCON) (Device mode) Packet Transfer Disable bit / (Host mode) Token Busy Indicator bit Position */
#define USBCORE_UCON_PKTDIS_TOKBUSY_Msk       (_UINT32_(0x1) << USBCORE_UCON_PKTDIS_TOKBUSY_Pos)   /* (USBCORE_UCON) (Device mode) Packet Transfer Disable bit / (Host mode) Token Busy Indicator bit Mask */
#define USBCORE_UCON_PKTDIS_TOKBUSY(value)    (USBCORE_UCON_PKTDIS_TOKBUSY_Msk & (_UINT32_(value) << USBCORE_UCON_PKTDIS_TOKBUSY_Pos)) /* Assigment of value for PKTDIS_TOKBUSY in the USBCORE_UCON register */
#define   USBCORE_UCON_PKTDIS_TOKBUSY_ON_Val  _UINT32_(0x1)                                        /* (USBCORE_UCON) (Device mode)Token and packet processing disabled (set upon SETUP token received) / (Host mode)Token being executed by the USB module  */
#define   USBCORE_UCON_PKTDIS_TOKBUSY_OFF_Val _UINT32_(0x0)                                        /* (USBCORE_UCON) (Device mode)Token and packet processing enabled / (Host mode)No token being executed  */
#define USBCORE_UCON_PKTDIS_TOKBUSY_ON        (USBCORE_UCON_PKTDIS_TOKBUSY_ON_Val << USBCORE_UCON_PKTDIS_TOKBUSY_Pos) /* (USBCORE_UCON) (Device mode)Token and packet processing disabled (set upon SETUP token received) / (Host mode)Token being executed by the USB module Position  */
#define USBCORE_UCON_PKTDIS_TOKBUSY_OFF       (USBCORE_UCON_PKTDIS_TOKBUSY_OFF_Val << USBCORE_UCON_PKTDIS_TOKBUSY_Pos) /* (USBCORE_UCON) (Device mode)Token and packet processing enabled / (Host mode)No token being executed Position  */
#define USBCORE_UCON_SE0_Pos                  _UINT32_(6)                                          /* (USBCORE_UCON) Live Single-Ended Zero flag bit Position */
#define USBCORE_UCON_SE0_Msk                  (_UINT32_(0x1) << USBCORE_UCON_SE0_Pos)              /* (USBCORE_UCON) Live Single-Ended Zero flag bit Mask */
#define USBCORE_UCON_SE0(value)               (USBCORE_UCON_SE0_Msk & (_UINT32_(value) << USBCORE_UCON_SE0_Pos)) /* Assigment of value for SE0 in the USBCORE_UCON register */
#define   USBCORE_UCON_SE0_DETECT_Val         _UINT32_(0x1)                                        /* (USBCORE_UCON) Single Ended Zero detected on the USB  */
#define   USBCORE_UCON_SE0_NOT_DETECT_Val     _UINT32_(0x0)                                        /* (USBCORE_UCON) No Single Ended Zero detected  */
#define USBCORE_UCON_SE0_DETECT               (USBCORE_UCON_SE0_DETECT_Val << USBCORE_UCON_SE0_Pos) /* (USBCORE_UCON) Single Ended Zero detected on the USB Position  */
#define USBCORE_UCON_SE0_NOT_DETECT           (USBCORE_UCON_SE0_NOT_DETECT_Val << USBCORE_UCON_SE0_Pos) /* (USBCORE_UCON) No Single Ended Zero detected Position  */
#define USBCORE_UCON_JSTATE_Pos               _UINT32_(7)                                          /* (USBCORE_UCON) Live Differential Receiver JSTATE flag bit Position */
#define USBCORE_UCON_JSTATE_Msk               (_UINT32_(0x1) << USBCORE_UCON_JSTATE_Pos)           /* (USBCORE_UCON) Live Differential Receiver JSTATE flag bit Mask */
#define USBCORE_UCON_JSTATE(value)            (USBCORE_UCON_JSTATE_Msk & (_UINT32_(value) << USBCORE_UCON_JSTATE_Pos)) /* Assigment of value for JSTATE in the USBCORE_UCON register */
#define   USBCORE_UCON_JSTATE_DETECT_Val      _UINT32_(0x1)                                        /* (USBCORE_UCON) JSTATE detected on the USB  */
#define   USBCORE_UCON_JSTATE_NOT_DETECT_Val  _UINT32_(0x0)                                        /* (USBCORE_UCON) No JSTATE detected  */
#define USBCORE_UCON_JSTATE_DETECT            (USBCORE_UCON_JSTATE_DETECT_Val << USBCORE_UCON_JSTATE_Pos) /* (USBCORE_UCON) JSTATE detected on the USB Position  */
#define USBCORE_UCON_JSTATE_NOT_DETECT        (USBCORE_UCON_JSTATE_NOT_DETECT_Val << USBCORE_UCON_JSTATE_Pos) /* (USBCORE_UCON) No JSTATE detected Position  */
#define USBCORE_UCON_Msk                      _UINT32_(0x000000FF)                                 /* (USBCORE_UCON) Register Mask  */

#define USBCORE_UCON_SE_Pos                   _UINT32_(6)                                          /* (USBCORE_UCON Position) Live Single-Ended Zero flag bit */
#define USBCORE_UCON_SE_Msk                   (_UINT32_(0x1) << USBCORE_UCON_SE_Pos)               /* (USBCORE_UCON Mask) SE */
#define USBCORE_UCON_SE(value)                (USBCORE_UCON_SE_Msk & (_UINT32_(value) << USBCORE_UCON_SE_Pos)) 

/* -------- USBCORE_UCONCLR : (USBCORE Offset: 0x254) (R/W 32)  -------- */
#define USBCORE_UCONCLR_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UCONCLR)   Reset Value */

