Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_tcp_client/src/packs/WBZ653_DFP/component/usbcore.h
#define USBCORE_UCONCLR_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UCONCLR) Register Mask  */


/* -------- USBCORE_UCONSET : (USBCORE Offset: 0x258) (R/W 32)  -------- */
#define USBCORE_UCONSET_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UCONSET)   Reset Value */

#define USBCORE_UCONSET_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UCONSET) Register Mask  */


/* -------- USBCORE_UCONINV : (USBCORE Offset: 0x25C) (R/W 32)  -------- */
#define USBCORE_UCONINV_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UCONINV)   Reset Value */

#define USBCORE_UCONINV_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UCONINV) Register Mask  */


/* -------- USBCORE_UADDR : (USBCORE Offset: 0x260) (R/W 32) USB Address Register -------- */
#define USBCORE_UADDR_DEVADDR_Pos             _UINT32_(0)                                          /* (USBCORE_UADDR)  Position */
#define USBCORE_UADDR_DEVADDR_Msk             (_UINT32_(0x7F) << USBCORE_UADDR_DEVADDR_Pos)        /* (USBCORE_UADDR)  Mask */
#define USBCORE_UADDR_DEVADDR(value)          (USBCORE_UADDR_DEVADDR_Msk & (_UINT32_(value) << USBCORE_UADDR_DEVADDR_Pos)) /* Assigment of value for DEVADDR in the USBCORE_UADDR register */
#define USBCORE_UADDR_LSPDEN_Pos              _UINT32_(7)                                          /* (USBCORE_UADDR) Low Speed Enable Indicator bit Position */
#define USBCORE_UADDR_LSPDEN_Msk              (_UINT32_(0x1) << USBCORE_UADDR_LSPDEN_Pos)          /* (USBCORE_UADDR) Low Speed Enable Indicator bit Mask */
#define USBCORE_UADDR_LSPDEN(value)           (USBCORE_UADDR_LSPDEN_Msk & (_UINT32_(value) << USBCORE_UADDR_LSPDEN_Pos)) /* Assigment of value for LSPDEN in the USBCORE_UADDR register */
#define   USBCORE_UADDR_LSPDEN_LOW_SPEED_Val  _UINT32_(0x1)                                        /* (USBCORE_UADDR) Next token command to be executed at Low Speed  */
#define   USBCORE_UADDR_LSPDEN_FULL_SPEED_Val _UINT32_(0x0)                                        /* (USBCORE_UADDR) Next token command to be executed at Full Speed  */
#define USBCORE_UADDR_LSPDEN_LOW_SPEED        (USBCORE_UADDR_LSPDEN_LOW_SPEED_Val << USBCORE_UADDR_LSPDEN_Pos) /* (USBCORE_UADDR) Next token command to be executed at Low Speed Position  */
#define USBCORE_UADDR_LSPDEN_FULL_SPEED       (USBCORE_UADDR_LSPDEN_FULL_SPEED_Val << USBCORE_UADDR_LSPDEN_Pos) /* (USBCORE_UADDR) Next token command to be executed at Full Speed Position  */
#define USBCORE_UADDR_Msk                     _UINT32_(0x000000FF)                                 /* (USBCORE_UADDR) Register Mask  */


/* -------- USBCORE_UADDRCLR : (USBCORE Offset: 0x264) (R/W 32)  -------- */
#define USBCORE_UADDRCLR_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_UADDRCLR)   Reset Value */

#define USBCORE_UADDRCLR_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_UADDRCLR) Register Mask  */


/* -------- USBCORE_UADDRSET : (USBCORE Offset: 0x268) (R/W 32)  -------- */
#define USBCORE_UADDRSET_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_UADDRSET)   Reset Value */

#define USBCORE_UADDRSET_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_UADDRSET) Register Mask  */


/* -------- USBCORE_UADDRINV : (USBCORE Offset: 0x26C) (R/W 32)  -------- */
#define USBCORE_UADDRINV_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_UADDRINV)   Reset Value */

#define USBCORE_UADDRINV_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_UADDRINV) Register Mask  */


/* -------- USBCORE_UBDTP1 : (USBCORE Offset: 0x270) (R/W 32) USB BDT Page 1 Register -------- */
#define USBCORE_UBDTP1_BDTPTRL_Pos            _UINT32_(1)                                          /* (USBCORE_UBDTP1)  Position */
#define USBCORE_UBDTP1_BDTPTRL_Msk            (_UINT32_(0x7F) << USBCORE_UBDTP1_BDTPTRL_Pos)       /* (USBCORE_UBDTP1)  Mask */
#define USBCORE_UBDTP1_BDTPTRL(value)         (USBCORE_UBDTP1_BDTPTRL_Msk & (_UINT32_(value) << USBCORE_UBDTP1_BDTPTRL_Pos)) /* Assigment of value for BDTPTRL in the USBCORE_UBDTP1 register */
#define USBCORE_UBDTP1_Msk                    _UINT32_(0x000000FE)                                 /* (USBCORE_UBDTP1) Register Mask  */


/* -------- USBCORE_UBDTP1CLR : (USBCORE Offset: 0x274) (R/W 32)  -------- */
#define USBCORE_UBDTP1CLR_RESETVALUE          _UINT32_(0x00)                                       /*  (USBCORE_UBDTP1CLR)   Reset Value */

#define USBCORE_UBDTP1CLR_Msk                 _UINT32_(0x00000000)                                 /* (USBCORE_UBDTP1CLR) Register Mask  */


/* -------- USBCORE_UBDTP1SET : (USBCORE Offset: 0x278) (R/W 32)  -------- */
#define USBCORE_UBDTP1SET_RESETVALUE          _UINT32_(0x00)                                       /*  (USBCORE_UBDTP1SET)   Reset Value */

#define USBCORE_UBDTP1SET_Msk                 _UINT32_(0x00000000)                                 /* (USBCORE_UBDTP1SET) Register Mask  */


/* -------- USBCORE_UBDTP1INV : (USBCORE Offset: 0x27C) (R/W 32)  -------- */
#define USBCORE_UBDTP1INV_RESETVALUE          _UINT32_(0x00)                                       /*  (USBCORE_UBDTP1INV)   Reset Value */

#define USBCORE_UBDTP1INV_Msk                 _UINT32_(0x00000000)                                 /* (USBCORE_UBDTP1INV) Register Mask  */


/* -------- USBCORE_UFRML : (USBCORE Offset: 0x280) ( R/ 32) USB Frame Number Low Register -------- */
#define USBCORE_UFRML_FRML_Pos                _UINT32_(0)                                          /* (USBCORE_UFRML)  Position */
#define USBCORE_UFRML_FRML_Msk                (_UINT32_(0xFF) << USBCORE_UFRML_FRML_Pos)           /* (USBCORE_UFRML)  Mask */
#define USBCORE_UFRML_FRML(value)             (USBCORE_UFRML_FRML_Msk & (_UINT32_(value) << USBCORE_UFRML_FRML_Pos)) /* Assigment of value for FRML in the USBCORE_UFRML register */
#define USBCORE_UFRML_Msk                     _UINT32_(0x000000FF)                                 /* (USBCORE_UFRML) Register Mask  */


