Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_tcp_client/src/packs/WBZ653_DFP/component/usbcore.h
#define USBCORE_USOFSET_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_USOFSET) Register Mask  */


/* -------- USBCORE_USOFINV : (USBCORE Offset: 0x2BC) (R/W 32)  -------- */
#define USBCORE_USOFINV_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_USOFINV)   Reset Value */

#define USBCORE_USOFINV_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_USOFINV) Register Mask  */


/* -------- USBCORE_UBDTP2 : (USBCORE Offset: 0x2C0) (R/W 32) USB BDT PAGE 2 Register -------- */
#define USBCORE_UBDTP2_BDTPTRH_Pos            _UINT32_(0)                                          /* (USBCORE_UBDTP2)  Position */
#define USBCORE_UBDTP2_BDTPTRH_Msk            (_UINT32_(0xFF) << USBCORE_UBDTP2_BDTPTRH_Pos)       /* (USBCORE_UBDTP2)  Mask */
#define USBCORE_UBDTP2_BDTPTRH(value)         (USBCORE_UBDTP2_BDTPTRH_Msk & (_UINT32_(value) << USBCORE_UBDTP2_BDTPTRH_Pos)) /* Assigment of value for BDTPTRH in the USBCORE_UBDTP2 register */
#define USBCORE_UBDTP2_Msk                    _UINT32_(0x000000FF)                                 /* (USBCORE_UBDTP2) Register Mask  */


/* -------- USBCORE_UBDTP2CLR : (USBCORE Offset: 0x2C4) (R/W 32)  -------- */
#define USBCORE_UBDTP2CLR_RESETVALUE          _UINT32_(0x00)                                       /*  (USBCORE_UBDTP2CLR)   Reset Value */

#define USBCORE_UBDTP2CLR_Msk                 _UINT32_(0x00000000)                                 /* (USBCORE_UBDTP2CLR) Register Mask  */


/* -------- USBCORE_UBDTP2SET : (USBCORE Offset: 0x2C8) (R/W 32)  -------- */
#define USBCORE_UBDTP2SET_RESETVALUE          _UINT32_(0x00)                                       /*  (USBCORE_UBDTP2SET)   Reset Value */

#define USBCORE_UBDTP2SET_Msk                 _UINT32_(0x00000000)                                 /* (USBCORE_UBDTP2SET) Register Mask  */


/* -------- USBCORE_UBDTP2INV : (USBCORE Offset: 0x2CC) (R/W 32)  -------- */
#define USBCORE_UBDTP2INV_RESETVALUE          _UINT32_(0x00)                                       /*  (USBCORE_UBDTP2INV)   Reset Value */

#define USBCORE_UBDTP2INV_Msk                 _UINT32_(0x00000000)                                 /* (USBCORE_UBDTP2INV) Register Mask  */


/* -------- USBCORE_UBDTP3 : (USBCORE Offset: 0x2D0) (R/W 32) USB BDT PAGE 3 Register -------- */
#define USBCORE_UBDTP3_BDTPTRU_Pos            _UINT32_(0)                                          /* (USBCORE_UBDTP3)  Position */
#define USBCORE_UBDTP3_BDTPTRU_Msk            (_UINT32_(0xFF) << USBCORE_UBDTP3_BDTPTRU_Pos)       /* (USBCORE_UBDTP3)  Mask */
#define USBCORE_UBDTP3_BDTPTRU(value)         (USBCORE_UBDTP3_BDTPTRU_Msk & (_UINT32_(value) << USBCORE_UBDTP3_BDTPTRU_Pos)) /* Assigment of value for BDTPTRU in the USBCORE_UBDTP3 register */
#define USBCORE_UBDTP3_Msk                    _UINT32_(0x000000FF)                                 /* (USBCORE_UBDTP3) Register Mask  */


/* -------- USBCORE_UBDTP3CLR : (USBCORE Offset: 0x2D4) (R/W 32)  -------- */
#define USBCORE_UBDTP3CLR_RESETVALUE          _UINT32_(0x00)                                       /*  (USBCORE_UBDTP3CLR)   Reset Value */

#define USBCORE_UBDTP3CLR_Msk                 _UINT32_(0x00000000)                                 /* (USBCORE_UBDTP3CLR) Register Mask  */


/* -------- USBCORE_UBDTP3SET : (USBCORE Offset: 0x2D8) (R/W 32)  -------- */
#define USBCORE_UBDTP3SET_RESETVALUE          _UINT32_(0x00)                                       /*  (USBCORE_UBDTP3SET)   Reset Value */

#define USBCORE_UBDTP3SET_Msk                 _UINT32_(0x00000000)                                 /* (USBCORE_UBDTP3SET) Register Mask  */


/* -------- USBCORE_UBDTP3INV : (USBCORE Offset: 0x2DC) (R/W 32)  -------- */
#define USBCORE_UBDTP3INV_RESETVALUE          _UINT32_(0x00)                                       /*  (USBCORE_UBDTP3INV)   Reset Value */

#define USBCORE_UBDTP3INV_Msk                 _UINT32_(0x00000000)                                 /* (USBCORE_UBDTP3INV) Register Mask  */


/* -------- USBCORE_UCNFG1 : (USBCORE Offset: 0x2E0) (R/W 32) USB Configuration 1 Register -------- */
#define USBCORE_UCNFG1_AUTO_SUSP_Pos          _UINT32_(0)                                          /* (USBCORE_UCNFG1) Automatic Suspend Enable bit Position */
#define USBCORE_UCNFG1_AUTO_SUSP_Msk          (_UINT32_(0x1) << USBCORE_UCNFG1_AUTO_SUSP_Pos)      /* (USBCORE_UCNFG1) Automatic Suspend Enable bit Mask */
#define USBCORE_UCNFG1_AUTO_SUSP(value)       (USBCORE_UCNFG1_AUTO_SUSP_Msk & (_UINT32_(value) << USBCORE_UCNFG1_AUTO_SUSP_Pos)) /* Assigment of value for AUTO_SUSP in the USBCORE_UCNFG1 register */
#define   USBCORE_UCNFG1_AUTO_SUSP_AUTO_SUSPEND_Val _UINT32_(0x1)                                        /* (USBCORE_UCNFG1) USB module automatically suspends upon entry to Sleep mode. See the USUSPEND bit (UxPWRC) in  */
#define   USBCORE_UCNFG1_AUTO_SUSP_NO_AUTO_SUSPEND_Val _UINT32_(0x0)                                        /* (USBCORE_UCNFG1) USB module does not automatically suspend upon entry to Sleep mode. Software must use the USUSPEND bit (UxPWRC) to suspend the module  */
#define USBCORE_UCNFG1_AUTO_SUSP_AUTO_SUSPEND (USBCORE_UCNFG1_AUTO_SUSP_AUTO_SUSPEND_Val << USBCORE_UCNFG1_AUTO_SUSP_Pos) /* (USBCORE_UCNFG1) USB module automatically suspends upon entry to Sleep mode. See the USUSPEND bit (UxPWRC) in Position  */
#define USBCORE_UCNFG1_AUTO_SUSP_NO_AUTO_SUSPEND (USBCORE_UCNFG1_AUTO_SUSP_NO_AUTO_SUSPEND_Val << USBCORE_UCNFG1_AUTO_SUSP_Pos) /* (USBCORE_UCNFG1) USB module does not automatically suspend upon entry to Sleep mode. Software must use the USUSPEND bit (UxPWRC) to suspend the module Position  */
#define USBCORE_UCNFG1_LSDEV_Pos              _UINT32_(3)                                          /* (USBCORE_UCNFG1) Low-Speed Device Enable bit Position */
#define USBCORE_UCNFG1_LSDEV_Msk              (_UINT32_(0x1) << USBCORE_UCNFG1_LSDEV_Pos)          /* (USBCORE_UCNFG1) Low-Speed Device Enable bit Mask */
#define USBCORE_UCNFG1_LSDEV(value)           (USBCORE_UCNFG1_LSDEV_Msk & (_UINT32_(value) << USBCORE_UCNFG1_LSDEV_Pos)) /* Assigment of value for LSDEV in the USBCORE_UCNFG1 register */
#define   USBCORE_UCNFG1_LSDEV_LOW_SPEED_Val  _UINT32_(0x1)                                        /* (USBCORE_UCNFG1) USB module to operate in Low-Speed Device mode  */
#define   USBCORE_UCNFG1_LSDEV_OTG_Val        _UINT32_(0x0)                                        /* (USBCORE_UCNFG1) USB module to operate in OTG  */
#define USBCORE_UCNFG1_LSDEV_LOW_SPEED        (USBCORE_UCNFG1_LSDEV_LOW_SPEED_Val << USBCORE_UCNFG1_LSDEV_Pos) /* (USBCORE_UCNFG1) USB module to operate in Low-Speed Device mode Position  */
#define USBCORE_UCNFG1_LSDEV_OTG              (USBCORE_UCNFG1_LSDEV_OTG_Val << USBCORE_UCNFG1_LSDEV_Pos) /* (USBCORE_UCNFG1) USB module to operate in OTG Position  */
#define USBCORE_UCNFG1_PSIDL_Pos              _UINT32_(4)                                          /* (USBCORE_UCNFG1) Stop in Idle Mode bit Position */
#define USBCORE_UCNFG1_PSIDL_Msk              (_UINT32_(0x1) << USBCORE_UCNFG1_PSIDL_Pos)          /* (USBCORE_UCNFG1) Stop in Idle Mode bit Mask */
#define USBCORE_UCNFG1_PSIDL(value)           (USBCORE_UCNFG1_PSIDL_Msk & (_UINT32_(value) << USBCORE_UCNFG1_PSIDL_Pos)) /* Assigment of value for PSIDL in the USBCORE_UCNFG1 register */
#define   USBCORE_UCNFG1_PSIDL_DISCONTINUE_Val _UINT32_(0x1)                                        /* (USBCORE_UCNFG1) Discontinue module operation when device enters Idle mode  */
#define   USBCORE_UCNFG1_PSIDL_CONTINUE_Val   _UINT32_(0x0)                                        /* (USBCORE_UCNFG1) Continue module operation in Idle mode  */
#define USBCORE_UCNFG1_PSIDL_DISCONTINUE      (USBCORE_UCNFG1_PSIDL_DISCONTINUE_Val << USBCORE_UCNFG1_PSIDL_Pos) /* (USBCORE_UCNFG1) Discontinue module operation when device enters Idle mode Position  */
#define USBCORE_UCNFG1_PSIDL_CONTINUE         (USBCORE_UCNFG1_PSIDL_CONTINUE_Val << USBCORE_UCNFG1_PSIDL_Pos) /* (USBCORE_UCNFG1) Continue module operation in Idle mode Position  */
#define USBCORE_UCNFG1_UOEMON_Pos             _UINT32_(6)                                          /* (USBCORE_UCNFG1) USB Position */
#define USBCORE_UCNFG1_UOEMON_Msk             (_UINT32_(0x1) << USBCORE_UCNFG1_UOEMON_Pos)         /* (USBCORE_UCNFG1) USB Mask */
#define USBCORE_UCNFG1_UOEMON(value)          (USBCORE_UCNFG1_UOEMON_Msk & (_UINT32_(value) << USBCORE_UCNFG1_UOEMON_Pos)) /* Assigment of value for UOEMON in the USBCORE_UCNFG1 register */
#define   USBCORE_UCNFG1_UOEMON_ACTIVE_Val    _UINT32_(0x1)                                        /* (USBCORE_UCNFG1) OE signal is active; it indicates intervals during which the D+/D- lines are driving  */
#define   USBCORE_UCNFG1_UOEMON_INACTIVE_Val  _UINT32_(0x0)                                        /* (USBCORE_UCNFG1) OE signal is inactive  */
#define USBCORE_UCNFG1_UOEMON_ACTIVE          (USBCORE_UCNFG1_UOEMON_ACTIVE_Val << USBCORE_UCNFG1_UOEMON_Pos) /* (USBCORE_UCNFG1) OE signal is active; it indicates intervals during which the D+/D- lines are driving Position  */
#define USBCORE_UCNFG1_UOEMON_INACTIVE        (USBCORE_UCNFG1_UOEMON_INACTIVE_Val << USBCORE_UCNFG1_UOEMON_Pos) /* (USBCORE_UCNFG1) OE signal is inactive Position  */
#define USBCORE_UCNFG1_UTEYE_Pos              _UINT32_(7)                                          /* (USBCORE_UCNFG1) USB Eye-Pattern Test Enable bit Position */
#define USBCORE_UCNFG1_UTEYE_Msk              (_UINT32_(0x1) << USBCORE_UCNFG1_UTEYE_Pos)          /* (USBCORE_UCNFG1) USB Eye-Pattern Test Enable bit Mask */
#define USBCORE_UCNFG1_UTEYE(value)           (USBCORE_UCNFG1_UTEYE_Msk & (_UINT32_(value) << USBCORE_UCNFG1_UTEYE_Pos)) /* Assigment of value for UTEYE in the USBCORE_UCNFG1 register */
#define   USBCORE_UCNFG1_UTEYE_ON_Val         _UINT32_(0x1)                                        /* (USBCORE_UCNFG1) Eye-Pattern Test is enabled  */
#define   USBCORE_UCNFG1_UTEYE_OFF_Val        _UINT32_(0x0)                                        /* (USBCORE_UCNFG1) Eye-Pattern Test is disabled  */
#define USBCORE_UCNFG1_UTEYE_ON               (USBCORE_UCNFG1_UTEYE_ON_Val << USBCORE_UCNFG1_UTEYE_Pos) /* (USBCORE_UCNFG1) Eye-Pattern Test is enabled Position  */
#define USBCORE_UCNFG1_UTEYE_OFF              (USBCORE_UCNFG1_UTEYE_OFF_Val << USBCORE_UCNFG1_UTEYE_Pos) /* (USBCORE_UCNFG1) Eye-Pattern Test is disabled Position  */
#define USBCORE_UCNFG1_Msk                    _UINT32_(0x000000D9)                                 /* (USBCORE_UCNFG1) Register Mask  */


/* -------- USBCORE_UCNFG1CLR : (USBCORE Offset: 0x2E4) (R/W 32)  -------- */
#define USBCORE_UCNFG1CLR_RESETVALUE          _UINT32_(0x00)                                       /*  (USBCORE_UCNFG1CLR)   Reset Value */

#define USBCORE_UCNFG1CLR_Msk                 _UINT32_(0x00000000)                                 /* (USBCORE_UCNFG1CLR) Register Mask  */


/* -------- USBCORE_UCNFG1SET : (USBCORE Offset: 0x2E8) (R/W 32)  -------- */
#define USBCORE_UCNFG1SET_RESETVALUE          _UINT32_(0x00)                                       /*  (USBCORE_UCNFG1SET)   Reset Value */

#define USBCORE_UCNFG1SET_Msk                 _UINT32_(0x00000000)                                 /* (USBCORE_UCNFG1SET) Register Mask  */


/* -------- USBCORE_UCNFG1INV : (USBCORE Offset: 0x2EC) (R/W 32)  -------- */
#define USBCORE_UCNFG1INV_RESETVALUE          _UINT32_(0x00)                                       /*  (USBCORE_UCNFG1INV)   Reset Value */

