Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_tcp_client/src/packs/WBZ653_DFP/component/usbcore.h
#define USBCORE_UEP0SET_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEP0SET) Register Mask  */


/* -------- USBCORE_UEP0INV : (USBCORE Offset: 0x30C) (R/W 32)  -------- */
#define USBCORE_UEP0INV_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEP0INV)   Reset Value */

#define USBCORE_UEP0INV_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEP0INV) Register Mask  */


/* -------- USBCORE_UEP1 : (USBCORE Offset: 0x310) (R/W 32) USB Endpoint Control Register 1 -------- */
#define USBCORE_UEP1_EPHSHK_Pos               _UINT32_(0)                                          /* (USBCORE_UEP1) Endpoint Handshake Enable bit Position */
#define USBCORE_UEP1_EPHSHK_Msk               (_UINT32_(0x1) << USBCORE_UEP1_EPHSHK_Pos)           /* (USBCORE_UEP1) Endpoint Handshake Enable bit Mask */
#define USBCORE_UEP1_EPHSHK(value)            (USBCORE_UEP1_EPHSHK_Msk & (_UINT32_(value) << USBCORE_UEP1_EPHSHK_Pos)) /* Assigment of value for EPHSHK in the USBCORE_UEP1 register */
#define   USBCORE_UEP1_EPHSHK_ON_Val          _UINT32_(0x1)                                        /* (USBCORE_UEP1) Endpoint Handshake is enabled  */
#define   USBCORE_UEP1_EPHSHK_OFF_Val         _UINT32_(0x0)                                        /* (USBCORE_UEP1) Endpoint Handshake is disabled (typically used for isochronous endpoints)  */
#define USBCORE_UEP1_EPHSHK_ON                (USBCORE_UEP1_EPHSHK_ON_Val << USBCORE_UEP1_EPHSHK_Pos) /* (USBCORE_UEP1) Endpoint Handshake is enabled Position  */
#define USBCORE_UEP1_EPHSHK_OFF               (USBCORE_UEP1_EPHSHK_OFF_Val << USBCORE_UEP1_EPHSHK_Pos) /* (USBCORE_UEP1) Endpoint Handshake is disabled (typically used for isochronous endpoints) Position  */
#define USBCORE_UEP1_EPSTALL_Pos              _UINT32_(1)                                          /* (USBCORE_UEP1) Endpoint Stall Status bit Position */
#define USBCORE_UEP1_EPSTALL_Msk              (_UINT32_(0x1) << USBCORE_UEP1_EPSTALL_Pos)          /* (USBCORE_UEP1) Endpoint Stall Status bit Mask */
#define USBCORE_UEP1_EPSTALL(value)           (USBCORE_UEP1_EPSTALL_Msk & (_UINT32_(value) << USBCORE_UEP1_EPSTALL_Pos)) /* Assigment of value for EPSTALL in the USBCORE_UEP1 register */
#define   USBCORE_UEP1_EPSTALL_STALL_Val      _UINT32_(0x1)                                        /* (USBCORE_UEP1) Endpoint 1 was stalled  */
#define   USBCORE_UEP1_EPSTALL_NOT_STALL_Val  _UINT32_(0x0)                                        /* (USBCORE_UEP1) Endpoint 1 was not stalled  */
#define USBCORE_UEP1_EPSTALL_STALL            (USBCORE_UEP1_EPSTALL_STALL_Val << USBCORE_UEP1_EPSTALL_Pos) /* (USBCORE_UEP1) Endpoint 1 was stalled Position  */
#define USBCORE_UEP1_EPSTALL_NOT_STALL        (USBCORE_UEP1_EPSTALL_NOT_STALL_Val << USBCORE_UEP1_EPSTALL_Pos) /* (USBCORE_UEP1) Endpoint 1 was not stalled Position  */
#define USBCORE_UEP1_EPTXEN_Pos               _UINT32_(2)                                          /* (USBCORE_UEP1) Endpoint Transmit Enable bit Position */
#define USBCORE_UEP1_EPTXEN_Msk               (_UINT32_(0x1) << USBCORE_UEP1_EPTXEN_Pos)           /* (USBCORE_UEP1) Endpoint Transmit Enable bit Mask */
#define USBCORE_UEP1_EPTXEN(value)            (USBCORE_UEP1_EPTXEN_Msk & (_UINT32_(value) << USBCORE_UEP1_EPTXEN_Pos)) /* Assigment of value for EPTXEN in the USBCORE_UEP1 register */
#define   USBCORE_UEP1_EPTXEN_ON_Val          _UINT32_(0x1)                                        /* (USBCORE_UEP1) Endpoint 1 transmit is enabled  */
#define   USBCORE_UEP1_EPTXEN_OFF_Val         _UINT32_(0x0)                                        /* (USBCORE_UEP1) Endpoint 1 transmit is disabled  */
#define USBCORE_UEP1_EPTXEN_ON                (USBCORE_UEP1_EPTXEN_ON_Val << USBCORE_UEP1_EPTXEN_Pos) /* (USBCORE_UEP1) Endpoint 1 transmit is enabled Position  */
#define USBCORE_UEP1_EPTXEN_OFF               (USBCORE_UEP1_EPTXEN_OFF_Val << USBCORE_UEP1_EPTXEN_Pos) /* (USBCORE_UEP1) Endpoint 1 transmit is disabled Position  */
#define USBCORE_UEP1_EPRXEN_Pos               _UINT32_(3)                                          /* (USBCORE_UEP1) Endpoint Receive Enable bit Position */
#define USBCORE_UEP1_EPRXEN_Msk               (_UINT32_(0x1) << USBCORE_UEP1_EPRXEN_Pos)           /* (USBCORE_UEP1) Endpoint Receive Enable bit Mask */
#define USBCORE_UEP1_EPRXEN(value)            (USBCORE_UEP1_EPRXEN_Msk & (_UINT32_(value) << USBCORE_UEP1_EPRXEN_Pos)) /* Assigment of value for EPRXEN in the USBCORE_UEP1 register */
#define   USBCORE_UEP1_EPRXEN_ON_Val          _UINT32_(0x1)                                        /* (USBCORE_UEP1) Endpoint 1 receive is enabled  */
#define   USBCORE_UEP1_EPRXEN_OFF_Val         _UINT32_(0x0)                                        /* (USBCORE_UEP1) Endpoint 1 receive is disabled  */
#define USBCORE_UEP1_EPRXEN_ON                (USBCORE_UEP1_EPRXEN_ON_Val << USBCORE_UEP1_EPRXEN_Pos) /* (USBCORE_UEP1) Endpoint 1 receive is enabled Position  */
#define USBCORE_UEP1_EPRXEN_OFF               (USBCORE_UEP1_EPRXEN_OFF_Val << USBCORE_UEP1_EPRXEN_Pos) /* (USBCORE_UEP1) Endpoint 1 receive is disabled Position  */
#define USBCORE_UEP1_EPCONDIS_Pos             _UINT32_(4)                                          /* (USBCORE_UEP1) Bidirectional Endpoint Control bit Position */
#define USBCORE_UEP1_EPCONDIS_Msk             (_UINT32_(0x1) << USBCORE_UEP1_EPCONDIS_Pos)         /* (USBCORE_UEP1) Bidirectional Endpoint Control bit Mask */
#define USBCORE_UEP1_EPCONDIS(value)          (USBCORE_UEP1_EPCONDIS_Msk & (_UINT32_(value) << USBCORE_UEP1_EPCONDIS_Pos)) /* Assigment of value for EPCONDIS in the USBCORE_UEP1 register */
#define   USBCORE_UEP1_EPCONDIS_DISABLE_1_Val _UINT32_(0x1)                                        /* (USBCORE_UEP1) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 1 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored  */
#define   USBCORE_UEP1_EPCONDIS_ENABLE_1_Val  _UINT32_(0x0)                                        /* (USBCORE_UEP1) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 1 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored  */
#define USBCORE_UEP1_EPCONDIS_DISABLE_1       (USBCORE_UEP1_EPCONDIS_DISABLE_1_Val << USBCORE_UEP1_EPCONDIS_Pos) /* (USBCORE_UEP1) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 1 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored Position  */
#define USBCORE_UEP1_EPCONDIS_ENABLE_1        (USBCORE_UEP1_EPCONDIS_ENABLE_1_Val << USBCORE_UEP1_EPCONDIS_Pos) /* (USBCORE_UEP1) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 1 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored Position  */
#define USBCORE_UEP1_Msk                      _UINT32_(0x0000001F)                                 /* (USBCORE_UEP1) Register Mask  */


