Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_tcp_client/src/packs/WBZ653_DFP/component/usbcore.h
/* -------- USBCORE_UEP1CLR : (USBCORE Offset: 0x314) (R/W 32)  -------- */
#define USBCORE_UEP1CLR_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEP1CLR)   Reset Value */

#define USBCORE_UEP1CLR_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEP1CLR) Register Mask  */


/* -------- USBCORE_UEP1SET : (USBCORE Offset: 0x318) (R/W 32)  -------- */
#define USBCORE_UEP1SET_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEP1SET)   Reset Value */

#define USBCORE_UEP1SET_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEP1SET) Register Mask  */


/* -------- USBCORE_UEP1INV : (USBCORE Offset: 0x31C) (R/W 32)  -------- */
#define USBCORE_UEP1INV_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEP1INV)   Reset Value */

#define USBCORE_UEP1INV_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEP1INV) Register Mask  */


/* -------- USBCORE_UEP2 : (USBCORE Offset: 0x320) (R/W 32) USB Endpoint Control Register 2 -------- */
#define USBCORE_UEP2_EPHSHK_Pos               _UINT32_(0)                                          /* (USBCORE_UEP2) Endpoint Handshake Enable bit Position */
#define USBCORE_UEP2_EPHSHK_Msk               (_UINT32_(0x1) << USBCORE_UEP2_EPHSHK_Pos)           /* (USBCORE_UEP2) Endpoint Handshake Enable bit Mask */
#define USBCORE_UEP2_EPHSHK(value)            (USBCORE_UEP2_EPHSHK_Msk & (_UINT32_(value) << USBCORE_UEP2_EPHSHK_Pos)) /* Assigment of value for EPHSHK in the USBCORE_UEP2 register */
#define   USBCORE_UEP2_EPHSHK_ON_Val          _UINT32_(0x1)                                        /* (USBCORE_UEP2) Endpoint Handshake is enabled  */
#define   USBCORE_UEP2_EPHSHK_OFF_Val         _UINT32_(0x0)                                        /* (USBCORE_UEP2) Endpoint Handshake is disabled (typically used for isochronous endpoints)  */
#define USBCORE_UEP2_EPHSHK_ON                (USBCORE_UEP2_EPHSHK_ON_Val << USBCORE_UEP2_EPHSHK_Pos) /* (USBCORE_UEP2) Endpoint Handshake is enabled Position  */
#define USBCORE_UEP2_EPHSHK_OFF               (USBCORE_UEP2_EPHSHK_OFF_Val << USBCORE_UEP2_EPHSHK_Pos) /* (USBCORE_UEP2) Endpoint Handshake is disabled (typically used for isochronous endpoints) Position  */
#define USBCORE_UEP2_EPSTALL_Pos              _UINT32_(1)                                          /* (USBCORE_UEP2) Endpoint Stall Status bit Position */
#define USBCORE_UEP2_EPSTALL_Msk              (_UINT32_(0x1) << USBCORE_UEP2_EPSTALL_Pos)          /* (USBCORE_UEP2) Endpoint Stall Status bit Mask */
#define USBCORE_UEP2_EPSTALL(value)           (USBCORE_UEP2_EPSTALL_Msk & (_UINT32_(value) << USBCORE_UEP2_EPSTALL_Pos)) /* Assigment of value for EPSTALL in the USBCORE_UEP2 register */
#define   USBCORE_UEP2_EPSTALL_STALL_Val      _UINT32_(0x1)                                        /* (USBCORE_UEP2) Endpoint 2 was stalled  */
#define   USBCORE_UEP2_EPSTALL_NOT_STALL_Val  _UINT32_(0x0)                                        /* (USBCORE_UEP2) Endpoint 2 was not stalled  */
#define USBCORE_UEP2_EPSTALL_STALL            (USBCORE_UEP2_EPSTALL_STALL_Val << USBCORE_UEP2_EPSTALL_Pos) /* (USBCORE_UEP2) Endpoint 2 was stalled Position  */
#define USBCORE_UEP2_EPSTALL_NOT_STALL        (USBCORE_UEP2_EPSTALL_NOT_STALL_Val << USBCORE_UEP2_EPSTALL_Pos) /* (USBCORE_UEP2) Endpoint 2 was not stalled Position  */
#define USBCORE_UEP2_EPTXEN_Pos               _UINT32_(2)                                          /* (USBCORE_UEP2) Endpoint Transmit Enable bit Position */
#define USBCORE_UEP2_EPTXEN_Msk               (_UINT32_(0x1) << USBCORE_UEP2_EPTXEN_Pos)           /* (USBCORE_UEP2) Endpoint Transmit Enable bit Mask */
#define USBCORE_UEP2_EPTXEN(value)            (USBCORE_UEP2_EPTXEN_Msk & (_UINT32_(value) << USBCORE_UEP2_EPTXEN_Pos)) /* Assigment of value for EPTXEN in the USBCORE_UEP2 register */
#define   USBCORE_UEP2_EPTXEN_ON_Val          _UINT32_(0x1)                                        /* (USBCORE_UEP2) Endpoint 2 transmit is enabled  */
#define   USBCORE_UEP2_EPTXEN_OFF_Val         _UINT32_(0x0)                                        /* (USBCORE_UEP2) Endpoint 2 transmit is disabled  */
#define USBCORE_UEP2_EPTXEN_ON                (USBCORE_UEP2_EPTXEN_ON_Val << USBCORE_UEP2_EPTXEN_Pos) /* (USBCORE_UEP2) Endpoint 2 transmit is enabled Position  */
#define USBCORE_UEP2_EPTXEN_OFF               (USBCORE_UEP2_EPTXEN_OFF_Val << USBCORE_UEP2_EPTXEN_Pos) /* (USBCORE_UEP2) Endpoint 2 transmit is disabled Position  */
#define USBCORE_UEP2_EPRXEN_Pos               _UINT32_(3)                                          /* (USBCORE_UEP2) Endpoint Receive Enable bit Position */
#define USBCORE_UEP2_EPRXEN_Msk               (_UINT32_(0x1) << USBCORE_UEP2_EPRXEN_Pos)           /* (USBCORE_UEP2) Endpoint Receive Enable bit Mask */
#define USBCORE_UEP2_EPRXEN(value)            (USBCORE_UEP2_EPRXEN_Msk & (_UINT32_(value) << USBCORE_UEP2_EPRXEN_Pos)) /* Assigment of value for EPRXEN in the USBCORE_UEP2 register */
#define   USBCORE_UEP2_EPRXEN_ON_Val          _UINT32_(0x1)                                        /* (USBCORE_UEP2) Endpoint 2 receive is enabled  */
#define   USBCORE_UEP2_EPRXEN_OFF_Val         _UINT32_(0x0)                                        /* (USBCORE_UEP2) Endpoint 2 receive is disabled  */
#define USBCORE_UEP2_EPRXEN_ON                (USBCORE_UEP2_EPRXEN_ON_Val << USBCORE_UEP2_EPRXEN_Pos) /* (USBCORE_UEP2) Endpoint 2 receive is enabled Position  */
#define USBCORE_UEP2_EPRXEN_OFF               (USBCORE_UEP2_EPRXEN_OFF_Val << USBCORE_UEP2_EPRXEN_Pos) /* (USBCORE_UEP2) Endpoint 2 receive is disabled Position  */
#define USBCORE_UEP2_EPCONDIS_Pos             _UINT32_(4)                                          /* (USBCORE_UEP2) Bidirectional Endpoint Control bit Position */
#define USBCORE_UEP2_EPCONDIS_Msk             (_UINT32_(0x1) << USBCORE_UEP2_EPCONDIS_Pos)         /* (USBCORE_UEP2) Bidirectional Endpoint Control bit Mask */
#define USBCORE_UEP2_EPCONDIS(value)          (USBCORE_UEP2_EPCONDIS_Msk & (_UINT32_(value) << USBCORE_UEP2_EPCONDIS_Pos)) /* Assigment of value for EPCONDIS in the USBCORE_UEP2 register */
#define   USBCORE_UEP2_EPCONDIS_DISABLE_2_Val _UINT32_(0x1)                                        /* (USBCORE_UEP2) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 2 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored  */
#define   USBCORE_UEP2_EPCONDIS_ENABLE_2_Val  _UINT32_(0x0)                                        /* (USBCORE_UEP2) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 2 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored  */
#define USBCORE_UEP2_EPCONDIS_DISABLE_2       (USBCORE_UEP2_EPCONDIS_DISABLE_2_Val << USBCORE_UEP2_EPCONDIS_Pos) /* (USBCORE_UEP2) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 2 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored Position  */
#define USBCORE_UEP2_EPCONDIS_ENABLE_2        (USBCORE_UEP2_EPCONDIS_ENABLE_2_Val << USBCORE_UEP2_EPCONDIS_Pos) /* (USBCORE_UEP2) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 2 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored Position  */
#define USBCORE_UEP2_Msk                      _UINT32_(0x0000001F)                                 /* (USBCORE_UEP2) Register Mask  */


