Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_tcp_client/src/packs/WBZ653_DFP/component/usbcore.h
/* -------- USBCORE_UEP2CLR : (USBCORE Offset: 0x324) (R/W 32)  -------- */
#define USBCORE_UEP2CLR_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEP2CLR)   Reset Value */

#define USBCORE_UEP2CLR_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEP2CLR) Register Mask  */


/* -------- USBCORE_UEP2SET : (USBCORE Offset: 0x328) (R/W 32)  -------- */
#define USBCORE_UEP2SET_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEP2SET)   Reset Value */

#define USBCORE_UEP2SET_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEP2SET) Register Mask  */


/* -------- USBCORE_UEP2INV : (USBCORE Offset: 0x32C) (R/W 32)  -------- */
#define USBCORE_UEP2INV_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEP2INV)   Reset Value */

#define USBCORE_UEP2INV_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEP2INV) Register Mask  */


/* -------- USBCORE_UEP3 : (USBCORE Offset: 0x330) (R/W 32) USB Endpoint Control Register 3 -------- */
#define USBCORE_UEP3_EPHSHK_Pos               _UINT32_(0)                                          /* (USBCORE_UEP3) Endpoint Handshake Enable bit Position */
#define USBCORE_UEP3_EPHSHK_Msk               (_UINT32_(0x1) << USBCORE_UEP3_EPHSHK_Pos)           /* (USBCORE_UEP3) Endpoint Handshake Enable bit Mask */
#define USBCORE_UEP3_EPHSHK(value)            (USBCORE_UEP3_EPHSHK_Msk & (_UINT32_(value) << USBCORE_UEP3_EPHSHK_Pos)) /* Assigment of value for EPHSHK in the USBCORE_UEP3 register */
#define   USBCORE_UEP3_EPHSHK_ON_Val          _UINT32_(0x1)                                        /* (USBCORE_UEP3) Endpoint Handshake is enabled  */
#define   USBCORE_UEP3_EPHSHK_OFF_Val         _UINT32_(0x0)                                        /* (USBCORE_UEP3) Endpoint Handshake is disabled (typically used for isochronous endpoints)  */
#define USBCORE_UEP3_EPHSHK_ON                (USBCORE_UEP3_EPHSHK_ON_Val << USBCORE_UEP3_EPHSHK_Pos) /* (USBCORE_UEP3) Endpoint Handshake is enabled Position  */
#define USBCORE_UEP3_EPHSHK_OFF               (USBCORE_UEP3_EPHSHK_OFF_Val << USBCORE_UEP3_EPHSHK_Pos) /* (USBCORE_UEP3) Endpoint Handshake is disabled (typically used for isochronous endpoints) Position  */
#define USBCORE_UEP3_EPSTALL_Pos              _UINT32_(1)                                          /* (USBCORE_UEP3) Endpoint Stall Status bit Position */
#define USBCORE_UEP3_EPSTALL_Msk              (_UINT32_(0x1) << USBCORE_UEP3_EPSTALL_Pos)          /* (USBCORE_UEP3) Endpoint Stall Status bit Mask */
#define USBCORE_UEP3_EPSTALL(value)           (USBCORE_UEP3_EPSTALL_Msk & (_UINT32_(value) << USBCORE_UEP3_EPSTALL_Pos)) /* Assigment of value for EPSTALL in the USBCORE_UEP3 register */
#define   USBCORE_UEP3_EPSTALL_STALL_Val      _UINT32_(0x1)                                        /* (USBCORE_UEP3) Endpoint 3 was stalled  */
#define   USBCORE_UEP3_EPSTALL_NOT_STALL_Val  _UINT32_(0x0)                                        /* (USBCORE_UEP3) Endpoint 3 was not stalled  */
#define USBCORE_UEP3_EPSTALL_STALL            (USBCORE_UEP3_EPSTALL_STALL_Val << USBCORE_UEP3_EPSTALL_Pos) /* (USBCORE_UEP3) Endpoint 3 was stalled Position  */
#define USBCORE_UEP3_EPSTALL_NOT_STALL        (USBCORE_UEP3_EPSTALL_NOT_STALL_Val << USBCORE_UEP3_EPSTALL_Pos) /* (USBCORE_UEP3) Endpoint 3 was not stalled Position  */
#define USBCORE_UEP3_EPTXEN_Pos               _UINT32_(2)                                          /* (USBCORE_UEP3) Endpoint Transmit Enable bit Position */
#define USBCORE_UEP3_EPTXEN_Msk               (_UINT32_(0x1) << USBCORE_UEP3_EPTXEN_Pos)           /* (USBCORE_UEP3) Endpoint Transmit Enable bit Mask */
#define USBCORE_UEP3_EPTXEN(value)            (USBCORE_UEP3_EPTXEN_Msk & (_UINT32_(value) << USBCORE_UEP3_EPTXEN_Pos)) /* Assigment of value for EPTXEN in the USBCORE_UEP3 register */
#define   USBCORE_UEP3_EPTXEN_ON_Val          _UINT32_(0x1)                                        /* (USBCORE_UEP3) Endpoint n transmit is enabled  */
#define   USBCORE_UEP3_EPTXEN_OFF_Val         _UINT32_(0x0)                                        /* (USBCORE_UEP3) Endpoint n transmit is disabled  */
#define USBCORE_UEP3_EPTXEN_ON                (USBCORE_UEP3_EPTXEN_ON_Val << USBCORE_UEP3_EPTXEN_Pos) /* (USBCORE_UEP3) Endpoint n transmit is enabled Position  */
#define USBCORE_UEP3_EPTXEN_OFF               (USBCORE_UEP3_EPTXEN_OFF_Val << USBCORE_UEP3_EPTXEN_Pos) /* (USBCORE_UEP3) Endpoint n transmit is disabled Position  */
#define USBCORE_UEP3_EPRXEN_Pos               _UINT32_(3)                                          /* (USBCORE_UEP3) Endpoint Receive Enable bit Position */
#define USBCORE_UEP3_EPRXEN_Msk               (_UINT32_(0x1) << USBCORE_UEP3_EPRXEN_Pos)           /* (USBCORE_UEP3) Endpoint Receive Enable bit Mask */
#define USBCORE_UEP3_EPRXEN(value)            (USBCORE_UEP3_EPRXEN_Msk & (_UINT32_(value) << USBCORE_UEP3_EPRXEN_Pos)) /* Assigment of value for EPRXEN in the USBCORE_UEP3 register */
#define   USBCORE_UEP3_EPRXEN_ON_Val          _UINT32_(0x1)                                        /* (USBCORE_UEP3) Endpoint 3 receive is enabled  */
#define   USBCORE_UEP3_EPRXEN_OFF_Val         _UINT32_(0x0)                                        /* (USBCORE_UEP3) Endpoint 3 receive is disabled  */
#define USBCORE_UEP3_EPRXEN_ON                (USBCORE_UEP3_EPRXEN_ON_Val << USBCORE_UEP3_EPRXEN_Pos) /* (USBCORE_UEP3) Endpoint 3 receive is enabled Position  */
#define USBCORE_UEP3_EPRXEN_OFF               (USBCORE_UEP3_EPRXEN_OFF_Val << USBCORE_UEP3_EPRXEN_Pos) /* (USBCORE_UEP3) Endpoint 3 receive is disabled Position  */
#define USBCORE_UEP3_EPCONDIS_Pos             _UINT32_(4)                                          /* (USBCORE_UEP3) Bidirectional Endpoint Control bit Position */
#define USBCORE_UEP3_EPCONDIS_Msk             (_UINT32_(0x1) << USBCORE_UEP3_EPCONDIS_Pos)         /* (USBCORE_UEP3) Bidirectional Endpoint Control bit Mask */
#define USBCORE_UEP3_EPCONDIS(value)          (USBCORE_UEP3_EPCONDIS_Msk & (_UINT32_(value) << USBCORE_UEP3_EPCONDIS_Pos)) /* Assigment of value for EPCONDIS in the USBCORE_UEP3 register */
#define   USBCORE_UEP3_EPCONDIS_DISABLE_3_Val _UINT32_(0x1)                                        /* (USBCORE_UEP3) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 3 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored  */
#define   USBCORE_UEP3_EPCONDIS_ENABLE_3_Val  _UINT32_(0x0)                                        /* (USBCORE_UEP3) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 3 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored  */
#define USBCORE_UEP3_EPCONDIS_DISABLE_3       (USBCORE_UEP3_EPCONDIS_DISABLE_3_Val << USBCORE_UEP3_EPCONDIS_Pos) /* (USBCORE_UEP3) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 3 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored Position  */
#define USBCORE_UEP3_EPCONDIS_ENABLE_3        (USBCORE_UEP3_EPCONDIS_ENABLE_3_Val << USBCORE_UEP3_EPCONDIS_Pos) /* (USBCORE_UEP3) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 3 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored Position  */
#define USBCORE_UEP3_Msk                      _UINT32_(0x0000001F)                                 /* (USBCORE_UEP3) Register Mask  */


/* -------- USBCORE_UEP3CLR : (USBCORE Offset: 0x334) (R/W 32)  -------- */
#define USBCORE_UEP3CLR_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEP3CLR)   Reset Value */

#define USBCORE_UEP3CLR_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEP3CLR) Register Mask  */


/* -------- USBCORE_UEP3SET : (USBCORE Offset: 0x338) (R/W 32)  -------- */
#define USBCORE_UEP3SET_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEP3SET)   Reset Value */

#define USBCORE_UEP3SET_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEP3SET) Register Mask  */


