Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_tcp_client/src/packs/WBZ653_DFP/component/usbcore.h
#define USBCORE_UEP6SET_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEP6SET) Register Mask  */


/* -------- USBCORE_UEP6INV : (USBCORE Offset: 0x36C) (R/W 32)  -------- */
#define USBCORE_UEP6INV_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEP6INV)   Reset Value */

#define USBCORE_UEP6INV_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEP6INV) Register Mask  */


/* -------- USBCORE_UEP7 : (USBCORE Offset: 0x370) (R/W 32) USB Endpoint Control Register 7 -------- */
#define USBCORE_UEP7_EPHSHK_Pos               _UINT32_(0)                                          /* (USBCORE_UEP7) Endpoint Handshake Enable bit Position */
#define USBCORE_UEP7_EPHSHK_Msk               (_UINT32_(0x1) << USBCORE_UEP7_EPHSHK_Pos)           /* (USBCORE_UEP7) Endpoint Handshake Enable bit Mask */
#define USBCORE_UEP7_EPHSHK(value)            (USBCORE_UEP7_EPHSHK_Msk & (_UINT32_(value) << USBCORE_UEP7_EPHSHK_Pos)) /* Assigment of value for EPHSHK in the USBCORE_UEP7 register */
#define   USBCORE_UEP7_EPHSHK_ON_Val          _UINT32_(0x1)                                        /* (USBCORE_UEP7) Endpoint Handshake is enabled  */
#define   USBCORE_UEP7_EPHSHK_OFF_Val         _UINT32_(0x0)                                        /* (USBCORE_UEP7) Endpoint Handshake is disabled (typically used for isochronous endpoints)  */
#define USBCORE_UEP7_EPHSHK_ON                (USBCORE_UEP7_EPHSHK_ON_Val << USBCORE_UEP7_EPHSHK_Pos) /* (USBCORE_UEP7) Endpoint Handshake is enabled Position  */
#define USBCORE_UEP7_EPHSHK_OFF               (USBCORE_UEP7_EPHSHK_OFF_Val << USBCORE_UEP7_EPHSHK_Pos) /* (USBCORE_UEP7) Endpoint Handshake is disabled (typically used for isochronous endpoints) Position  */
#define USBCORE_UEP7_EPSTALL_Pos              _UINT32_(1)                                          /* (USBCORE_UEP7) Endpoint Stall Status bit Position */
#define USBCORE_UEP7_EPSTALL_Msk              (_UINT32_(0x1) << USBCORE_UEP7_EPSTALL_Pos)          /* (USBCORE_UEP7) Endpoint Stall Status bit Mask */
#define USBCORE_UEP7_EPSTALL(value)           (USBCORE_UEP7_EPSTALL_Msk & (_UINT32_(value) << USBCORE_UEP7_EPSTALL_Pos)) /* Assigment of value for EPSTALL in the USBCORE_UEP7 register */
#define   USBCORE_UEP7_EPSTALL_STALL_Val      _UINT32_(0x1)                                        /* (USBCORE_UEP7) Endpoint 7 was stalled  */
#define   USBCORE_UEP7_EPSTALL_NOT_STALL_Val  _UINT32_(0x0)                                        /* (USBCORE_UEP7) Endpoint 7 was not stalled  */
#define USBCORE_UEP7_EPSTALL_STALL            (USBCORE_UEP7_EPSTALL_STALL_Val << USBCORE_UEP7_EPSTALL_Pos) /* (USBCORE_UEP7) Endpoint 7 was stalled Position  */
#define USBCORE_UEP7_EPSTALL_NOT_STALL        (USBCORE_UEP7_EPSTALL_NOT_STALL_Val << USBCORE_UEP7_EPSTALL_Pos) /* (USBCORE_UEP7) Endpoint 7 was not stalled Position  */
#define USBCORE_UEP7_EPTXEN_Pos               _UINT32_(2)                                          /* (USBCORE_UEP7) Endpoint Transmit Enable bit Position */
#define USBCORE_UEP7_EPTXEN_Msk               (_UINT32_(0x1) << USBCORE_UEP7_EPTXEN_Pos)           /* (USBCORE_UEP7) Endpoint Transmit Enable bit Mask */
#define USBCORE_UEP7_EPTXEN(value)            (USBCORE_UEP7_EPTXEN_Msk & (_UINT32_(value) << USBCORE_UEP7_EPTXEN_Pos)) /* Assigment of value for EPTXEN in the USBCORE_UEP7 register */
#define   USBCORE_UEP7_EPTXEN_ON_Val          _UINT32_(0x1)                                        /* (USBCORE_UEP7) Endpoint 7 transmit is enabled  */
#define   USBCORE_UEP7_EPTXEN_OFF_Val         _UINT32_(0x0)                                        /* (USBCORE_UEP7) Endpoint 7 transmit is disabled  */
#define USBCORE_UEP7_EPTXEN_ON                (USBCORE_UEP7_EPTXEN_ON_Val << USBCORE_UEP7_EPTXEN_Pos) /* (USBCORE_UEP7) Endpoint 7 transmit is enabled Position  */
#define USBCORE_UEP7_EPTXEN_OFF               (USBCORE_UEP7_EPTXEN_OFF_Val << USBCORE_UEP7_EPTXEN_Pos) /* (USBCORE_UEP7) Endpoint 7 transmit is disabled Position  */
#define USBCORE_UEP7_EPRXEN_Pos               _UINT32_(3)                                          /* (USBCORE_UEP7) Endpoint Receive Enable bit Position */
#define USBCORE_UEP7_EPRXEN_Msk               (_UINT32_(0x1) << USBCORE_UEP7_EPRXEN_Pos)           /* (USBCORE_UEP7) Endpoint Receive Enable bit Mask */
#define USBCORE_UEP7_EPRXEN(value)            (USBCORE_UEP7_EPRXEN_Msk & (_UINT32_(value) << USBCORE_UEP7_EPRXEN_Pos)) /* Assigment of value for EPRXEN in the USBCORE_UEP7 register */
#define   USBCORE_UEP7_EPRXEN_ON_Val          _UINT32_(0x1)                                        /* (USBCORE_UEP7) Endpoint 7 receive is enabled  */
#define   USBCORE_UEP7_EPRXEN_OFF_Val         _UINT32_(0x0)                                        /* (USBCORE_UEP7) Endpoint 7 receive is disabled  */
#define USBCORE_UEP7_EPRXEN_ON                (USBCORE_UEP7_EPRXEN_ON_Val << USBCORE_UEP7_EPRXEN_Pos) /* (USBCORE_UEP7) Endpoint 7 receive is enabled Position  */
#define USBCORE_UEP7_EPRXEN_OFF               (USBCORE_UEP7_EPRXEN_OFF_Val << USBCORE_UEP7_EPRXEN_Pos) /* (USBCORE_UEP7) Endpoint 7 receive is disabled Position  */
#define USBCORE_UEP7_EPCONDIS_Pos             _UINT32_(4)                                          /* (USBCORE_UEP7) Bidirectional Endpoint Control bit Position */
#define USBCORE_UEP7_EPCONDIS_Msk             (_UINT32_(0x1) << USBCORE_UEP7_EPCONDIS_Pos)         /* (USBCORE_UEP7) Bidirectional Endpoint Control bit Mask */
#define USBCORE_UEP7_EPCONDIS(value)          (USBCORE_UEP7_EPCONDIS_Msk & (_UINT32_(value) << USBCORE_UEP7_EPCONDIS_Pos)) /* Assigment of value for EPCONDIS in the USBCORE_UEP7 register */
#define   USBCORE_UEP7_EPCONDIS_DISABLE_7_Val _UINT32_(0x1)                                        /* (USBCORE_UEP7) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 7 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored  */
#define   USBCORE_UEP7_EPCONDIS_ENABLE_7_Val  _UINT32_(0x0)                                        /* (USBCORE_UEP7) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 7 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored  */
#define USBCORE_UEP7_EPCONDIS_DISABLE_7       (USBCORE_UEP7_EPCONDIS_DISABLE_7_Val << USBCORE_UEP7_EPCONDIS_Pos) /* (USBCORE_UEP7) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 7 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored Position  */
#define USBCORE_UEP7_EPCONDIS_ENABLE_7        (USBCORE_UEP7_EPCONDIS_ENABLE_7_Val << USBCORE_UEP7_EPCONDIS_Pos) /* (USBCORE_UEP7) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 7 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored Position  */
#define USBCORE_UEP7_Msk                      _UINT32_(0x0000001F)                                 /* (USBCORE_UEP7) Register Mask  */


/* -------- USBCORE_UEP7CLR : (USBCORE Offset: 0x374) (R/W 32)  -------- */
#define USBCORE_UEP7CLR_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEP7CLR)   Reset Value */

