Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_tcp_client/src/packs/WBZ653_DFP/component/usbcore.h
/* -------- USBCORE_UEP9SET : (USBCORE Offset: 0x398) (R/W 32)  -------- */
#define USBCORE_UEP9SET_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEP9SET)   Reset Value */

#define USBCORE_UEP9SET_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEP9SET) Register Mask  */


/* -------- USBCORE_UEP9INV : (USBCORE Offset: 0x39C) (R/W 32)  -------- */
#define USBCORE_UEP9INV_RESETVALUE            _UINT32_(0x00)                                       /*  (USBCORE_UEP9INV)   Reset Value */

#define USBCORE_UEP9INV_Msk                   _UINT32_(0x00000000)                                 /* (USBCORE_UEP9INV) Register Mask  */


/* -------- USBCORE_U1EP10 : (USBCORE Offset: 0x3A0) (R/W 32) USB Endpoint Control Register 10 -------- */
#define USBCORE_U1EP10_EPHSHK_Pos             _UINT32_(0)                                          /* (USBCORE_U1EP10) Endpoint Handshake Enable bit Position */
#define USBCORE_U1EP10_EPHSHK_Msk             (_UINT32_(0x1) << USBCORE_U1EP10_EPHSHK_Pos)         /* (USBCORE_U1EP10) Endpoint Handshake Enable bit Mask */
#define USBCORE_U1EP10_EPHSHK(value)          (USBCORE_U1EP10_EPHSHK_Msk & (_UINT32_(value) << USBCORE_U1EP10_EPHSHK_Pos)) /* Assigment of value for EPHSHK in the USBCORE_U1EP10 register */
#define   USBCORE_U1EP10_EPHSHK_ON_Val        _UINT32_(0x1)                                        /* (USBCORE_U1EP10) Endpoint Handshake is enabled  */
#define   USBCORE_U1EP10_EPHSHK_OFF_Val       _UINT32_(0x0)                                        /* (USBCORE_U1EP10) Endpoint Handshake is disabled (typically used for isochronous endpoints)  */
#define USBCORE_U1EP10_EPHSHK_ON              (USBCORE_U1EP10_EPHSHK_ON_Val << USBCORE_U1EP10_EPHSHK_Pos) /* (USBCORE_U1EP10) Endpoint Handshake is enabled Position  */
#define USBCORE_U1EP10_EPHSHK_OFF             (USBCORE_U1EP10_EPHSHK_OFF_Val << USBCORE_U1EP10_EPHSHK_Pos) /* (USBCORE_U1EP10) Endpoint Handshake is disabled (typically used for isochronous endpoints) Position  */
#define USBCORE_U1EP10_EPSTALL_Pos            _UINT32_(1)                                          /* (USBCORE_U1EP10) Endpoint Stall Status bit Position */
#define USBCORE_U1EP10_EPSTALL_Msk            (_UINT32_(0x1) << USBCORE_U1EP10_EPSTALL_Pos)        /* (USBCORE_U1EP10) Endpoint Stall Status bit Mask */
#define USBCORE_U1EP10_EPSTALL(value)         (USBCORE_U1EP10_EPSTALL_Msk & (_UINT32_(value) << USBCORE_U1EP10_EPSTALL_Pos)) /* Assigment of value for EPSTALL in the USBCORE_U1EP10 register */
#define   USBCORE_U1EP10_EPSTALL_ON_Val       _UINT32_(0x1)                                        /* (USBCORE_U1EP10) Endpoint 10 was stalled  */
#define   USBCORE_U1EP10_EPSTALL_OFF_Val      _UINT32_(0x0)                                        /* (USBCORE_U1EP10) Endpoint 10 was not stalled  */
#define USBCORE_U1EP10_EPSTALL_ON             (USBCORE_U1EP10_EPSTALL_ON_Val << USBCORE_U1EP10_EPSTALL_Pos) /* (USBCORE_U1EP10) Endpoint 10 was stalled Position  */
#define USBCORE_U1EP10_EPSTALL_OFF            (USBCORE_U1EP10_EPSTALL_OFF_Val << USBCORE_U1EP10_EPSTALL_Pos) /* (USBCORE_U1EP10) Endpoint 10 was not stalled Position  */
#define USBCORE_U1EP10_EPTXEN_Pos             _UINT32_(2)                                          /* (USBCORE_U1EP10) Endpoint Transmit Enable bit Position */
#define USBCORE_U1EP10_EPTXEN_Msk             (_UINT32_(0x1) << USBCORE_U1EP10_EPTXEN_Pos)         /* (USBCORE_U1EP10) Endpoint Transmit Enable bit Mask */
#define USBCORE_U1EP10_EPTXEN(value)          (USBCORE_U1EP10_EPTXEN_Msk & (_UINT32_(value) << USBCORE_U1EP10_EPTXEN_Pos)) /* Assigment of value for EPTXEN in the USBCORE_U1EP10 register */
#define   USBCORE_U1EP10_EPTXEN_ON_Val        _UINT32_(0x1)                                        /* (USBCORE_U1EP10) Endpoint 10 transmit is enabled  */
#define   USBCORE_U1EP10_EPTXEN_OFF_Val       _UINT32_(0x0)                                        /* (USBCORE_U1EP10) Endpoint 10 transmit is disabled  */
#define USBCORE_U1EP10_EPTXEN_ON              (USBCORE_U1EP10_EPTXEN_ON_Val << USBCORE_U1EP10_EPTXEN_Pos) /* (USBCORE_U1EP10) Endpoint 10 transmit is enabled Position  */
#define USBCORE_U1EP10_EPTXEN_OFF             (USBCORE_U1EP10_EPTXEN_OFF_Val << USBCORE_U1EP10_EPTXEN_Pos) /* (USBCORE_U1EP10) Endpoint 10 transmit is disabled Position  */
#define USBCORE_U1EP10_EPRXEN_Pos             _UINT32_(3)                                          /* (USBCORE_U1EP10) Endpoint Receive Enable bit Position */
#define USBCORE_U1EP10_EPRXEN_Msk             (_UINT32_(0x1) << USBCORE_U1EP10_EPRXEN_Pos)         /* (USBCORE_U1EP10) Endpoint Receive Enable bit Mask */
#define USBCORE_U1EP10_EPRXEN(value)          (USBCORE_U1EP10_EPRXEN_Msk & (_UINT32_(value) << USBCORE_U1EP10_EPRXEN_Pos)) /* Assigment of value for EPRXEN in the USBCORE_U1EP10 register */
#define   USBCORE_U1EP10_EPRXEN_ENABLE_10_Val _UINT32_(0x1)                                        /* (USBCORE_U1EP10) Endpoint 10 receive is enabled  */
#define   USBCORE_U1EP10_EPRXEN_DISABLE_10_Val _UINT32_(0x0)                                        /* (USBCORE_U1EP10) Endpoint 10 receive is disabled  */
#define USBCORE_U1EP10_EPRXEN_ENABLE_10       (USBCORE_U1EP10_EPRXEN_ENABLE_10_Val << USBCORE_U1EP10_EPRXEN_Pos) /* (USBCORE_U1EP10) Endpoint 10 receive is enabled Position  */
#define USBCORE_U1EP10_EPRXEN_DISABLE_10      (USBCORE_U1EP10_EPRXEN_DISABLE_10_Val << USBCORE_U1EP10_EPRXEN_Pos) /* (USBCORE_U1EP10) Endpoint 10 receive is disabled Position  */
#define USBCORE_U1EP10_EPCONDIS_Pos           _UINT32_(4)                                          /* (USBCORE_U1EP10) Bidirectional Endpoint Control bit Position */
#define USBCORE_U1EP10_EPCONDIS_Msk           (_UINT32_(0x1) << USBCORE_U1EP10_EPCONDIS_Pos)       /* (USBCORE_U1EP10) Bidirectional Endpoint Control bit Mask */
#define USBCORE_U1EP10_EPCONDIS(value)        (USBCORE_U1EP10_EPCONDIS_Msk & (_UINT32_(value) << USBCORE_U1EP10_EPCONDIS_Pos)) /* Assigment of value for EPCONDIS in the USBCORE_U1EP10 register */
#define   USBCORE_U1EP10_EPCONDIS_DISABLE_10_Val _UINT32_(0x1)                                        /* (USBCORE_U1EP10) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 10 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored  */
#define   USBCORE_U1EP10_EPCONDIS_ENABLE_10_Val _UINT32_(0x0)                                        /* (USBCORE_U1EP10) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 10 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored  */
#define USBCORE_U1EP10_EPCONDIS_DISABLE_10    (USBCORE_U1EP10_EPCONDIS_DISABLE_10_Val << USBCORE_U1EP10_EPCONDIS_Pos) /* (USBCORE_U1EP10) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 10 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored Position  */
#define USBCORE_U1EP10_EPCONDIS_ENABLE_10     (USBCORE_U1EP10_EPCONDIS_ENABLE_10_Val << USBCORE_U1EP10_EPCONDIS_Pos) /* (USBCORE_U1EP10) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 10 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored Position  */
#define USBCORE_U1EP10_Msk                    _UINT32_(0x0000001F)                                 /* (USBCORE_U1EP10) Register Mask  */


