Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_tcp_client/src/packs/WBZ653_DFP/component/usbcore.h
#define USBCORE_UEP12CLR_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_UEP12CLR) Register Mask  */


/* -------- USBCORE_UEP12SET : (USBCORE Offset: 0x3C8) (R/W 32)  -------- */
#define USBCORE_UEP12SET_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_UEP12SET)   Reset Value */

#define USBCORE_UEP12SET_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_UEP12SET) Register Mask  */


/* -------- USBCORE_UEP12INV : (USBCORE Offset: 0x3CC) (R/W 32)  -------- */
#define USBCORE_UEP12INV_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_UEP12INV)   Reset Value */

#define USBCORE_UEP12INV_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_UEP12INV) Register Mask  */


/* -------- USBCORE_U1EP13 : (USBCORE Offset: 0x3D0) (R/W 32) USB Endpoint Control Register 13 -------- */
#define USBCORE_U1EP13_EPHSHK_Pos             _UINT32_(0)                                          /* (USBCORE_U1EP13) Endpoint Handshake Enable bit Position */
#define USBCORE_U1EP13_EPHSHK_Msk             (_UINT32_(0x1) << USBCORE_U1EP13_EPHSHK_Pos)         /* (USBCORE_U1EP13) Endpoint Handshake Enable bit Mask */
#define USBCORE_U1EP13_EPHSHK(value)          (USBCORE_U1EP13_EPHSHK_Msk & (_UINT32_(value) << USBCORE_U1EP13_EPHSHK_Pos)) /* Assigment of value for EPHSHK in the USBCORE_U1EP13 register */
#define   USBCORE_U1EP13_EPHSHK_ON_Val        _UINT32_(0x1)                                        /* (USBCORE_U1EP13) Endpoint Handshake is enabled  */
#define   USBCORE_U1EP13_EPHSHK_OFF_Val       _UINT32_(0x0)                                        /* (USBCORE_U1EP13) Endpoint Handshake is disabled (typically used for isochronous endpoints)  */
#define USBCORE_U1EP13_EPHSHK_ON              (USBCORE_U1EP13_EPHSHK_ON_Val << USBCORE_U1EP13_EPHSHK_Pos) /* (USBCORE_U1EP13) Endpoint Handshake is enabled Position  */
#define USBCORE_U1EP13_EPHSHK_OFF             (USBCORE_U1EP13_EPHSHK_OFF_Val << USBCORE_U1EP13_EPHSHK_Pos) /* (USBCORE_U1EP13) Endpoint Handshake is disabled (typically used for isochronous endpoints) Position  */
#define USBCORE_U1EP13_EPSTALL_Pos            _UINT32_(1)                                          /* (USBCORE_U1EP13) Endpoint Stall Status bit Position */
#define USBCORE_U1EP13_EPSTALL_Msk            (_UINT32_(0x1) << USBCORE_U1EP13_EPSTALL_Pos)        /* (USBCORE_U1EP13) Endpoint Stall Status bit Mask */
#define USBCORE_U1EP13_EPSTALL(value)         (USBCORE_U1EP13_EPSTALL_Msk & (_UINT32_(value) << USBCORE_U1EP13_EPSTALL_Pos)) /* Assigment of value for EPSTALL in the USBCORE_U1EP13 register */
#define   USBCORE_U1EP13_EPSTALL_STALL_Val    _UINT32_(0x1)                                        /* (USBCORE_U1EP13) Endpoint 13 was stalled  */
#define   USBCORE_U1EP13_EPSTALL_NOT_STALL_Val _UINT32_(0x0)                                        /* (USBCORE_U1EP13) Endpoint 13 was not stalled  */
#define USBCORE_U1EP13_EPSTALL_STALL          (USBCORE_U1EP13_EPSTALL_STALL_Val << USBCORE_U1EP13_EPSTALL_Pos) /* (USBCORE_U1EP13) Endpoint 13 was stalled Position  */
#define USBCORE_U1EP13_EPSTALL_NOT_STALL      (USBCORE_U1EP13_EPSTALL_NOT_STALL_Val << USBCORE_U1EP13_EPSTALL_Pos) /* (USBCORE_U1EP13) Endpoint 13 was not stalled Position  */
#define USBCORE_U1EP13_EPTXEN_Pos             _UINT32_(2)                                          /* (USBCORE_U1EP13) Endpoint Transmit Enable bit Position */
#define USBCORE_U1EP13_EPTXEN_Msk             (_UINT32_(0x1) << USBCORE_U1EP13_EPTXEN_Pos)         /* (USBCORE_U1EP13) Endpoint Transmit Enable bit Mask */
#define USBCORE_U1EP13_EPTXEN(value)          (USBCORE_U1EP13_EPTXEN_Msk & (_UINT32_(value) << USBCORE_U1EP13_EPTXEN_Pos)) /* Assigment of value for EPTXEN in the USBCORE_U1EP13 register */
#define   USBCORE_U1EP13_EPTXEN_ON_Val        _UINT32_(0x1)                                        /* (USBCORE_U1EP13) Endpoint 13 transmit is enabled  */
#define   USBCORE_U1EP13_EPTXEN_OFF_Val       _UINT32_(0x0)                                        /* (USBCORE_U1EP13) Endpoint 13 transmit is disabled  */
#define USBCORE_U1EP13_EPTXEN_ON              (USBCORE_U1EP13_EPTXEN_ON_Val << USBCORE_U1EP13_EPTXEN_Pos) /* (USBCORE_U1EP13) Endpoint 13 transmit is enabled Position  */
#define USBCORE_U1EP13_EPTXEN_OFF             (USBCORE_U1EP13_EPTXEN_OFF_Val << USBCORE_U1EP13_EPTXEN_Pos) /* (USBCORE_U1EP13) Endpoint 13 transmit is disabled Position  */
#define USBCORE_U1EP13_EPRXEN_Pos             _UINT32_(3)                                          /* (USBCORE_U1EP13) Endpoint Receive Enable bit Position */
#define USBCORE_U1EP13_EPRXEN_Msk             (_UINT32_(0x1) << USBCORE_U1EP13_EPRXEN_Pos)         /* (USBCORE_U1EP13) Endpoint Receive Enable bit Mask */
#define USBCORE_U1EP13_EPRXEN(value)          (USBCORE_U1EP13_EPRXEN_Msk & (_UINT32_(value) << USBCORE_U1EP13_EPRXEN_Pos)) /* Assigment of value for EPRXEN in the USBCORE_U1EP13 register */
#define   USBCORE_U1EP13_EPRXEN_ON_Val        _UINT32_(0x1)                                        /* (USBCORE_U1EP13) Endpoint 13 receive is enabled  */
#define   USBCORE_U1EP13_EPRXEN_OFF_Val       _UINT32_(0x0)                                        /* (USBCORE_U1EP13) Endpoint 13 receive is disabled  */
#define USBCORE_U1EP13_EPRXEN_ON              (USBCORE_U1EP13_EPRXEN_ON_Val << USBCORE_U1EP13_EPRXEN_Pos) /* (USBCORE_U1EP13) Endpoint 13 receive is enabled Position  */
#define USBCORE_U1EP13_EPRXEN_OFF             (USBCORE_U1EP13_EPRXEN_OFF_Val << USBCORE_U1EP13_EPRXEN_Pos) /* (USBCORE_U1EP13) Endpoint 13 receive is disabled Position  */
#define USBCORE_U1EP13_EPCONDIS_Pos           _UINT32_(4)                                          /* (USBCORE_U1EP13) Bidirectional Endpoint Control bit Position */
#define USBCORE_U1EP13_EPCONDIS_Msk           (_UINT32_(0x1) << USBCORE_U1EP13_EPCONDIS_Pos)       /* (USBCORE_U1EP13) Bidirectional Endpoint Control bit Mask */
#define USBCORE_U1EP13_EPCONDIS(value)        (USBCORE_U1EP13_EPCONDIS_Msk & (_UINT32_(value) << USBCORE_U1EP13_EPCONDIS_Pos)) /* Assigment of value for EPCONDIS in the USBCORE_U1EP13 register */
#define   USBCORE_U1EP13_EPCONDIS_DISALBE_13_Val _UINT32_(0x1)                                        /* (USBCORE_U1EP13) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 13 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored  */
#define   USBCORE_U1EP13_EPCONDIS_ENABLE_13_Val _UINT32_(0x0)                                        /* (USBCORE_U1EP13) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 13 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored  */
#define USBCORE_U1EP13_EPCONDIS_DISALBE_13    (USBCORE_U1EP13_EPCONDIS_DISALBE_13_Val << USBCORE_U1EP13_EPCONDIS_Pos) /* (USBCORE_U1EP13) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 13 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored Position  */
#define USBCORE_U1EP13_EPCONDIS_ENABLE_13     (USBCORE_U1EP13_EPCONDIS_ENABLE_13_Val << USBCORE_U1EP13_EPCONDIS_Pos) /* (USBCORE_U1EP13) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 13 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored Position  */
#define USBCORE_U1EP13_Msk                    _UINT32_(0x0000001F)                                 /* (USBCORE_U1EP13) Register Mask  */


/* -------- USBCORE_UEP13CLR : (USBCORE Offset: 0x3D4) (R/W 32)  -------- */
#define USBCORE_UEP13CLR_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_UEP13CLR)   Reset Value */

#define USBCORE_UEP13CLR_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_UEP13CLR) Register Mask  */


/* -------- USBCORE_UEP13SET : (USBCORE Offset: 0x3D8) (R/W 32)  -------- */
#define USBCORE_UEP13SET_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_UEP13SET)   Reset Value */

