Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_tcp_client/src/packs/WBZ653_DFP/component/usbcore.h
#define USBCORE_UEP13SET_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_UEP13SET) Register Mask  */


/* -------- USBCORE_UEP13INV : (USBCORE Offset: 0x3DC) (R/W 32)  -------- */
#define USBCORE_UEP13INV_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_UEP13INV)   Reset Value */

#define USBCORE_UEP13INV_Msk                  _UINT32_(0x00000000)                                 /* (USBCORE_UEP13INV) Register Mask  */


/* -------- USBCORE_U1EP14 : (USBCORE Offset: 0x3E0) (R/W 32) USB Endpoint Control Register 14 -------- */
#define USBCORE_U1EP14_EPHSHK_Pos             _UINT32_(0)                                          /* (USBCORE_U1EP14) Endpoint Handshake Enable bit Position */
#define USBCORE_U1EP14_EPHSHK_Msk             (_UINT32_(0x1) << USBCORE_U1EP14_EPHSHK_Pos)         /* (USBCORE_U1EP14) Endpoint Handshake Enable bit Mask */
#define USBCORE_U1EP14_EPHSHK(value)          (USBCORE_U1EP14_EPHSHK_Msk & (_UINT32_(value) << USBCORE_U1EP14_EPHSHK_Pos)) /* Assigment of value for EPHSHK in the USBCORE_U1EP14 register */
#define   USBCORE_U1EP14_EPHSHK_ON_Val        _UINT32_(0x1)                                        /* (USBCORE_U1EP14) Endpoint Handshake is enabled  */
#define   USBCORE_U1EP14_EPHSHK_OFF_Val       _UINT32_(0x0)                                        /* (USBCORE_U1EP14) Endpoint Handshake is disabled (typically used for isochronous endpoints)  */
#define USBCORE_U1EP14_EPHSHK_ON              (USBCORE_U1EP14_EPHSHK_ON_Val << USBCORE_U1EP14_EPHSHK_Pos) /* (USBCORE_U1EP14) Endpoint Handshake is enabled Position  */
#define USBCORE_U1EP14_EPHSHK_OFF             (USBCORE_U1EP14_EPHSHK_OFF_Val << USBCORE_U1EP14_EPHSHK_Pos) /* (USBCORE_U1EP14) Endpoint Handshake is disabled (typically used for isochronous endpoints) Position  */
#define USBCORE_U1EP14_EPSTALL_Pos            _UINT32_(1)                                          /* (USBCORE_U1EP14) Endpoint Stall Status bit Position */
#define USBCORE_U1EP14_EPSTALL_Msk            (_UINT32_(0x1) << USBCORE_U1EP14_EPSTALL_Pos)        /* (USBCORE_U1EP14) Endpoint Stall Status bit Mask */
#define USBCORE_U1EP14_EPSTALL(value)         (USBCORE_U1EP14_EPSTALL_Msk & (_UINT32_(value) << USBCORE_U1EP14_EPSTALL_Pos)) /* Assigment of value for EPSTALL in the USBCORE_U1EP14 register */
#define   USBCORE_U1EP14_EPSTALL_STALL_Val    _UINT32_(0x1)                                        /* (USBCORE_U1EP14) Endpoint 14 was stalled  */
#define   USBCORE_U1EP14_EPSTALL_NOT_STALL_Val _UINT32_(0x0)                                        /* (USBCORE_U1EP14) Endpoint 14 was not stalled  */
#define USBCORE_U1EP14_EPSTALL_STALL          (USBCORE_U1EP14_EPSTALL_STALL_Val << USBCORE_U1EP14_EPSTALL_Pos) /* (USBCORE_U1EP14) Endpoint 14 was stalled Position  */
#define USBCORE_U1EP14_EPSTALL_NOT_STALL      (USBCORE_U1EP14_EPSTALL_NOT_STALL_Val << USBCORE_U1EP14_EPSTALL_Pos) /* (USBCORE_U1EP14) Endpoint 14 was not stalled Position  */
#define USBCORE_U1EP14_EPTXEN_Pos             _UINT32_(2)                                          /* (USBCORE_U1EP14) Endpoint Transmit Enable bit Position */
#define USBCORE_U1EP14_EPTXEN_Msk             (_UINT32_(0x1) << USBCORE_U1EP14_EPTXEN_Pos)         /* (USBCORE_U1EP14) Endpoint Transmit Enable bit Mask */
#define USBCORE_U1EP14_EPTXEN(value)          (USBCORE_U1EP14_EPTXEN_Msk & (_UINT32_(value) << USBCORE_U1EP14_EPTXEN_Pos)) /* Assigment of value for EPTXEN in the USBCORE_U1EP14 register */
#define   USBCORE_U1EP14_EPTXEN_ON_Val        _UINT32_(0x1)                                        /* (USBCORE_U1EP14) Endpoint 14 transmit is enabled  */
#define   USBCORE_U1EP14_EPTXEN_OFF_Val       _UINT32_(0x0)                                        /* (USBCORE_U1EP14) Endpoint 14 transmit is disabled  */
#define USBCORE_U1EP14_EPTXEN_ON              (USBCORE_U1EP14_EPTXEN_ON_Val << USBCORE_U1EP14_EPTXEN_Pos) /* (USBCORE_U1EP14) Endpoint 14 transmit is enabled Position  */
#define USBCORE_U1EP14_EPTXEN_OFF             (USBCORE_U1EP14_EPTXEN_OFF_Val << USBCORE_U1EP14_EPTXEN_Pos) /* (USBCORE_U1EP14) Endpoint 14 transmit is disabled Position  */
#define USBCORE_U1EP14_EPRXEN_Pos             _UINT32_(3)                                          /* (USBCORE_U1EP14) Endpoint Receive Enable bit Position */
#define USBCORE_U1EP14_EPRXEN_Msk             (_UINT32_(0x1) << USBCORE_U1EP14_EPRXEN_Pos)         /* (USBCORE_U1EP14) Endpoint Receive Enable bit Mask */
#define USBCORE_U1EP14_EPRXEN(value)          (USBCORE_U1EP14_EPRXEN_Msk & (_UINT32_(value) << USBCORE_U1EP14_EPRXEN_Pos)) /* Assigment of value for EPRXEN in the USBCORE_U1EP14 register */
#define   USBCORE_U1EP14_EPRXEN_ON_Val        _UINT32_(0x1)                                        /* (USBCORE_U1EP14) Endpoint 14 receive is enabled  */
#define   USBCORE_U1EP14_EPRXEN_OFF_Val       _UINT32_(0x0)                                        /* (USBCORE_U1EP14) Endpoint 14 receive is disabled  */
#define USBCORE_U1EP14_EPRXEN_ON              (USBCORE_U1EP14_EPRXEN_ON_Val << USBCORE_U1EP14_EPRXEN_Pos) /* (USBCORE_U1EP14) Endpoint 14 receive is enabled Position  */
#define USBCORE_U1EP14_EPRXEN_OFF             (USBCORE_U1EP14_EPRXEN_OFF_Val << USBCORE_U1EP14_EPRXEN_Pos) /* (USBCORE_U1EP14) Endpoint 14 receive is disabled Position  */
#define USBCORE_U1EP14_EPCONDIS_Pos           _UINT32_(4)                                          /* (USBCORE_U1EP14) Bidirectional Endpoint Control bit Position */
#define USBCORE_U1EP14_EPCONDIS_Msk           (_UINT32_(0x1) << USBCORE_U1EP14_EPCONDIS_Pos)       /* (USBCORE_U1EP14) Bidirectional Endpoint Control bit Mask */
#define USBCORE_U1EP14_EPCONDIS(value)        (USBCORE_U1EP14_EPCONDIS_Msk & (_UINT32_(value) << USBCORE_U1EP14_EPCONDIS_Pos)) /* Assigment of value for EPCONDIS in the USBCORE_U1EP14 register */
#define   USBCORE_U1EP14_EPCONDIS_DISABLE_14_Val _UINT32_(0x1)                                        /* (USBCORE_U1EP14) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 14 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored  */
#define   USBCORE_U1EP14_EPCONDIS_ENABLE_14_Val _UINT32_(0x0)                                        /* (USBCORE_U1EP14) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 14 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored  */
#define USBCORE_U1EP14_EPCONDIS_DISABLE_14    (USBCORE_U1EP14_EPCONDIS_DISABLE_14_Val << USBCORE_U1EP14_EPCONDIS_Pos) /* (USBCORE_U1EP14) (If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 14 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored Position  */
#define USBCORE_U1EP14_EPCONDIS_ENABLE_14     (USBCORE_U1EP14_EPCONDIS_ENABLE_14_Val << USBCORE_U1EP14_EPCONDIS_Pos) /* (USBCORE_U1EP14) (If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 14 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored Position  */
#define USBCORE_U1EP14_Msk                    _UINT32_(0x0000001F)                                 /* (USBCORE_U1EP14) Register Mask  */


/* -------- USBCORE_UEP14CLR : (USBCORE Offset: 0x3E4) (R/W 32)  -------- */
#define USBCORE_UEP14CLR_RESETVALUE           _UINT32_(0x00)                                       /*  (USBCORE_UEP14CLR)   Reset Value */

