Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_tcp_client/src/packs/WBZ653_DFP/component/usbcore.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief USBCORE register API structure */
typedef struct
{
  __I   uint8_t                        Reserved1[0x40];
  __IO  uint32_t                       USBCORE_UOTGIR;     /**< Offset: 0x40 (R/W  32) USB OTG Interrupt Status Register */
  __IO  uint32_t                       USBCORE_UOTGIRCLR;  /**< Offset: 0x44 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UOTGIRSET;  /**< Offset: 0x48 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UOTGIRINV;  /**< Offset: 0x4C (R/W  32)  */
  __IO  uint32_t                       USBCORE_UOTGIE;     /**< Offset: 0x50 (R/W  32) USB OTG Interrupt Enable Register */
  __IO  uint32_t                       USBCORE_UOTGIECLR;  /**< Offset: 0x54 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UOTGIESET;  /**< Offset: 0x58 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UOTGIEINV;  /**< Offset: 0x5C (R/W  32)  */
  __IO  uint32_t                       USBCORE_UOTGSTAT;   /**< Offset: 0x60 (R/W  32) USB OTG Status Register */
  __I   uint8_t                        Reserved2[0x0C];
  __IO  uint32_t                       USBCORE_UOTGCON;    /**< Offset: 0x70 (R/W  32) USB OTG Control Register */
  __IO  uint32_t                       USBCORE_UOTGCONCLR; /**< Offset: 0x74 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UOTGCONSET; /**< Offset: 0x78 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UOTGCONINV; /**< Offset: 0x7C (R/W  32)  */
  __IO  uint32_t                       USBCORE_UPWRC;      /**< Offset: 0x80 (R/W  32) USB Power Control Register */
  __IO  uint32_t                       USBCORE_UPWRCCLR;   /**< Offset: 0x84 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UPWRCSET;   /**< Offset: 0x88 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UPWRCINV;   /**< Offset: 0x8C (R/W  32)  */
  __I   uint8_t                        Reserved3[0x170];
  __IO  uint32_t                       USBCORE_UIR;        /**< Offset: 0x200 (R/W  32) USB Interrupt Register */
  __IO  uint32_t                       USBCORE_UIRCLR;     /**< Offset: 0x204 (R/W  32)  */
  __I   uint8_t                        Reserved4[0x08];
  __IO  uint32_t                       USBCORE_UIE;        /**< Offset: 0x210 (R/W  32) USB Interrupt Enable Register */
  __IO  uint32_t                       USBCORE_UIECLR;     /**< Offset: 0x214 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UIESET;     /**< Offset: 0x218 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UIEINV;     /**< Offset: 0x21C (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEIR;       /**< Offset: 0x220 (R/W  32) USB Error Interrupt Status Register */
  __IO  uint32_t                       USBCORE_UEIRCLR;    /**< Offset: 0x224 (R/W  32)  */
  __I   uint8_t                        Reserved5[0x08];
  __IO  uint32_t                       USBCORE_UEIE;       /**< Offset: 0x230 (R/W  32) USB Error Interrupt Enable Register */
  __IO  uint32_t                       USBCORE_UEIECLR;    /**< Offset: 0x234 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEIESET;    /**< Offset: 0x238 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEIEINV;    /**< Offset: 0x23C (R/W  32)  */
  __I   uint32_t                       USBCORE_USTAT;      /**< Offset: 0x240 (R/   32) USB Status Register */
  __IO  uint32_t                       USBCORE_USTATCLR;   /**< Offset: 0x244 (R/W  32)  */
  __IO  uint32_t                       USBCORE_USTATSET;   /**< Offset: 0x248 (R/W  32)  */
  __IO  uint32_t                       USBCORE_USTATINV;   /**< Offset: 0x24C (R/W  32)  */
  __IO  uint32_t                       USBCORE_UCON;       /**< Offset: 0x250 (R/W  32) USB Control Register */
  __IO  uint32_t                       USBCORE_UCONCLR;    /**< Offset: 0x254 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UCONSET;    /**< Offset: 0x258 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UCONINV;    /**< Offset: 0x25C (R/W  32)  */
  __IO  uint32_t                       USBCORE_UADDR;      /**< Offset: 0x260 (R/W  32) USB Address Register */
  __IO  uint32_t                       USBCORE_UADDRCLR;   /**< Offset: 0x264 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UADDRSET;   /**< Offset: 0x268 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UADDRINV;   /**< Offset: 0x26C (R/W  32)  */
  __IO  uint32_t                       USBCORE_UBDTP1;     /**< Offset: 0x270 (R/W  32) USB BDT Page 1 Register */
  __IO  uint32_t                       USBCORE_UBDTP1CLR;  /**< Offset: 0x274 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UBDTP1SET;  /**< Offset: 0x278 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UBDTP1INV;  /**< Offset: 0x27C (R/W  32)  */
  __I   uint32_t                       USBCORE_UFRML;      /**< Offset: 0x280 (R/   32) USB Frame Number Low Register */
  __IO  uint32_t                       USBCORE_UFRMLCLR;   /**< Offset: 0x284 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UFRMLSET;   /**< Offset: 0x288 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UFRMLINV;   /**< Offset: 0x28C (R/W  32)  */
  __I   uint32_t                       USBCORE_UFRMH;      /**< Offset: 0x290 (R/   32) USB Frame Number High Register */
  __IO  uint32_t                       USBCORE_UFRMHCLR;   /**< Offset: 0x294 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UFRMHSET;   /**< Offset: 0x298 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UFRMHINV;   /**< Offset: 0x29C (R/W  32)  */
  __IO  uint32_t                       USBCORE_UTOK;       /**< Offset: 0x2A0 (R/W  32) USB Token Register */
  __IO  uint32_t                       USBCORE_UTOKCLR;    /**< Offset: 0x2A4 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UTOKSET;    /**< Offset: 0x2A8 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UTOKINV;    /**< Offset: 0x2AC (R/W  32)  */
  __IO  uint32_t                       USBCORE_USOF;       /**< Offset: 0x2B0 (R/W  32) USB SOF Threshold Register */
  __IO  uint32_t                       USBCORE_USOFCLR;    /**< Offset: 0x2B4 (R/W  32)  */
  __IO  uint32_t                       USBCORE_USOFSET;    /**< Offset: 0x2B8 (R/W  32)  */
  __IO  uint32_t                       USBCORE_USOFINV;    /**< Offset: 0x2BC (R/W  32)  */
  __IO  uint32_t                       USBCORE_UBDTP2;     /**< Offset: 0x2C0 (R/W  32) USB BDT PAGE 2 Register */
  __IO  uint32_t                       USBCORE_UBDTP2CLR;  /**< Offset: 0x2C4 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UBDTP2SET;  /**< Offset: 0x2C8 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UBDTP2INV;  /**< Offset: 0x2CC (R/W  32)  */
  __IO  uint32_t                       USBCORE_UBDTP3;     /**< Offset: 0x2D0 (R/W  32) USB BDT PAGE 3 Register */
  __IO  uint32_t                       USBCORE_UBDTP3CLR;  /**< Offset: 0x2D4 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UBDTP3SET;  /**< Offset: 0x2D8 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UBDTP3INV;  /**< Offset: 0x2DC (R/W  32)  */
  __IO  uint32_t                       USBCORE_UCNFG1;     /**< Offset: 0x2E0 (R/W  32) USB Configuration 1 Register */
  __IO  uint32_t                       USBCORE_UCNFG1CLR;  /**< Offset: 0x2E4 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UCNFG1SET;  /**< Offset: 0x2E8 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UCNFG1INV;  /**< Offset: 0x2EC (R/W  32)  */
  __I   uint8_t                        Reserved6[0x10];
  __IO  uint32_t                       USBCORE_UEP0;       /**< Offset: 0x300 (R/W  32) USB Endpoint Control Register 0 */
  __IO  uint32_t                       USBCORE_UEP0CLR;    /**< Offset: 0x304 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP0SET;    /**< Offset: 0x308 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP0INV;    /**< Offset: 0x30C (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP1;       /**< Offset: 0x310 (R/W  32) USB Endpoint Control Register 1 */
  __IO  uint32_t                       USBCORE_UEP1CLR;    /**< Offset: 0x314 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP1SET;    /**< Offset: 0x318 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP1INV;    /**< Offset: 0x31C (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP2;       /**< Offset: 0x320 (R/W  32) USB Endpoint Control Register 2 */
  __IO  uint32_t                       USBCORE_UEP2CLR;    /**< Offset: 0x324 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP2SET;    /**< Offset: 0x328 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP2INV;    /**< Offset: 0x32C (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP3;       /**< Offset: 0x330 (R/W  32) USB Endpoint Control Register 3 */
  __IO  uint32_t                       USBCORE_UEP3CLR;    /**< Offset: 0x334 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP3SET;    /**< Offset: 0x338 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP3INV;    /**< Offset: 0x33C (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP4;       /**< Offset: 0x340 (R/W  32) USB Endpoint Control Register 4 */
  __IO  uint32_t                       USBCORE_UEP4CLR;    /**< Offset: 0x344 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP4SET;    /**< Offset: 0x348 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP4INV;    /**< Offset: 0x34C (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP5;       /**< Offset: 0x350 (R/W  32) USB Endpoint Control Register 5 */
  __IO  uint32_t                       USBCORE_UEP5CLR;    /**< Offset: 0x354 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP5SET;    /**< Offset: 0x358 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP5INV;    /**< Offset: 0x35C (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP6;       /**< Offset: 0x360 (R/W  32) USB Endpoint Control Register 6 */
  __IO  uint32_t                       USBCORE_UEP6CLR;    /**< Offset: 0x364 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP6SET;    /**< Offset: 0x368 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP6INV;    /**< Offset: 0x36C (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP7;       /**< Offset: 0x370 (R/W  32) USB Endpoint Control Register 7 */
  __IO  uint32_t                       USBCORE_UEP7CLR;    /**< Offset: 0x374 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP7SET;    /**< Offset: 0x378 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP7INV;    /**< Offset: 0x37C (R/W  32)  */
  __IO  uint32_t                       USBCORE_U1EP8;      /**< Offset: 0x380 (R/W  32) USB Endpoint Control Register 8 */
  __IO  uint32_t                       USBCORE_UEP8CLR;    /**< Offset: 0x384 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP8SET;    /**< Offset: 0x388 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP8INV;    /**< Offset: 0x38C (R/W  32)  */
  __IO  uint32_t                       USBCORE_U1EP9;      /**< Offset: 0x390 (R/W  32) USB Endpoint Control Register 9 */
  __IO  uint32_t                       USBCORE_UEP9CLR;    /**< Offset: 0x394 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP9SET;    /**< Offset: 0x398 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP9INV;    /**< Offset: 0x39C (R/W  32)  */
  __IO  uint32_t                       USBCORE_U1EP10;     /**< Offset: 0x3A0 (R/W  32) USB Endpoint Control Register 10 */
  __IO  uint32_t                       USBCORE_UEP10CLR;   /**< Offset: 0x3A4 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP10SET;   /**< Offset: 0x3A8 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP10INV;   /**< Offset: 0x3AC (R/W  32)  */
  __IO  uint32_t                       USBCORE_U1EP11;     /**< Offset: 0x3B0 (R/W  32) USB Endpoint Control Register 11 */
  __IO  uint32_t                       USBCORE_UEP11CLR;   /**< Offset: 0x3B4 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP11SET;   /**< Offset: 0x3B8 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP11INV;   /**< Offset: 0x3BC (R/W  32)  */
  __IO  uint32_t                       USBCORE_U1EP12;     /**< Offset: 0x3C0 (R/W  32) USB Endpoint Control Register 12 */
  __IO  uint32_t                       USBCORE_UEP12CLR;   /**< Offset: 0x3C4 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP12SET;   /**< Offset: 0x3C8 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP12INV;   /**< Offset: 0x3CC (R/W  32)  */
  __IO  uint32_t                       USBCORE_U1EP13;     /**< Offset: 0x3D0 (R/W  32) USB Endpoint Control Register 13 */
  __IO  uint32_t                       USBCORE_UEP13CLR;   /**< Offset: 0x3D4 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP13SET;   /**< Offset: 0x3D8 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP13INV;   /**< Offset: 0x3DC (R/W  32)  */
  __IO  uint32_t                       USBCORE_U1EP14;     /**< Offset: 0x3E0 (R/W  32) USB Endpoint Control Register 14 */
  __IO  uint32_t                       USBCORE_UEP14CLR;   /**< Offset: 0x3E4 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP14SET;   /**< Offset: 0x3E8 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP14INV;   /**< Offset: 0x3EC (R/W  32)  */
  __IO  uint32_t                       USBCORE_U1EP15;     /**< Offset: 0x3F0 (R/W  32) USB Endpoint Control Register 15 */
  __IO  uint32_t                       USBCORE_UEP15CLR;   /**< Offset: 0x3F4 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP15SET;   /**< Offset: 0x3F8 (R/W  32)  */
  __IO  uint32_t                       USBCORE_UEP15INV;   /**< Offset: 0x3FC (R/W  32)  */
} usbcore_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _WBZ65_USBCORE_COMPONENT_H_ */
